import React from "react";
import '../Main/Main.css'

export const Info = () => {
    return(
        <div className='frame-text'>
        <div className='Main'>
            <p className='general-first'>Основными источниками наших исследований являются книги записи актов гражданского состояния (до 1918 г. – метрические книги), исповедные росписи православных церквей, официальные переписи населения (ревизские сказки), поземельные переписи, различные списки и другие архивные документы.
                </p><p className='general-first'>
            Литература:
            </p>
            <ul className='general-second' style={{textAlign: 'left', listStyleType: 'decimal'}}>
                <li>
                История городов и сел Украинской ССР: В 26 т. Днепропетровская область / АН УССР. Ин-т истории; Гл. редкол.: П. Т. Тронько (пред.) и др. – К.: Гл. ред. Укр. сов. энцикл. АН УССР, 1977. – 837 с.
            </li><li>
                История городов и сел Украинской ССР: В 26 т. Донецкая область / АН УССР. Ин-т истории; Гл. редкол.: П. Т. Тронько (пред.) и др. – К.: Гл. ред. Укр. сов. энцикл. АН УССР, 1976. – 811с.
            </li><li>
                История городов и сел Украинской ССР: В 26 т. 3апорожская область / АН УССР. Ин-т истории; Гл. редкол.: П. Т. Тронько (пред.) и др. – К.: Гл. ред. Укр. сов. энцикл. АН УССР, 1981. – 726 с.
            </li><li>
                История городов и сел Украинской ССР: В 26 т. Киев / АН УССР. Ин-т истории; Гл. редкол.: П. Т. Тронько (пред.) и др. – К.: Гл. ред. Укр. сов. энцикл. АН УССР, 1982. – 622 с.
            </li><li>
                Історія міст і сіл Української РСР. Кіровоградська область. — К.: Головна редакція УРЕ АН УРСР, 1972. — 816 с.
            </li><li>
                История городов и сел Украинской ССР: В 26 т. Николаевская область / АН УССР. Ин-т истории; Гл. редкол.: П. Т. Тронько (пред.) и др. – К.: Гл. ред. Укр. сов. энцикл. АН УССР, 1981. – 712 с.
            </li><li>
                Історія міст і сіл Української РСР. Полтавська область. — К.: Головна редакція УРЕ АН УРСР, 1967. — 352 с.
            </li><li>
                История городов и сел Украинской ССР: В 26 т. Сумская область / АН УССР. Ин-т истории; Гл. редкол.: П. Т. Тронько (пред.) и др. – К.: Гл. ред. Укр. сов. энцикл. АН УССР, 1980. – 698 с.
            </li><li>
                История городов и сел Украинской ССР: В 26 т. Харьковская область / АН УССР. Ин-т истории; Гл. редкол.: П. Т. Тронько (пред.) и др. – К.: Гл. ред. Укр. сов. энцикл. АН УССР, 1976. – 722 с.
            </li><li>
                История городов и сел Украинской ССР: В 26 т. Херсонская область / АН УССР. Ин-т истории; Гл. редкол.: П. Т. Тронько (пред.) и др. – К.: Гл. ред. Укр. сов. энцикл. АН УССР, 1983. – 667 с.
            </li><li>
                История городов и сел Украинской ССР: В 26 т. Черниговская область / АН УССР. Ин-т истории; Гл. редкол.: П. Т. Тронько (пред.) и др. – К.: Гл. ред. Укр. сов. энцикл. АН УССР, 1983. – 815 с.
            </li><li>
                Історія міст і сіл Української РСР. Черкаська область. — К.: Головна редакція УРЕ АН УРСР, 1972. — 788 с.
            </li><li>
                Список населенных мест Киевской губернии / Издание Киевского губернского статистического коммитета. – Киев: Типография Ивановой, 1900. – 1976 c.
            </li><li>
                Список населенных мест Полтавской губернии с кратким географическим очерком губернии / Издание Полтавского губернского статистического комитета. — Полтава: Типография Подземского, 1912. — 517 с.
            </li><li>
                Списки населенных мест Российской империи, составленные и издаваемые Центральным статистическим комитетом Министерства внутренних дел. - СПб. : изд. Центр. стат. ком. Мин. внутр. дел, 1861-1885.
            </li>
            </ul>
        </div>
        </div>
    )
}