export let dataru = [
    {
  name: "Воронежская губерния",
  data: [
    {name:"Бирюченский уезд"},
    {name:"Бобровский уезд"},
    {name:"Богучарский уезд"},
    {name:"Валуйский уезд"},
    {name:"Воронежский уезд"},
    {name:"Задонский уезд"},
    {name:"Землянский уезд"},
    {name:"Коротоякский уезд"},
    {name:"Нижнедевицкий уезд"},
    {name:"Новохопёрский уезд"},
    {name:"Острогожский уезд"},
    {name:"Павловский уезд"}
  ]
},
    {
        name: "Екатеринославская губерния",
        data: [
            {
                name: "Александровский уезд",
                data: [
                    {
                        name: 'г. Александровск',
                        data: []
                    },
                    {
                        name: 'Андреевская волость',
                        data: [
                            {
                                name: 'с. Андреевка',
                                data: []
                            },
                            {
                                name: 'д. Васильевка',
                                data: []
                            },
                            {
                                name: 'д. Волнянка',
                                data: []
                            },
                            {
                                name: 'д. Михайловка',
                                data: []
                            },
                            {
                                name: 'д. Павло-Кичкас (список фамилий за 1816 г.)',
                                data: 'Бабуренко, Бабынов, Бовкуненко, Бондаренко, Буйненко, Вельможна, Гончарук, Гук, Гупенко, Долгой, Домашевский, Дончевский, Дрюченко, Дудник, Евенко, Заблуда, Зющенко, Кабаленко, Кальниш, Качан, Коваленко, Ковбасенко, Коломиец, Куличенко, Левченко, Лепченко, Литвин, Малой, Мандич, Медведев, Меняйло (?), Мерошник, Мухин, Сапожник, Соколов, Соловенко, Солошенко, Терновский, Ткач, Ткаченко, Уласенко, Усатенко, Усатой, Циганов, Чабан, Череватой, Черный, Чернышевский, Чернявский, Чумаченко, Швец, Шевченко, Шкурлат',
                            },
                        ]
                    },
                    {
                        name: 'Басанская волость',
                        data: [
                            {
                                name: 'с. Басани',
                                data: []
                            },
                            {
                                name: 'с. Семеновка',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Больше-Михайловская волость',
                        data: [
                            {
                                name: 'д. Алексеевка',
                                data: []
                            },
                            {
                                name: 'д. Белозубовка',
                                data: []
                            },
                            {
                                name: 'с. Больше-Михайловка (список фамилий за 1858 г.)',
                                data: 'Антебура, Бездетко, Беличенко, Бугрим, Дворцовой, Завгородний, Задорожный, Зюненко, Калиберда, Капуста, Кривобок, Кривокобылка, Павлюк, Логвиненко, Мартиненко, Мачула, Мороховец, Пахольский, Обливанной, Овчар, Онипко, Процан, Сергеенко, Ткач, Чепа, Шелестенко, Шовкоус, Щусенко'
                            },
                            {
                                name: 'д. Вербовая',
                                data: []
                            },
                            {
                                name: 'д. Евграфовка',
                                data: []
                            },
                            {
                                name: 'д. Марьяновка',
                                data: []
                            },
                            {
                                name: 'д. Новоселовка',
                                data: []
                            },
                            {
                                name: 'д. Орестополь',
                                data: []
                            },
                            {
                                name: 'д. Петродоровка',
                                data: []
                            },
                            {
                                name: 'д. Петровка (некоторые фамилии жителей села в 1844-45 гг.)',
                                data: 'Антипов, Анютин, помещик Брусенцов, Волков, Гаранчин, Грабин, Дерябин, Захарьев, Папанин, Сергиенко, Силкин, Сулиев, Шаталов'
                            },
                            {
                                name: 'д. Синегубовка',
                                data: []
                            },
                            {
                                name: 'д. Терновая',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Белогорьевская волость',
                        data: [
                            {
                                name: 'с. Белогорье',
                                data: []
                            },
                            {
                                name: 'хут. Лимарское',
                                data: []
                            },
                            {
                                name: 'д. Новоселовка',
                                data: []
                            },
                            {
                                name: 'д. Осиповка (список крестьян в 1858 г.)',
                                data: 'Возненко, Крижний, Мартиненко, Медведев, Череватый, Шкарупилый'
                            },
                        ]
                    },
                    {
                        name: 'Белоцерковская волость',
                        data: [
                            {
                                name: 'с. Белоцерковка',
                                data: []
                            },
                            {
                                name: 'с. Благовещенка',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Вознесенская волость',
                        data: [
                            {
                                name: 'с. Вознесенка',
                                data: []
                            },
                            {
                                name: 'с. Новогупаловка',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Воскресенская волость',
                        data: [
                            {
                                name: 'хут. Веселая',
                                data: []
                            },
                            {
                                name: 'хут. Вольное',
                                data: []
                            },
                            {
                                name: 'с. Воскресенка (списки фамилий за 1850 и 1858 гг.)',
                                data: 'Базарный, Белоусенко он же Глухеньченко, Васильченко он же Громовый, Ведмеденко он же Криса, Власенко, Вовк, Вовченко, Гайша, Гниденко, Головко, Закревский, Клименко он же Торба, Кодык, Колодяжный, Корнеенко, Кумпаненко, Лисица, Лисовенко, Лисовый, Ляшенко он же Кочерецький, Марченко, Микульцов, Михайличенко, Мотузка, Недвига, Нечай, Обекуменко он же Лизя (Лизенко), Онищенко, Онищенко он же Вынник, Педан, Педан он же Шайтана, Поняченко он же Семеренко, Прудненко он же Борец, Пышный, Рыбалка, Рыбалка он же Таратута, Рябоштан, Смитаненко, Стрелец, Харченко, Чебан, Чебаненко, Черневский, Чумаченко, Яценко'
                            },
                            {
                                name: 'хут. Каменка',
                                data: []
                            },
                            {
                                name: 'д. Любокут',
                                data: []
                            },
                            {
                                name: 'с. Новоселовка',
                                data: []
                            },
                            {
                                name: 'хут. Семеновский',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Гавриловская волость',
                        data: [
                            {
                                name: 'д. Васильевка',
                                data: []
                            },
                            {
                                name: 'д. Владимировка',
                                data: []
                            },
                            {
                                name: 'с. Гавриловка',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Григорьевская волость (Кривой Рог)',
                        data: [
                            {
                                name: 'с. Григорьевка Кривой Рог',
                                data: []
                            },
                            {
                                name: 'д. Дебальцево',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Григорьевская волость (на р. Конке)',
                        data: [
                            {
                                name: 'д. Больше-Екатериновка',
                                data: []
                            },
                            {
                                name: 'м-ко Григорьевка',
                                data: []
                            },
                            {
                                name: 'д. Мало-Екатериновка',
                                data: []
                            },
                            {
                                name: 'д. Юльевка',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Гуляйпольская волость',
                        data: [
                            {
                                name: 'д. Варваровка',
                                data: []
                            },
                            {
                                name: 'д. Верхняя Терса',
                                data: []
                            },
                            {
                                name: 'с. Воздвиженка',
                                data: []
                            },
                            {
                                name: 'д. Еленодаровка',
                                data: []
                            },
                            {
                                name: 'д. Косовцовка №1 и №2',
                                data: []
                            },
                            {
                                name: 'д. Марфополь',
                                data: []
                            },
                            {
                                name: 'д. Мирополь',
                                data: []
                            },
                            {
                                name: 'с. Рождественка',
                                data: []
                            },
                            {
                                name: 'д. Сигор',
                                data: []
                            },
                            {
                                name: 'д. Хвалибоговка (список крестьян и дворовых людей, 1835 г.)',
                                data: 'Бочков (помещик), Велидицкий, Громовой, Зинченко, Коваленко, Колодка, Кононов, Литвиненко, Риченко он же Иващенко, Руленко, Хмара, Худяков, Чепурненко, Шатилов'
                            },
                        ]
                    },
                    {
                        name: 'Жеребецкая волость',
                        data: [
                            {
                                name: 'с. Жеребец',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Заливянская волость',
                        data: [
                            {
                                name: 'д. Богдановка',
                                data: []
                            },
                            {
                                name: 'д. Бойковка',
                                data: []
                            },
                            {
                                name: 'д. Веселогорка',
                                data: []
                            },
                            {
                                name: 'д. Воскресенка (Ханюковка)',
                                data: []
                            },
                            {
                                name: 'с. Заливное',
                                data: []
                            },
                            {
                                name: 'д. Константиновка',
                                data: []
                            },
                            {
                                name: 'д. Литовка',
                                data: []
                            },
                            {
                                name: 'с. Любицкое',
                                data: []
                            },
                            {
                                name: 'д. Солонцеватая',
                                data: []
                            },
                            {
                                name: 'д. Софиевка',
                                data: []
                            },
                            {
                                name: 'д. Христофоровка',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Ивановская волость',
                        data: [
                            {
                                name: 'д. Александровка',
                                data: []
                            },
                            {
                                name: 'д. Веселое',
                                data: []
                            },
                            {
                                name: 'с. Ивановка (списки фамилий за 1909-10 гг.)',
                                data: 'Алексеев, Антоненко, Афанасиевский, Белай, Белоконь, Богдан, Богатырев, Богославец, Бут, Величко, Винник, Вовк, Воскобойников, Гайченко, Ганжа, Голик, Горбань, Гришко, Дацун, Демиденко, Денисенко, Дзыга, Деркач, Дудник, Дяченко, Ермоленко, Жадан, Журба, Заболотный, Заика, Зинченко, Зоря, Зубко, Ищенко, Кайдаш, Калька, Капуста, Карайда, Касьян, Коваль, Колесник, Коломиец, Компаниец, Костырь, Кузьменко, Кукало, Лызько, Линник, Лисенко, Лях, Ляшенко, Макуха, Марченко, Мединский, Мельник, Мирошниченко, Михайличенко, Мищенко, Мозуляка, Москаленко, Нагирный, Неживой, Николаенко, Овчар, Онищенко, Павленко, Падун, Пальчик, Пашко, Петренко, Пидлипян, Пидык, Погорилко, Поправка, Потуга, Прохватило, Путий, Рачок, Розум, Рубец, Савченко, Свириденко, Скляр, Скотар, Сокол, Солодовник, Сребряник, Стародуб, Стешенко, Стрелец, Стукало, Терещенко, Ткаченко, Тур, Удовиченко, Федоренко, Храпач, Храменко, Чабан, Чернущенко, Черный, Чухрий, Шевченко, Шошура, Юрченко, Ягло, Яременко, Яровой'
                            },
                        ]
                    },
                    {
                        name: 'Камышевахская волость',
                        data: [
                            {
                                name: 'д. Дарьевка-Акутино',
                                data: []
                            },
                            {
                                name: 'д. Дарьевка-Крыжовая',
                                data: []
                            },
                            {
                                name: 'с. Камышеваха',
                                data: []
                            },
                            {
                                name: 'с. Копани',
                                data: []
                            },
                            {
                                name: 'с. Любимовка',
                                data: []
                            },
                            {
                                name: 'с. Новоивановка',
                                data: []
                            },
                            {
                                name: 'д. Новоселовка',
                                data: []
                            },
                            {
                                name: 'с. Новотроицкое',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Конско-Раздоровская волость',
                        data: [
                            {
                                name: 'с. Гусарка',
                                data: []
                            },
                            {
                                name: 'с. Конские Раздоры',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Краснопольская волость',
                        data: [
                            {
                                name: 'хут. Блюменталь',
                                data: []
                            },
                            {
                                name: 'хут. Вербовый',
                                data: []
                            },
                            {
                                name: 'кол. Загорная (Блюменфельд)',
                                data: []
                            },
                            {
                                name: 'с. Краснополь',
                                data: []
                            },
                            {
                                name: 'кол. Михайловка',
                                data: []
                            },
                            {
                                name: 'с. Сереброполь',
                                data: []
                            },
                            {
                                name: 'пос. Яворский',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Мало-Михайловская волость',
                        data: [
                            {
                                name: 'д. Берестовая',
                                data: []
                            },
                            {
                                name: 'д. Копани',
                                data: []
                            },
                            {
                                name: 'с. Мало-Михайловка',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Михайловская волость (Лукашева)',
                        data: [
                            {
                                name: 'д. Александровка',
                                data: []
                            },
                            {
                                name: 'д. Антоновка',
                                data: []
                            },
                            {
                                name: 'д. Берестовая',
                                data: []
                            },
                            {
                                name: 'д. Богдановка',
                                data: []
                            },
                            {
                                name: 'д. Васильевка',
                                data: []
                            },
                            {
                                name: 'д. Веселовка',
                                data: []
                            },
                            {
                                name: 'д. Геленджик',
                                data: []
                            },
                            {
                                name: 'д. Голубовка',
                                data: []
                            },
                            {
                                name: 'д. Зиновьевка',
                                data: []
                            },
                            {
                                name: 'д. Любомировка',
                                data: []
                            },
                            {
                                name: 'д. Максимовка',
                                data: []
                            },
                            {
                                name: 'д. Миролюбовка',
                                data: []
                            },
                            {
                                name: 'с. Михайловка-Лукашево',
                                data: []
                            },
                            {
                                name: 'д. Николаевка (Рудь)',
                                data: []
                            },
                            {
                                name: 'д. Никольская',
                                data: []
                            },
                            {
                                name: 'д. Новозначковка',
                                data: []
                            },
                            {
                                name: 'д. Новомиргородка',
                                data: []
                            },
                            {
                                name: 'д. Сергеевка',
                                data: []
                            },
                            {
                                name: 'д. Трофимовка',
                                data: []
                            },
                            {
                                name: 'д. Федоровка',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Натальевская волость',
                        data: [
                            {
                                name: 'д. Беккеровка',
                                data: []
                            },
                            {
                                name: 'д. Еленовка',
                                data: []
                            },
                            {
                                name: 'д. Красный Кут',
                                data: []
                            },
                            {
                                name: 'д. Куприяновка',
                                data: []
                            },
                            {
                                name: 'с. Натальевка',
                                data: []
                            },
                            {
                                name: 'д. Ново-Анновка',
                                data: []
                            },
                            {
                                name: 'д. Новоселовка',
                                data: []
                            },
                            {
                                name: 'д. Павловка',
                                data: []
                            },
                            {
                                name: 'д. Софиевка',
                                data: []
                            },
                            {
                                name: 'д. Степная',
                                data: []
                            },
                            {
                                name: 'д. Трудолюбовка',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Ново-Николаевская волость',
                        data: [
                            {
                                name: 'кол. Веселая',
                                data: []
                            },
                            {
                                name: 'кол. Красноселка',
                                data: []
                            },
                            {
                                name: 'кол. Межиреч',
                                data: []
                            },
                            {
                                name: 'кол. Нечаевка',
                                data: []
                            },
                            {
                                name: 'кол. Новозлатополь',
                                data: []
                            },
                            {
                                name: 'кол. Трудолюбовка',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Ново-Златопольский еврейский приказ',
                        data: [
                            {
                                name: 'с. Новониколаевка',
                                data: []
                            },
                            {
                                name: 'д. Самойловка',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Павловская волость',
                        data: [
                            {
                                name: 'с. Павловка (список фамилий за 1835 г.)',
                                data: 'Базалевский, Безвесильный, Богданенко, Бунчук, Бурма, Водяный, Гнида, Голобородько, Горб, Гуртовый, Денисенко, Долголюлька, Ероцкий, Зазноба, Зубченко, Кучуй, Марченко, Метеля, Мороз, Ненчинко, Николаенко, Плясун, Сердюк, Сукур, Троян, Турбаба, Ус, Фертюк, Фурса, Хапатько, Цапенко, Цибаневский, Черевко, Щур'
                            },
                            {
                                name: 'д. Новогригорьевка',
                                data: []
                            },
                            {
                                name: 'д. Софиевка-Выгодная',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Петро-Свистуновская волость',
                        data: [
                            {
                                name: 'д. Агрофеновка',
                                data: []
                            },
                            {
                                name: 'с. Петровское',
                                data: []
                            },
                            {
                                name: 'с. Терновое',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Петро-Строгановская волость',
                        data: [
                            {
                                name: 'д. Мокрая',
                                data: []
                            },
                            {
                                name: 'д. Николаевка',
                                data: []
                            },
                            {
                                name: 'с. Петровское (Балабино)',
                                data: []
                            },
                            {
                                name: 'д. Степная',
                                data: []
                            },
                            {
                                name: 'кол. Шенвизе',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Покровская волость',
                        data: [
                            {
                                name: 'д. Александровка',
                                data: []
                            },
                            {
                                name: 'д. Анновка',
                                data: []
                            },
                            {
                                name: 'д. Богодар',
                                data: []
                            },
                            {
                                name: 'д. Васильевка',
                                data: []
                            },
                            {
                                name: 'д. Даниловка',
                                data: []
                            },
                            {
                                name: 'д. Егоровка',
                                data: []
                            },
                            {
                                name: 'д. Екатериновка',
                                data: []
                            },
                            {
                                name: 'д. Каменоватая',
                                data: []
                            },
                            {
                                name: 'д. Николаевка',
                                data: []
                            },
                            {
                                name: 'д. Новоселовка',
                                data: []
                            },
                            {
                                name: 'с. Покровское (Коломийцево)',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Преображенская волость',
                        data: [
                            {
                                name: 'с. Васиновка (некоторые фамилии жителей села в 1841-44 гг.)',
                                data: 'Бабенко, Биденко, помещик Бураков, Ваганенко, священник Гилевич, Дзюбенко, Дубина, Земляной, Кривотаенко, Кривошиенко, Кушнеренко, Лега, Мандрычев, Мартиненко, Михайленко, Могила, Омельченко, Писаренко, Письменный, Повстюченко, Попович, Портной, Приходин, Ревуцкий, Руденко, Рудый, Салогуб, Тилик, Чубик, Яковенко'
                            },
                            {
                                name: 'хут. Верхний Жеребец',
                                data: []
                            },
                            {
                                name: 'с. Егоровка',
                                data: []
                            },
                            {
                                name: 'с. Ильинка',
                                data: []
                            },
                            {
                                name: 'хут. Ново-Беликовское',
                                data: 'с. Омельник (некоторые фамилии жителей села в 1841-44 гг.), Белогуб, Белокур, Бенков, Божко, Бондаренко, Борисенко, Бочаров, Бражников, Бутовицкий, Герчик, Голуб, Гордивский, Денисов, Дука, Жадан, Жидик, Зарецкий, Иванченко, Ириненко, Калюжный, Коваленко, Коваль, Козик, Колесниченко, Коляда, Коршун, Лабза, Лисенко, Ломенко, Луценко, Оленец, Петрашко, Пронь, Проскура, Ризниченко, Рысь, Матюха, Махнорыло, Моргун, Салогуб, Сидоренко, Сиротенко, Скибко, Снижко, Сухаров, Тихоненко, Трипольский, Тришко, Устименко, Филоненко, Шарко, Шкроботько, Шкура, Шрамко, Шулик, Ярошенко, Яценко'
                            },
                            {
                                name: 'с. Преображенка (списки фамилий за 1850-е гг.)',
                                data: 'Авраменко, Аксютенко, Бандурка, Баран, Барский, Басараб, Белицкий, Беньковский, Бинник, Бобровский, Боярский, Бублик, Булава, Величко, Верещагин, Витер, Вовкодав, Галутва, Гаращенко, Герасименко, Глущенко, Головач, Голуб, Горбач, Гуденко, Гурин, Даниленко, Демянок, Деревянко, Десенко, Добрянский, Дроздов, Ерько, Захарченко, Зуб, Иванченко, Ивахненко, Иващенко, Кальба, Капуста, Карман, Качан, Кибал, Кислица, Клименко, Клищенко, Коваленко, Козарь, Козачок, Колистинский, Коломоец, Комаров, Коновал, Корнута, Коршун, Костенко, Косточка, Кравченко, Красницкий, Краснощок, Кугот, Куц, Лазаренко, Легизевич, Лепетченко, Лисенко, Лиска, Логвиненко, Лысота, Лядванский, Майстренко, Малах(ов), Марченко, Масаковский, Мироненко, Михайленко, Михайличенко, Монец, Моспан, Мягкоход, Назаренко, Невинчанный, Нестеренко, Обертас, Овсюк, Омельяненко, Осауленко, Остапенко, Очеретько, Падубяцкий, Панченко, Пастернак, Паустовский, Петровский, Пилявский, Прокопенко, Проценко, Прунь, Радченко, Рябченко, Савченко, Самойленко, Сапко, Семенец, Семченко, Сергиенко, Сидоренко, Скалозуб, Скидан, Скляренко, Скрипниченко, Стецюк, Стоян, Сулиз, Тельбух, Титов, Ткаченко, Тряпишка, Фень, Филипецкий, Филоненко, Цыкало, Шадурский, Шаповал, Шевчук, Шкапенко, Шкитько, Шкроботько, Шлея, Щавинский'
                            },
                            {
                                name: 'хут. Солдатовское',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Пологовская волость',
                        data: [
                            {
                                name: 'с. Пологи',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Приютинский еврейский приказ',
                        data: [
                            {
                                name: 'кол. Богодаровка',
                                data: []
                            },
                            {
                                name: 'кол. Горькая',
                                data: []
                            },
                            {
                                name: 'кол. Приютная',
                                data: []
                            },
                            {
                                name: 'кол. Роскошная',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Туркеновская волость',
                        data: []
                    },
                    {
                        name: 'Успеновская волость',
                        data: [
                            {
                                name: 'д. Васильевка',
                                data: []
                            },
                            {
                                name: 'д. Веселая',
                                data: []
                            },
                            {
                                name: 'д. Ивановка',
                                data: []
                            },
                            {
                                name: 'д. Крутояровка',
                                data: []
                            },
                            {
                                name: 'д. Марьевка',
                                data: []
                            },
                            {
                                name: 'д. Николаевка',
                                data: []
                            },
                            {
                                name: 'д. Ново-Васильевка',
                                data: []
                            },
                            {
                                name: 'д. Ново-Григорьевка',
                                data: []
                            },
                            {
                                name: 'д. Ново-Николаевка',
                                data: []
                            },
                            {
                                name: 'д. Павловка',
                                data: []
                            },
                            {
                                name: 'д. Темировка №1 и №2',
                                data: []
                            },
                            {
                                name: 'с. Успеновка',
                                data: []
                            },
                        ]
                    },
                    {
                        name: 'Федоровская волость',
                        data: [
                            {
                                name: 'с. Федоровка (Бурлацкая)',
                                data: []
                            },
                            {
                                name: 'хут. Кобыльный',
                                data: []
                            },
                            {
                                name: 'д. Крутая (список фамилий за 1858 г.)',
                                data: 'Белай, Бойченко, Бондаренко, Грищенко, Демченко, Дудник, Духопел, Земляный, Камянченко, помещик Константинов, Кулиш, Литвин, Машковой, Одинец, Пацека, Понедельник, Рубан, Сараненко, Соболь, Сулименко, Третьяков, Усатенко, Харсун, Чабан, Череватый, Чорный, Штригель, Чуприна, Щербина, Щепин'
                            },
                        ]
                    },
                    {
                        name: 'Цареконстантиновская волость',
                        data: [
                            {
                                name: 'с. Алексеевка',
                                data: []
                            },
                            {
                                name: 'с. Бельманка',
                                data: []
                            },
                            {
                                name: 'с. Гайчул (некоторые фамилии жителей села в 1910-20 гг.)',
                                data: 'Артюхов, Богославский, Веприцкий, Гарагуля, Герасименко, Гикач, Глушко, Гнизевич, Дородный, Дрождин, Дядюра, Заец, Зайченко, Зуева, Иванченко, Кажан, Калашник, Камыш, Картожинский, Качанов, Копичаев, Корниенко, Кривошапка, Кудинов, Кузьменко, Кулиш, Кучеренко, Лещенко, Литвиненко, Марченко, Милованов, Мирошниченко, Митюхин, Михель, Онищенко, Осокин, Потапенко, Похваленко, Родименко, Скорик, Скоробогатько, Смалянский, Сосновский, Таран, Тарасенко, Туманский, Фурсов, Ходак, Цимер, Чернигин, Шелюхов'
                            },
                            {
                                name: 'с. Ново-Каменка',
                                data: []
                            },
                            {
                                name: 'с. Цареконстантиновка (список фамилий за 1816 г.)',
                                data: 'Авраменко, Бурлацкий, Бут, Головченко, Гриценко, Даниленко, Загорулько, Зубко, Кисиль, Корженко, Котенко, Крутой, Лавриненко, Лебеденко, Лещенко, Миронов, Ревута, Рыбка, Сахно, Смаглий, Сребник, Тарасенко, Трихлеб, Троценко, Тущенко, Федоренко, Чуб'
                            },
                        ]
                    }
                ]
            },
            {
                name: "Бахмутский уезд",
                data: [
                    {
                        name: 'г. Бахмут',
                        data: []
                    },
                    {
                        name: 'Авдеевская волость',
                        data: []
                    },
                    {
                        name: 'Андреевская волость',
                        data: []
                    },
                    {
                        name: 'Бахмутская волость',
                        data: []
                    },
                    {
                        name: 'Веровская волость',
                        data: []
                    },
                    {
                        name: 'Гомщинская волость',
                        data: []
                    },
                    {
                        name: 'Григорьевская волость',
                        data: []
                    },
                    {
                        name: 'Гришинская волость',
                        data: []
                    },
                    {
                        name: 'Гродовская волость',
                        data: []
                    },
                    {
                        name: 'Еленская волость',
                        data: []
                    },
                    {
                        name: 'Железнянская волость',
                        data: []
                    },
                    {
                        name: 'Звановская волость',
                        data: []
                    },
                    {
                        name: 'Казенно-Торско-Алексеевская волость',
                        data: []
                    },
                    {
                        name: 'Калиновская волость',
                        data: []
                    },
                    {
                        name: 'Камышевахская волость',
                        data: []
                    },
                    {
                        name: 'Кривороженская волость',
                        data: []
                    },
                    {
                        name: 'Лисичанская волость',
                        data: []
                    },
                    {
                        name: 'Луганская волость',
                        data: []
                    },
                    {
                        name: 'Сантуриновская волость',
                        data: []
                    },
                    {
                        name: 'Селидовская волость',
                        data: []
                    },
                    {
                        name: 'Сергеевская волость',
                        data: []
                    },
                    {
                        name: 'Скотоватская волость',
                        data: []
                    },
                    {
                        name: 'Степановская волость',
                        data: []
                    },
                    {
                        name: 'Троицкая волость',
                        data: []
                    }
                ]
            },
            {
                name: "Верхнеднепровский уезд",
                data: [
                    {
                        name: 'г. Верхнеднепровск',
                        data: []
                    },
                    {
                        name: 'Адамовская волость',
                        data: []
                    },
                    {
                        name: 'Александровская волость',
                        data: []
                    },
                    {
                        name: 'Алферовская волость',
                        data: []
                    },
                    {
                        name: 'Анновская волость',
                        data: []
                    },
                    {
                        name: 'Байдаковская волость',
                        data: []
                    },
                    {
                        name: 'Богодаровская волость',
                        data: []
                    },
                    {
                        name: 'Бородаевская волость',
                        data: []
                    },
                    {
                        name: 'Весело-Терновская волость',
                        data: []
                    },
                    {
                        name: 'Вольно-Хуторская волость',
                        data: []
                    },
                    {
                        name: 'Гуляйпольская волость',
                        data: []
                    },
                    {
                        name: 'Желтанская волость',
                        data: []
                    },
                    {
                        name: 'Комиссаровская волость',
                        data: []
                    },
                    {
                        name: 'Краснокутская волость',
                        data: []
                    },
                    {
                        name: 'Куцеволовская волость',
                        data: []
                    },
                    {
                        name: 'Лиховская волость',
                        data: []
                    },
                    {
                        name: 'Лозоватская волость',
                        data: []
                    },
                    {
                        name: 'Марьяновская волость',
                        data: []
                    },
                    {
                        name: 'Мишуринорогская волость',
                        data: []
                    },
                    {
                        name: 'Николаевская волость',
                        data: []
                    },
                    {
                        name: 'Ново-Григорьевская волость',
                        data: []
                    },
                    {
                        name: 'Ордо-Васильевская волость',
                        data: []
                    },
                    {
                        name: 'Попельнастовская волость',
                        data: []
                    },
                    {
                        name: 'Пушкаровская волость',
                        data: []
                    },
                    {
                        name: 'Саксагановская волость',
                        data: []
                    },
                    {
                        name: 'Семеновская волость',
                        data: []
                    },
                    {
                        name: 'Софиевская волость',
                        data: []
                    },
                ]
            },
            {
                name: "Екатеринославский уезд",
                data: [
                    {
                        name: 'г. Екатеринослав',
                        data: []
                    },
                    {
                        name: 'Августиновская волость',
                        data: []
                    },
                    {
                        name: 'Алексеевская волость',
                        data: []
                    },
                    {
                        name: 'Анастасьевская волость',
                        data: []
                    },
                    {
                        name: 'Беленьская волость',
                        data: []
                    },
                    {
                        name: 'Борисовская волость',
                        data: []
                    },
                    {
                        name: 'Волосская волость',
                        data: []
                    },
                    {
                        name: 'Выше-Тарасовская волость',
                        data: []
                    },
                    {
                        name: 'Городищенская волость',
                        data: []
                    },
                    {
                        name: 'Диевская волость',
                        data: []
                    },
                    {
                        name: 'Красно-Григорьевская волость',
                        data: []
                    },
                    {
                        name: 'Краснопольская волость',
                        data: []
                    },
                    {
                        name: 'Криничеватовская волость',
                        data: []
                    },
                    {
                        name: 'Лоцманско-Каменская волость',
                        data: []
                    },
                    {
                        name: 'Лошкаревская волость',
                        data: []
                    },
                    {
                        name: 'Михайловская волость',
                        data: []
                    },
                    {
                        name: 'Николайпольская волость',
                        data: []
                    },
                    {
                        name: 'Никольская волость',
                        data: []
                    },
                    {
                        name: 'Никопольская волость',
                        data: []
                    },
                    {
                        name: 'Ново-Павловская волость',
                        data: []
                    },
                    {
                        name: 'Ново-Покровская волость',
                        data: []
                    },
                    {
                        name: 'Ново-Софиевская волость',
                        data: []
                    },
                    {
                        name: 'Покровская волость',
                        data: []
                    },
                    {
                        name: 'Романковская волость',
                        data: []
                    },
                    {
                        name: 'Солонянская волость',
                        data: []
                    },
                    {
                        name: 'Сурская волость (Литовская)',
                        data: []
                    },
                    {
                        name: 'Сурско-Михайловская волость',
                        data: []
                    },
                    {
                        name: 'Томаковская волость',
                        data: []
                    },
                    {
                        name: 'Хортицкая волость',
                        data: []
                    },
                    {
                        name: 'Чумаковская волость',
                        data: []
                    },
                    {
                        name: 'Шолоховская волость',
                        data: []
                    },
                    {
                        name: 'Ямбурская волость',
                        data: []
                    }
                ]
            },
            {
                name: "Мариупольский уезд",
                data: [
                    {
                        name: 'г. Мариуполь',
                        data: []
                    },
                    {
                        name: 'Александро-Невская волость',
                        data: []
                    },
                    {
                        name: 'Андреевская волость',
                        data: []
                    },
                    {
                        name: 'Бешевская волость',
                        data: []
                    },
                    {
                        name: 'Благодатовская волость',
                        data: []
                    },
                    {
                        name: 'Богатырская волость',
                        data: []
                    },
                    {
                        name: 'Больше-Янисольская волость',
                        data: []
                    },
                    {
                        name: 'Времьевская волость',
                        data: []
                    },
                    {
                        name: 'Графский приказ',
                        data: []
                    },
                    {
                        name: 'Затишьинский приказ',
                        data: []
                    },
                    {
                        name: 'Ивановская волость',
                        data: []
                    },
                    {
                        name: 'Игнатьевская волость',
                        data: []
                    },
                    {
                        name: 'Каранская волость',
                        data: []
                    },
                    {
                        name: 'Комарская волость',
                        data: []
                    },
                    {
                        name: 'Майорская волость',
                        data: []
                    },
                    {
                        name: 'Мало-Янисольская волость',
                        data: []
                    },
                    {
                        name: 'Мангушская волость',
                        data: []
                    },
                    {
                        name: 'Марьинская волость',
                        data: []
                    },
                    {
                        name: 'Михайловская волость',
                        data: []
                    },
                    {
                        name: 'Николаевская волость',
                        data: []
                    },
                    {
                        name: 'Ново-Спасовская волость',
                        data: []
                    },
                    {
                        name: 'Павловская волость',
                        data: []
                    },
                    {
                        name: 'Петровская волость',
                        data: []
                    },
                    {
                        name: 'Петропавловская волость',
                        data: []
                    },
                    {
                        name: 'Покровская волость',
                        data: []
                    },
                    {
                        name: 'Романовская волость',
                        data: []
                    },
                    {
                        name: 'Сартанская волость',
                        data: []
                    },
                    {
                        name: 'Старо-Керменчикская волость',
                        data: []
                    },
                    {
                        name: 'Стретенская волость',
                        data: []
                    },
                    {
                        name: 'Темрюкская волость',
                        data: []
                    },
                    {
                        name: 'Ялтанская волость',
                        data: []
                    }
                ]
            },
            {
                name: "Новомосковский уезд",
                data: [
                    {
                        name: 'г. Новомосковск',
                        data: []
                    },
                    {
                        name: 'Александровская волость',
                        data: []
                    },
                    {
                        name: 'Афанасьевская волость',
                        data: []
                    },
                    {
                        name: 'Байбаковская волость',
                        data: []
                    },
                    {
                        name: 'Бузовская волость',
                        data: []
                    },
                    {
                        name: 'Голубовская волость',
                        data: []
                    },
                    {
                        name: 'Губинихская волость',
                        data: []
                    },
                    {
                        name: 'Дмухайловская волость',
                        data: []
                    },
                    {
                        name: 'Елизаветовская волость',
                        data: []
                    },
                    {
                        name: 'Елизавето-Хорошевская волость',
                        data: []
                    },
                    {
                        name: 'Ждановская волость',
                        data: []
                    },
                    {
                        name: 'Знаменская волость',
                        data: []
                    },
                    {
                        name: 'Иосифовская волость',
                        data: []
                    },
                    {
                        name: 'Каменская волость',
                        data: []
                    },
                    {
                        name: 'Котовская волость',
                        data: []
                    },
                    {
                        name: 'Лычковская волость',
                        data: []
                    },
                    {
                        name: 'Любимовская волость',
                        data: []
                    },
                    {
                        name: 'Магдалиновская волость',
                        data: []
                    },
                    {
                        name: 'Мануйловская волость',
                        data: []
                    },
                    {
                        name: 'Могилевская волость',
                        data: []
                    },
                    {
                        name: 'Николаевская волость',
                        data: []
                    },
                    {
                        name: 'Новомосковская волость',
                        data: []
                    },
                    {
                        name: 'Новоподкряжная волость',
                        data: []
                    },
                    {
                        name: 'Новоселовская волость',
                        data: []
                    },
                    {
                        name: 'Очереватовская волость',
                        data: []
                    },
                    {
                        name: 'Перещепинская волость',
                        data: []
                    },
                    {
                        name: 'Петриковская волость',
                        data: []
                    },
                    {
                        name: 'Подгороднянская волость',
                        data: []
                    },
                    {
                        name: 'Попасновская волость',
                        data: []
                    },
                    {
                        name: 'Почино-Софиевская волость',
                        data: []
                    },
                    {
                        name: 'Преображенская волость',
                        data: []
                    },
                    {
                        name: 'Прядивская волость',
                        data: []
                    },
                    {
                        name: 'Спасская волость',
                        data: []
                    },
                    {
                        name: 'Чаплинская волость',
                        data: []
                    },
                    {
                        name: 'Чернетчинская волость',
                        data: []
                    },
                    {
                        name: 'Шульговская волость',
                        data: []
                    }
                ]
            },
            {
                name: "Павлоградский уезд",
                data: [
                    {
                        name: 'г. Павлоград',
                        data: []
                    },
                    {
                        name: 'Александровская волость',
                        data: []
                    },
                    {
                        name: 'Артельская волость',
                        data: []
                    },
                    {
                        name: 'Богдановская волость',
                        data: []
                    },
                    {
                        name: 'Булаховская волость',
                        data: []
                    },
                    {
                        name: 'Васильковская волость',
                        data: []
                    },
                    {
                        name: 'Вердовская волость',
                        data: []
                    },
                    {
                        name: 'Вязовская волость',
                        data: []
                    },
                    {
                        name: 'Дмитриевская волость',
                        data: []
                    },
                    {
                        name: 'Добровольская волость',
                        data: []
                    },
                    {
                        name: 'Екатериновская волость',
                        data: []
                    },
                    {
                        name: 'Коховская волость',
                        data: []
                    },
                    {
                        name: 'Михайловская волость',
                        data: []
                    },
                    {
                        name: 'Николаевская волость',
                        data: []
                    },
                    {
                        name: 'Ново-Ивановская волость',
                        data: []
                    },
                    {
                        name: 'Павлоградская волость',
                        data: []
                    },
                    {
                        name: 'Петропавловская волость',
                        data: []
                    },
                    {
                        name: 'Раздорская волость',
                        data: []
                    },
                    {
                        name: 'Рождественская волость',
                        data: []
                    },
                    {
                        name: 'Рудаевская волость',
                        data: []
                    },
                    {
                        name: 'Самойловская волость',
                        data: []
                    },
                    {
                        name: 'Славянская волость',
                        data: []
                    },
                    {
                        name: 'Стешино-Черноглазовская волость',
                        data: []
                    },
                    {
                        name: 'Троицкая волость',
                        data: []
                    },
                    {
                        name: 'Хорошевская волость',
                        data: []
                    },
                    {
                        name: 'Юрьевская волость',
                        data: []
                    },],
            },
            {
                name: "Ростовский уезд",
                data: []
            },
            {
                name: "Славяносербский уезд",
                data: [
                    {
                        name: 'г. Луганск',
                        data: []
                    },
                    {
                        name: 'Адрианопольская волость',
                        data: []
                    },
                    {
                        name: 'Александровская волость',
                        data: []
                    },
                    {
                        name: 'Богдановская волость',
                        data: []
                    },
                    {
                        name: 'Беловская волость',
                        data: []
                    },
                    {
                        name: 'Васильевская волость',
                        data: []
                    },
                    {
                        name: 'Вергунская волость',
                        data: []
                    },
                    {
                        name: 'Веселогорская волость',
                        data: []
                    },
                    {
                        name: 'Георгиевская волость',
                        data: []
                    },
                    {
                        name: 'Городищенская волость',
                        data: []
                    },
                    {
                        name: 'Горско-Ивановская волость',
                        data: []
                    },
                    {
                        name: 'Еленовская волость',
                        data: []
                    },
                    {
                        name: 'Ивановская волость',
                        data: []
                    },
                    {
                        name: 'Иллирийская волость',
                        data: []
                    },
                    {
                        name: 'Каменно-Бродская волость',
                        data: []
                    },
                    {
                        name: 'Каменская волость',
                        data: []
                    },
                    {
                        name: 'Краснокутская волость',
                        data: []
                    },
                    {
                        name: 'Криничанская волость',
                        data: []
                    },
                    {
                        name: 'Крымская волость',
                        data: []
                    },
                    {
                        name: 'Макаро-Яровская волость',
                        data: []
                    },
                    {
                        name: 'Михайловская волость',
                        data: []
                    },
                    {
                        name: 'Луганская волость',
                        data: []
                    },
                    {
                        name: 'Николаевская волость',
                        data: []
                    },
                    {
                        name: 'Павловская волость',
                        data: []
                    },
                    {
                        name: 'Первозвановская волость',
                        data: []
                    },
                    {
                        name: 'Петрово-Голенищевская волость',
                        data: []
                    },
                    {
                        name: 'Петропавловская волость',
                        data: []
                    },
                    {
                        name: 'Славяносербская волость',
                        data: []
                    },
                    {
                        name: 'Сокольницкая волость',
                        data: []
                    },
                    {
                        name: 'Суходаевская волость',
                        data: []
                    },
                    {
                        name: 'Успенская волость',
                        data: []
                    },
                    {
                        name: 'Черкасская волость',
                        data: []
                    },
                    {
                        name: 'Чернухинская волость',
                        data: []
                    },
                    {
                        name: 'Штеровская волость',
                        data: []
                    }
                ]
            },
        ],
    },
            {
                name: "Киевская губерния",
                data: [
                    {
                        name: "Бердичевский уезд",
                        data: [
                            {
                                name: 'г. Бердичев',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Быстрикская волость',
                        data: []
                    },
                    {
                        name: 'Белиловская волость',
                        data: []
                    },
                    {
                        name: 'Белопольская волость',
                        data: []
                    },
                    {
                        name: 'Вахновская волость',
                        data: []
                    },
                    {
                        name: 'Дзюньковская волость',
                        data: []
                    },
                    {
                        name: 'Дубово-Мехеринецкая волость',
                        data: []
                    },
                    {
                        name: 'Казатинская волость',
                        data: []
                    },
                    {
                        name: 'Мало-Чернявская волость',
                        data: []
                    },
                    {
                        name: 'Мало-Чернятинская волость',
                        data: []
                    },
                    {
                        name: 'Махновская волость',
                        data: []
                    },
                    {
                        name: 'Ново-Прилукская волость',
                        data: []
                    },
                    {
                        name: 'Погребищская волость',
                        data: []
                    },
                    {
                        name: 'Пузырецкая волость',
                        data: []
                    },
                    {
                        name: 'Самгородская волость',
                        data: []
                    },
                    {
                        name: 'Спичинецкая волость',
                        data: []
                    },
                    {
                        name: 'Ширмовская волость',
                        data: []
                    },
            {
                name: "Васильковский уезд",
                data: [
                    {
                        name: 'г. Васильков',
                        data: []
                    },
                    {
                        name: 'Барахтянская волость',
                        data: []
                    },
                    {
                        name: 'Блощинская волость',
                        data: []
                    },
                    {
                        name: 'Бело-Церковская волость',
                        data: []
                    },
                    {
                        name: 'Васильевская волость',
                        data: []
                    },
                    {
                        name: 'Васильковская волость',
                        data: []
                    },
                    {
                        name: 'Велико-Половецкая волость',
                        data: []
                    },
                    {
                        name: 'Веприковская волость',
                        data: []
                    },
                    {
                        name: 'Винцентовская волость',
                        data: []
                    },
                    {
                        name: 'Гребенская волость',
                        data: []
                    },
                    {
                        name: 'Езерянская волость',
                        data: []
                    },
                    {
                        name: 'Ковалевская волость',
                        data: []
                    },
                    {
                        name: 'Кожанская волость',
                        data: []
                    },
                    {
                        name: 'Мало-Половецкая волость',
                        data: []
                    },
                    {
                        name: 'Мотовиловская волость',
                        data: []
                    },
                    {
                        name: 'Островская волость',
                        data: []
                    },
                    {
                        name: 'Рокитнянская волость',
                        data: []
                    },
                    {
                        name: 'Трушковская волость',
                        data: []
                    },
                    {
                        name: 'Фастовская волость',
                        data: []
                    },
                    {
                        name: 'Черкасская волость',
                        data: []
                    },
                    {
                        name: 'Шамраевская волость',
                        data: []
                    }
                ]
            },
            {
                name: "Звенигородский уезд",
                data: [
                    {
                        name: 'г. Васильков',
                        data: []
                    },
                    {
                        name: 'Барахтянская волость',
                        data: []
                    },
                    {
                        name: 'Блощинская волость',
                        data: []
                    },
                    {
                        name: 'Бело-Церковская волость',
                        data: []
                    },
                    {
                        name: 'Васильевская волость',
                        data: []
                    },
                    {
                        name: 'Васильковская волость',
                        data: []
                    },
                    {
                        name: 'Велико-Половецкая волость',
                        data: []
                    },
                    {
                        name: 'Веприковская волость',
                        data: []
                    },
                    {
                        name: 'Винцентовская волость',
                        data: []
                    },
                    {
                        name: 'Гребенская волость',
                        data: []
                    },
                    {
                        name: 'Езерянская волость',
                        data: []
                    },
                    {
                        name: 'Ковалевская волость',
                        data: []
                    },
                    {
                        name: 'Кожанская волость',
                        data: []
                    },
                    {
                        name: 'Мало-Половецкая волость',
                        data: []
                    },
                    {
                        name: 'Мотовиловская волость',
                        data: []
                    },
                    {
                        name: 'Островская волость',
                        data: []
                    },
                    {
                        name: 'Рокитнянская волость',
                        data: []
                    },
                    {
                        name: 'Трушковская волость',
                        data: []
                    },
                    {
                        name: 'Фастовская волость',
                        data: []
                    },
                    {
                        name: 'Черкасская волость',
                        data: []
                    },
                    {
                        name: 'Шамраевская волость',
                        data: []
                    }
                ]
            },
            {
                name: "Каневский уезд",
                data: [
                    {
                        name: 'г. Канев',
                        data: []
                    },
                    {
                        name: 'Богуславская волость',
                        data: []
                    },
                    {
                        name: 'Велико-Прицковская волость',
                        data: []
                    },
                    {
                        name: 'Исайковская волость',
                        data: []
                    },
                    {
                        name: 'Козинская волость',
                        data: []
                    },
                    {
                        name: 'Корниловская волость',
                        data: []
                    },
                    {
                        name: 'Корсунская волость',
                        data: []
                    },
                    {
                        name: 'Куриловская волость',
                        data: []
                    },
                    {
                        name: 'Македонская волость',
                        data: []
                    },
                    {
                        name: 'Медвинская волость',
                        data: []
                    },
                    {
                        name: 'Ольховецкая волость',
                        data: []
                    },
                    {
                        name: 'Потокская волость',
                        data: []
                    },
                    {
                        name: 'Пустовойтовская волость',
                        data: []
                    },
                    {
                        name: 'Пшеничниковская волость',
                        data: []
                    },
                    {
                        name: 'Селищская волость',
                        data: []
                    },
                    {
                        name: 'Степанская волость',
                        data: []
                    },
                    {
                        name: 'Таганческая волость',
                        data: []
                    },
                    {
                        name: 'Трактомировская волость',
                        data: []
                    },
                    {
                        name: 'Шендеровская волость',
                        data: []
                    }
                ]
            },
            {
                name: "Киевский уезд",
                data: [
                    {
                        name: 'г. Киев',
                        data: []
                    },
                    {
                        name: 'Бородянская волость',
                        data: []
                    },
                    {
                        name: 'Белогородская волость',
                        data: []
                    },
                    {
                        name: 'Бышевская волость',
                        data: []
                    },
                    {
                        name: 'Велико-Дмитровская волость',
                        data: []
                    },
                    {
                        name: 'Германовская волость',
                        data: []
                    },
                    {
                        name: 'Глевахская волость',
                        data: []
                    },
                    {
                        name: 'Гостомельская волость',
                        data: []
                    },
                    {
                        name: 'Дымерская волость',
                        data: []
                    },
                    {
                        name: 'Кагарлыкская волость',
                        data: []
                    },
                    {
                        name: 'Макаровская волость',
                        data: []
                    },
                    {
                        name: 'Обуховская волость',
                        data: []
                    },
                    {
                        name: 'Ржищевская волость',
                        data: []
                    },
                    {
                        name: 'Ставянская волость',
                        data: []
                    },
                    {
                        name: 'Стайковская волость',
                        data: []
                    },
                    {
                        name: 'Старо-Петровская волость',
                        data: []
                    },
                    {
                        name: 'Трипольская волость',
                        data: []
                    },
                    {
                        name: 'Хотовская волость',
                        data: []
                    },
                    {
                        name: 'Черняховская волость',
                        data: []
                    }
                ]
            },
            {
                name: "Липовецкий уезд",
                data: [
                    {
                        name: 'г. Липовец',
                        data: []
                    },
                    {
                        name: 'Андрушевская волость',
                        data: []
                    },
                    {
                        name: 'Дашевская волость',
                        data: []
                    },
                    {
                        name: 'Жадановская волость',
                        data: []
                    },
                    {
                        name: 'Зозовская волость',
                        data: []
                    },
                    {
                        name: 'Иваньковская волость',
                        data: []
                    },
                    {
                        name: 'Конельско-Поповская волость',
                        data: []
                    },
                    {
                        name: 'Липовецкая волость',
                        data: []
                    },
                    {
                        name: 'Лукашевская волость',
                        data: []
                    },
                    {
                        name: 'Медовская волость',
                        data: []
                    },
                    {
                        name: 'Монастырищская волость',
                        data: []
                    },
                    {
                        name: 'Оратовская волость',
                        data: []
                    },
                    {
                        name: 'Подвысочанская волость',
                        data: []
                    },
                    {
                        name: 'Сарновская волость',
                        data: []
                    },
                    {
                        name: 'Цыбулевская волость',
                        data: []
                    },
                    {
                        name: 'Юрковецкая волость',
                        data: []
                    }
                ]
            },
            {
                name: "Радомысльский уезд",
                data: [
                    {
                        name: 'г. Радомысль',
                        data: []
                    },
                    {
                        name: 'Брусиловская волость',
                        data: []
                    },
                    {
                        name: 'Водотыйская волость',
                        data: []
                    },
                    {
                        name: 'Вышевичская волость',
                        data: []
                    },
                    {
                        name: 'Горностайпольская волость',
                        data: []
                    },
                    {
                        name: 'Иванковская волость',
                        data: []
                    },
                    {
                        name: 'Кичкировская волость',
                        data: []
                    },
                    {
                        name: 'Коростышевская волость',
                        data: []
                    },
                    {
                        name: 'Красятичская волость',
                        data: []
                    },
                    {
                        name: 'Малинская волость',
                        data: []
                    },
                    {
                        name: 'Мартыновичская волость',
                        data: []
                    },
                    {
                        name: 'Потиевская волость',
                        data: []
                    },
                    {
                        name: 'Приборская волость',
                        data: []
                    },
                    {
                        name: 'Розважевская волость',
                        data: []
                    },
                    {
                        name: 'Хабенская волость',
                        data: []
                    },
                    {
                        name: 'Чернобыльская волость',
                        data: []
                    },
                    {
                        name: 'Шепеличская волость',
                        data: []
                    }
                ]
            },
            {
                name: "Сквирский уезд",
                data: [
                    {
                        name: 'г. Сквира',
                        data: []
                    },
                    {
                        name: 'Антоновская волость',
                        data: []
                    },
                    {
                        name: 'Бабинецкая волость',
                        data: []
                    },
                    {
                        name: 'Бровковская волость',
                        data: []
                    },
                    {
                        name: 'Верховенская волость',
                        data: []
                    },
                    {
                        name: 'Володарская волость',
                        data: []
                    },
                    {
                        name: 'Воробиевская волость',
                        data: []
                    },
                    {
                        name: 'Корнинская волость',
                        data: []
                    },
                    {
                        name: 'Лучинская волость',
                        data: []
                    },
                    {
                        name: 'Паволочская волость',
                        data: []
                    },
                    {
                        name: 'Пархомовская волость',
                        data: []
                    },
                    {
                        name: 'Попелянская волость',
                        data: []
                    },
                    {
                        name: 'Романовская волость',
                        data: []
                    },
                    {
                        name: 'Ружинская волость',
                        data: []
                    },
                    {
                        name: 'Топоровская волость',
                        data: []
                    },
                    {
                        name: 'Ходорковская волость',
                        data: []
                    },
                    {
                        name: 'Чубинецкая волость',
                        data: []
                    }
                ]
            },
            {
                name: "Таращанский уезд",
                data: [
                    {
                        name: 'г. Тараща',
                        data: []
                    },
                    {
                        name: 'Бузовская волость',
                        data: []
                    },
                    {
                        name: 'Жашковская волость',
                        data: []
                    },
                    {
                        name: 'Жидовско-Гребельская волость',
                        data: []
                    },
                    {
                        name: 'Кашперовская волость',
                        data: []
                    },
                    {
                        name: 'Кошеватская волость',
                        data: []
                    },
                    {
                        name: 'Красиловская волость',
                        data: []
                    },
                    {
                        name: 'Кривецкая волость',
                        data: []
                    },
                    {
                        name: 'Пятигорская волость',
                        data: []
                    },
                    {
                        name: 'Ставищская волость',
                        data: []
                    },
                    {
                        name: 'Старо-Животовская волость',
                        data: []
                    },
                    {
                        name: 'Стрижавская волость',
                        data: []
                    },
                    {
                        name: 'Тетиевская волость',
                        data: []
                    },
                    {
                        name: 'Юшковорогская волость',
                        data: []
                    }
                ]
            },
            {
                name: "Уманский уезд",
                data: [
                    {
                        name: 'г. Умань',
                        data: []
                    },
                    {
                        name: 'Бабанская волость',
                        data: []
                    },
                    {
                        name: 'Верхнячская волость',
                        data: []
                    },
                    {
                        name: 'Иваньковская волость',
                        data: []
                    },
                    {
                        name: 'Краснопольская волость',
                        data: []
                    },
                    {
                        name: 'Кузьминская волость',
                        data: []
                    },
                    {
                        name: 'Ладыжинская волость',
                        data: []
                    },
                    {
                        name: 'Маньковская волость',
                        data: []
                    },
                    {
                        name: 'Мошуровская волость',
                        data: []
                    },
                    {
                        name: 'Оксанинская волость',
                        data: []
                    },
                    {
                        name: 'Орадовская волость',
                        data: []
                    },
                    {
                        name: 'Подвысокская волость',
                        data: []
                    },
                    {
                        name: 'Посуховская волость',
                        data: []
                    },
                    {
                        name: 'Русаловская волость',
                        data: []
                    },
                    {
                        name: 'Тальновская волость',
                        data: []
                    },
                    {
                        name: 'Тальянская волость',
                        data: []
                    },
                    {
                        name: 'Уманская волость',
                        data: []
                    },
                    {
                        name: 'Хижнянская волость',
                        data: []
                    },
                    {
                        name: 'Шаулихская волость',
                        data: []
                    }
                ]
            },
            {
                name: "Черкасский уезд",
                data: [
                    {
                        name: 'г. Черкассы',
                        data: []
                    },
                    {
                        name: 'Белозерская волость',
                        data: []
                    },
                    {
                        name: 'Вергуновская волость',
                        data: []
                    },
                    {
                        name: 'Вязовская волость',
                        data: []
                    },
                    {
                        name: 'Городищенская волость',
                        data: []
                    },
                    {
                        name: 'Дахновская волость',
                        data: []
                    },
                    {
                        name: 'Деренковская волость',
                        data: []
                    },
                    {
                        name: 'Леськовская волость',
                        data: []
                    },
                    {
                        name: 'Матусовская волость',
                        data: []
                    },
                    {
                        name: 'Межиричская волость',
                        data: []
                    },
                    {
                        name: 'Мошенская волость',
                        data: []
                    },
                    {
                        name: 'Орловецкая волость',
                        data: []
                    },
                    {
                        name: 'Пруссянская волость',
                        data: []
                    },
                    {
                        name: 'Ротмистровская волость',
                        data: []
                    },
                    {
                        name: 'Смелянская волость',
                        data: []
                    },
                    {
                        name: 'Старосельская волость',
                        data: []
                    },
                    {
                        name: 'Сунковская волость',
                        data: []
                    },
                    {
                        name: 'Ташлыкская волость',
                        data: []
                    },
                    {
                        name: 'Хлыстуновская волость',
                        data: []
                    },
                    {
                        name: 'Худяковская волость',
                        data: []
                    },
                    {
                        name: 'Шелепухская волость',
                        data: []
                    }
                ]
            },
            {
                name: "Чигиринский уезд",
                data: [
                    {
                        name: 'г. Чигирин',
                        data: []
                    },
                    {
                        name: 'Александровская волость',
                        data: []
                    },
                    {
                        name: 'Головковская волость',
                        data: []
                    },
                    {
                        name: 'Златопольская волость',
                        data: []
                    },
                    {
                        name: 'Каменская волость',
                        data: []
                    },
                    {
                        name: 'Лебединская волость',
                        data: []
                    },
                    {
                        name: 'Оситняжская волость',
                        data: []
                    },
                    {
                        name: 'Подорожанская волость',
                        data: []
                    },
                    {
                        name: 'Рацевская волость',
                        data: []
                    },
                    {
                        name: 'Ставидлянская волость',
                        data: []
                    },
                    {
                        name: 'Субботовская волость',
                        data: []
                    },
                    {
                        name: 'Телепинская волость',
                        data: []
                    },
                    {
                        name: 'Трилеская волость',
                        data: []
                    },
                    {
                        name: 'Трушевская волость',
                        data: []
                    },
                    {
                        name: 'Цветнянская волость',
                        data: []
                    },
                    {
                        name: 'Шабельницкая волость',
                        data: []
                    }
                ], }
            ]
    }, {
                name: "Курская губерния",
                data: [
                    {name: "Белгородский уезд"},
                    {name: "Грайворонский уезд"},
                    {name: "Дмитриевский уезд"},
                    {name: "Корочанский уезд"},
                    {name: "Курский уезд"},
                    {name: "Льговский уезд"},
                    {name: "Новооскольский уезд"},
                    {name: "Обоянский уезд"},
                    {name: "Путивльский уезд"},
                    {name: "Рыльский уезд"},
                    {name: "Старооскольский уезд"},
                    {name: "Суджанский уезд"},
                    {name: "Тимский уезд"},
                    {name: "Фатежский уезд"},
                    {name: "Щигровский уезд"}
                ]
            },
            {
                name: "Полтавская губерния",
                data: [
                    {
                        name: "Гадячский уезд",
                        data: [
                            {
                                name: 'г. Гадяч',
                                data: []
                            },
                            {
                                name: 'Андреевская волость',
                                data: [
                                    {
                                        name: 'с. Андреевка',
                                        data: 'Бессараб(ов), Бирка(о), Бобриченко, Бардаков (Бордоков),\n' +
                                            'Василина,Войтенко, Гаврющенко, Гайдар, Гапич, Глумный, Гнедин,\n' +
                                            'Гончаренко, Горбенко, Горкуша, Гудименко, Гутырь, Долгошея, Дудник,\n' +
                                            'Завадько, Захарченко, Зинченко, Калиниченко, Каневский, Кардаш, Киркун,\n' +
                                            'Клименко, Коваль, Козырь, Костяненко, Кохно, Кривозуб, Кулик, Лавриненко,\n' +
                                            'Литвиненко, Литвинец, Литовка, Лущан, Мартиненко, Мацко, Мерошник,\n' +
                                            'Молашенко, Набока, Нестула, Олейник, Онищенко, Опришко, Оробец,\n' +
                                            'Папуша, Пономаренко, Рак, Сало, Семиренко, Сенецкий, Серебряков,\n' +
                                            'Скирденко, Скрипченко, Тельцов, Телющенко, Терещенко, Терновый,\n' +
                                            'Устименко, Чижевский, Шаренко, Шевченко, Шелудько, Шведин, Швиндин,\n' +
                                            'Шурхало'
                                    },
                                    {
                                        name: 'хут. Графщина (списки фамилий за 1907-10 гг.)',
                                        data: 'Бабенко, Близнюк, Быченко, Василенко, Гаврилко, Гладкий, Глумный,\n' +
                                            'Горкуша, Гудименко, Дубенко, Запара, Изюменко, Кириченко, Койло,\n' +
                                            'Коновал, Курочка, Литвиненко, Литовка, Лущан, Михайленко, Овчаренко,\n' +
                                            'Роменец, Сало, Семененко, Сенецкий, Телега, Чмиль, Шелудько, Шведин,\n' +
                                            'Ясько'
                                    },
                                    {
                                        name: 'дер. Дубровное',
                                        data: []
                                    },
                                    {
                                        name: 'хут. Качановщина',
                                        data: []
                                    },
                                    {
                                        name: 'с. Погарщина',
                                        data: []
                                    },
                                    {
                                        name: 'слоб. Ягановка (списки фамилий за 1907-10 гг.)',
                                        data: 'Бердник, Василина, Гаврилко, Гапич, Гаркавый, Геращенко, Гирка,\n' +
                                            'Горбенко, Денисенко, Дорошенко, Захарченко, Койло, Колодий, Король,\n' +
                                            'Коряка, Кулик, Кузуб, Малыш, Мартиненко, Марченко, Маслак, Овчаренко,\n' +
                                            'Роменец, Рябченко, Скирта, Стригун, Ступник, Табаченко, Тельцов, Троян,\n' +
                                            'Шаренко, Швец, Шевченко, Шелудько'
                                    }
                                ]
                            },
                            {
                                name: 'Берестовская волость',
                                data: [
                                    {
                                        name: 'с. Берестовка (список фамилий согласно переписи 1926 г.)',
                                        data: 'Антоненко, Бесога, Бурлака, Вертий, Воропай, Гребельный, Драган, \n' +
                                            'Илляшевич, Коваленко, Костенко, Кошель, Кравченко, Кулида, Лавриненко, \n' +
                                            'Лисненко, Максимова, Малюга, Марченко, Павленко, Пасько, Пишненко, \n' +
                                            'Потеря, Потока, Приходько, Ручненко, Сенченко, Слабоспицкий, Стецюра, \n' +
                                            'Стрелец, Таран, Терещенко, Терлецька, Ткаченко, Тютюнник, Цюх, Шилко'
                                    },
                                    {
                                        name: 'с. Комличка (списки фамилий за 1858-59 гг.)',
                                        data: 'Бабич, Барашко, Бардак, Белоконь, Бовкун, Бойко, Борщ, Буря, Ващенко, \n' +
                                            'Гирсенко, Голочка, Гончар, Горбач, Горобец, Горпиненко, Гречаник, Грицай, \n' +
                                            'Гуржий, Гуц, Деменский, Демьяненко, Дашков, Дидюра, Дикань, Димитрук, \n' +
                                            'Димяненко, Драный, Жежиль, Журба, Заец, Зеленый, Зинченко, Ильяшевич, \n' +
                                            'Калиниченко, Кивенко, Коваль, Колесниченко, Костенко, Косяченко, Кочерга, \n' +
                                            'Кочовый, Кошиль, Кравец, Кравченко, Купальный, Кущ, Лаврик, Ленюх, Лиска, \n' +
                                            'Ляшенко, Макаренко, Марченко, Митянский, Мовчан, Могильный, Мусиенко, \n' +
                                            'Николаенко, Оноприй, Осинный, Павлюк, Падалка, Паламаренко, Панченко, \n' +
                                            'Пархоменко, Пастухов, Перехожинский, Петраш, Петрюк, Пилипенко, Пирский, \n' +
                                            'Письменный, Погорелый, Приймак, Приходько, Продан, Рогоз, Рябуха, Семешко, \n' +
                                            'Сидоряк, Силенко, Скрыпай, Слабинец, Смирницкий, Снигирь, Станиславский \n' +
                                            'Стецюра, Стрелец, Ступка, Сухомлин, Таран, Тимошенко, Ткаченко, Троценко, \n' +
                                            'Троян, Тютюник, Федоренко, Федоров, Фисун, Харуненко, Хилько, Чуприна, \n' +
                                            'Шарко, Шевченко, Шиконь, Шиян, Шовковый, Шелудько, Щербак, Щербина, Янгол'
                                    },
                                    {
                                        name: 'с. Семеновка',
                                        data: []
                                    }
                                ]
                            },
                            {
                                name: 'Борковская волость',
                                data: [
                                    {
                                        name: 'с. Борки',
                                        data: []
                                    }, {
                                        name: 'с. Подставки',
                                        data: []
                                    }, {
                                        name: 'с. Сватки',
                                        data: []
                                    }
                                ]
                            },
                            {
                                name: 'Вельбовская волость',
                                data: [
                                    {
                                        name: 'с. Вельбовка',
                                        data: []
                                    }, {
                                        name: 'хут. Ковалевский (Запсиольский)',
                                        data: []
                                    }, {
                                        name: 'с. Монастырския Будища (список фамилий согласно переписи 1926 г.)',
                                        data: 'Бацула, Беркита, Билоконь, Биляков, Геращенко, Диденко, Журавель, \n' +
                                            'Зубенко, Иващенко, Коваленко, Лисаченко, Лисовый, Мележик, Миронченко, \n' +
                                            'Мищенко, Момот, Оленченко, Панасенко, Петренко, Ренчук, Сахно, \n' +
                                            'Терещенко, Ткаченко, Тютюнник, Фесенко, Шестопал'
                                    },
                                    {
                                        name: 'с. Свинарное',
                                        data: []
                                    }, {
                                        name: 'хут. Юрьевка',
                                        data: []
                                    }
                                ]
                            },
                            {
                                name: 'Веприкская волость',
                                data: [
                                    {
                                        name: 'с. Бобрик',
                                        data: []
                                    }, {
                                        name: 'мест. Веприк',
                                        data: []
                                    }, {
                                        name: 'с. Книшовка',
                                        data: []
                                    },
                                    {
                                        name: 'дер. Николаевка',
                                        data: []
                                    }, {
                                        name: 'дер. Роменец',
                                        data: []
                                    }
                                ]
                            },
                            {
                                name: 'Капустинская волость',
                                data: [
                                    {
                                        name: 'с. Беево',
                                        data: []
                                    },
                                    {
                                        name: 'c. Капустинцы',
                                        data: []
                                    }, {
                                        name: 'дер. Марьяновка',
                                        data: []
                                    }
                                ]
                            },
                            {
                                name: 'Красно-Лукская волость',
                                data: [
                                    {
                                        name: 'с. Броварки (некоторые фамилии жителей села в 1926 г.)',
                                        data: 'Гребельник, Гречка, Даниленко, Кваша, Кишка, Коротя, Марченко, \n' +
                                            'Мовчан, Нечепоренко, Прядка, Шаповал, Шидло, Шийка, Шило, Шульга'
                                    },
                                    {
                                        name: 'дер. Гричановка',
                                        data: []
                                    }, {
                                        name: 'с. Красная Лука',
                                        data: []
                                    }, {
                                        name: 'с. Максимовка',
                                        data: []
                                    },
                                    {
                                        name: 'дер. Митрофановка',
                                        data: []
                                    }, {
                                        name: 'дер. Николаев',
                                        data: []
                                    }, {
                                        name: 'с. Рымаровка',
                                        data: []
                                    },
                                    {
                                        name: 'с. Хитцы',
                                        data: []
                                    }
                                ]
                            },
                            {
                                name: 'Липово-Долинская волость',
                                data: [
                                    {
                                        name: 'с. Апанасовка',
                                        data: []
                                    },
                                    {
                                        name: 'с. Липовая Долина',
                                        data: []
                                    }
                                ]
                            },
                            {
                                name: 'Лютеньская волость',
                                data: [
                                    {
                                        name: 'хут. Кривка',
                                        data: []
                                    },
                                    {
                                        name: 'м-ко Лютенька (список членов Лютеньского с/х общества за 1909 г.)',
                                        data: 'Андреев, Барабаш, Березовский, Блоха, Бойко, Бородай, Бут, \n' +
                                            'Галагуза, Гринь, Гринько, Губрий, Данильченко, Дуброва, Думенко, \n' +
                                            'Жавницкий, Злепко, Зорохович, Зубенко, Исаев, Ищенко, Кацюба, \n' +
                                            'Кийко, Киряев, Коваленко, Козаковский, Костенко, Корзун, Кошевой, \n' +
                                            'Криволап, Лаврик, Луценко, Люборец, Мельников, Мисак, Мищенко, \n' +
                                            'Назаренко, Никифоров, Пищала, Петренко, Потешный, Рой, Семенда, \n' +
                                            'Скаженик, Снежко, Солодовник, Терела, Триль, Турчин, Фурса, \n' +
                                            'Хлопко, Хоменко, Христовой, Шпак, Шутько, Чабановский, Чайка, Юрченко'
                                    },
                                    {
                                        name: 'дер. Лютеньския Млины',
                                        data: []
                                    }
                                ]
                            },
                            {
                                name: 'Петровская волость',
                                data: [
                                    {
                                        name: 'с. Венеславовка',
                                        data: []
                                    }, {
                                        name: 'хут. Ветхаловка',
                                        data: []
                                    }, {
                                        name: 'дер. Коновал',
                                        data: []
                                    }, {
                                        name: 'с. Петровка (списки фамилий за 1857-58 гг.)',
                                        data: 'Бакай, Балясный, Барановский, Белик, Белоус, Бондарь, Будянский, \n' +
                                            'Бутенко, Валгай, Величко, Галаган, Гладкий, Грушка, Даниленко, \n' +
                                            'Жиленко, Заворотный, Зинченко, Илляшевич, Исаенко, Кириченко, \n' +
                                            'Коваленко, Ковтун, Коломиец, Котляренко, Крохмальный, Кузьмиченко, \n' +
                                            'Кулик, Лисак, Лосиевский, Матвийко, Мигаль, Мирошниченко, Мищенко, \n' +
                                            'Нагирный, Негреев, Носенко, Онищенко, Очеретный, Панасенко, Плис, \n' +
                                            'Подсадный, Пройдак, Прочухин, Розуменко, Рухляда, Рядский, Сахно, \n' +
                                            'Спинка, Тимошенко, Топчий, Фесенко, Хижняк, Холод, Христенко, \n' +
                                            'Шморгаль, Юхименко'
                                    }, {
                                        name: 'с. Ручки',
                                        data: []
                                    }, {
                                        name: 'с. Середняки',
                                        data: []
                                    }
                                ]
                            },
                            {
                                name: 'Подолковская волость',
                                data: [
                                    {
                                        name: 'с. Подолки',
                                        data: []
                                    }, {
                                        name: 'с. Синевка',
                                        data: []
                                    }
                                ]
                            },
                            {
                                name: 'Рашевская волость',
                                data: [
                                    {
                                        name: 'хут. Глубокая Долина',
                                        data: []
                                    }, {
                                        name: 'хут. Лизунка',
                                        data: []
                                    }, {
                                        name: 'с. Лисовка',
                                        data: []
                                    }, {
                                        name: 'дер. Перевоз',
                                        data: []
                                    }, {
                                        name: 'местечко Рашевка',
                                        data: []
                                    }, {
                                        name: 'хут. Сайка',
                                        data: []
                                    }, {
                                        name: 'хут. Солдатово',
                                        data: []
                                    }, {
                                        name: 'с. Харьковцы',
                                        data: []
                                    }, {
                                        name: 'хут. Чикалы',
                                        data: []
                                    }
                                ]
                            },
                            {
                                name: 'Русановская волость',
                                data: [{
                                    name: 'хут. Александровский (Байрак 1й). Фамилии жителей хутора в 1926 г.',
                                    data: 'Булыг, Дивиченко, Карпенко, Карнецкий, Самийлык, Сердюк'
                                }, {
                                    name: 'хут. Байрак 2й (фамилии жителей хутора в 1926 г.)',
                                    data: 'Баляба, Дивиченко, Савченко, Столбиков, Терещенко'
                                }, {
                                    name: 'дер. Ивановка (списки фамилий за 1894-95 гг.)',
                                    data: 'Богомол, Гаврющенко, Горбатенко, Иванченко, Кащенко, Крюченко,\n' +
                                        'Купавский, Набок, Титаренко, Хащенко, Шаповал'
                                }, {
                                    name: 'хут. Куцупиевка (списки фамилий за 1894-95 гг.)',
                                    data: 'Баклай, Власенко, Гарасько, Грудницкий, Давиденко, Добренко,\n' +
                                        'Зубань, Кочерга, Куковский, Легкий, Мирошниченко, Петрик, Плющин,\n' +
                                        'Сергиенко, Таратун, Трегубенко, Хомяк, Ющенко'
                                }, {
                                    name: 'с. Лучки (списки фамилий за 1894-95 гг.)',
                                    data: 'Гапон, Дацько, Диденко, Колодий, Левченко, Лиходед, Панасейко,\n' +
                                        'Скляр, Ставицкий, Стецик, Холявка, Храполь'
                                }, {
                                    name: 'хут. Масоновщина',
                                    data: []
                                }, {
                                    name: 'хут. Ольшана (списки фамилий за 1894-95 гг.)',
                                    data: 'Гребнер, Клименко, Косюшко, Кравченко, Осовицкий, Писаченко,\n' +
                                        'Хурсай'
                                }, {
                                    name: 'хут. Побыванка (списки фамилий за 1894-95 гг.)',
                                    data: 'Байдык, Гах, Герасименко, Гунька, Кодратенко, Котенко, Литовка,\n' +
                                        'Ляшенко, Посенко, Ризниченко, Роспоп, Сулим, Сухонос'
                                }, {
                                    name: 'с. Русановка (списки фамилий за 1894-95 гг.):',
                                    data: 'Авраменко, Антоненко, Бабенко, Бардак, Безрукавый, Белик,\n' +
                                        'Белоцекровский, Белоус, Белуха, Бельмос, Бойко, Бугай, Буряк, Бутенко,\n' +
                                        'Вареник, Васильев, Венецкий, Гавриленко, Гайдаенко, Гейко,\n' +
                                        'Герасименко, Гладун, Гнедаш, Головань, Горовенко, Гречко, Гриценко,\n' +
                                        'Грицын, Данько, Довбыш, Довгаль, Дубровный, Дяченко, Жигмановский,\n' +
                                        'Завгородний, Зубко, Зюба, Иванченко, Искра, Карабут, Качай, Колодий,\n' +
                                        'Кривенко, Кузьменко, Кулиш, Куп(-к)авский, Курило, Лавренко,\n' +
                                        'Лизогубов, Литвиненко, Лопа, Лысак, Людный, Кицак, Клименко,\n' +
                                        'Ковбаса, Коломиец, Кузьменко, Купка, Макивский, Малыш, Мартинец,\n' +
                                        'Марченко, Матяш, Мащенко, Мега, Миргородец, Москаленко, Мостовый,\n' +
                                        'Мурашка, Набоков, Недилько(а), Нечипоренко, Нечитайло, Обишенко,\n' +
                                        'Овсиевский, Оксютег, Панасенко, Панов, Панченко, Пищаленко, Плюта,\n' +
                                        'Подоляка, Погарский, Покровский, Пономаренко, Попов, Потапенко,\n' +
                                        'Прокопенко, Ржеплинский, Роенко, Руденко, Рудь, Рычин, Рябовол,\n' +
                                        'Рябоконь, Саввин, Самилык, Святоха, Семененко, Сердюк, Сенько,\n' +
                                        'Сидоренко, Скляр, Слива, Сова, Солодкий, Сохань, Среблянский,\n' +
                                        'Тарасенко, Тесленко, Терновый, Тихонович, Турко, Федоров, Фесун,\n' +
                                        'Христенко, Худолий, Цорин, Чемерис, Ченчик, Шевченко, Шепиль,\n' +
                                        'Штанько, Штолтовный, Шульга, Шуляк, Шыйко, Щербак, Юрик, Яковенко,\n' +
                                        'Якуб, Яновский, Яременко, Яцун'
                                }, {
                                    name: 'хут. Яснопольщина (Вощинина). Списки фамилий за 1894-95 гг.',
                                    data: 'Бережный, Гоменко, Зинченко, Клышко, Коваленко, Коноваленко,\n' +
                                        'Коровченко, Козлов, Левченко, Любота, Мартынец, Москаленко, Роенко,\n' +
                                        'Сенько, Ситак, Трегубенко'
                                }]
                            },
                            {
                                name: 'Сарская волость',
                                data: [
                                    {
                                        name: 'с. Крутьки',
                                        data: []
                                    }, {
                                        name: 'с. Сары',
                                        data: []
                                    }
                                ]
                            },
                            {
                                name: 'Сергеевская волость',
                                data: [
                                    {
                                        name: 'с. Разбышевка',
                                        data: []
                                    }, {
                                        name: 'с. Сергеевка',
                                        data: []
                                    }, {
                                        name: 'хут. Чернече',
                                        data: []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        name: "Зеньковский уезд",
                        data: [
                            {
                                name: 'г. Зеньков',
                                data: []
                    },
                    {
                        name: 'Бельская волость',
                        data: [
                            {
                                name: 'с. Бельск',
                                data: []
                            }, {
                                name: 'с. Глинск',
                                data: []
                            }, {
                                name: 'с. Лизьки',
                                data: []
                            }, {
                                name: 'д. Млинки',
                                data: []
                            }, {
                                name: 'д. Никольско-Степановка (Саранчевка)',
                                data: []
                            }, {
                                name: 'д. Петро-Анновка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Борковская волость',
                        data: [
                            {
                                name: 'м-ко Борки',
                                data: []
                            }, {
                                name: 'д. Новоселовка',
                                data: []
                            }, {
                                name: 'д. Пантелеймоновка',
                                data: []
                            }, {
                                name: 'с. Трояновка',
                                data: []
                            }, {
                                name: 'д. Ульяновка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Велико-Будищская волость',
                        data: [
                            {
                                name: 'м-ко Великие Будищи',
                                data: []
                            }, {
                                name: 'с. Водяная Балка',
                                data: []
                            }, {
                                name: 'д. Карташевка',
                                data: []
                            }, {
                                name: 'с. Писаревщина',
                                data: []
                            }, {
                                name: 'д. Старые Млины',
                                data: []
                            }, {
                                name: 'с. Чернечий Яр',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Велико-Павловская волость',
                        data: [
                            {
                                name: 'с. Велико-Павловка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Груньская волость',
                        data: [
                            {
                                name: 'с. Гнилица',
                                data: []
                            }, {
                                name: 'м-ко Грунь',
                                data: []
                            }, {
                                name: 'с. Шенгреевка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Дейкаловская волость',
                        data: [
                            {
                                name: 'с. Власовка',
                                data: []
                            }, {
                                name: 'д. Голейка',
                                data: []
                            }, {
                                name: 'д. Дадакаловка',
                                data: []
                            }, {
                                name: 'с. Дейкаловка',
                                data: []
                            }, {
                                name: 'д. Новоказачка',
                                data: []
                            }, {
                                name: 'с. Подозирка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Заиченская волость',
                        data: [
                            {
                                name: 'с. Батьки',
                                data: []
                            }, {
                                name: 'с. Заиченцы',
                                data: []
                            }, {
                                name: 'с. Малые Будищечки',
                                data: []
                            }, {
                                name: 'д. Новоселовка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Зеньковская волость',
                        data: [
                            {
                                name: 'с. Ступки',
                                data: []
                            }, {
                                name: 'хут. Хмаровка',
                                data: []
                            }, {
                                name: 'с. Шиловка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Иордановская волость',
                        data: [
                            {
                                name: 'д. Андреевка',
                                data: []
                            }, {
                                name: 'д. Анновка',
                                data: []
                            }, {
                                name: 'д. Бекеево (Петровка)',
                                data: []
                            }, {
                                name: 'д. Елизаветовка',
                                data: []
                            }, {
                                name: 'с. Жоржавка',
                                data: []
                            }, {
                                name: 'с. Иордановка',
                                data: []
                            }, {
                                name: 'д. Кисилиха',
                                data: []
                            }, {
                                name: 'д. Михайловка',
                                data: []
                            }, {
                                name: 'д. Морозовка',
                                data: []
                            }, {
                                name: 'д. Николаевка',
                                data: []
                            }, {
                                name: 'д. Ново-Васильевка',
                                data: []
                            }, {
                                name: 'д. Павловка',
                                data: []
                            }, {
                                name: 'д. Петродавидовка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Кирилло-Анновская волость',
                        data: [
                            {
                                name: 'д. Василье-Устимовка',
                                data: []
                            }, {
                                name: 'д. Васильевка',
                                data: []
                            }, {
                                name: 'д. Грунь-Байкар',
                                data: []
                            }, {
                                name: 'д. Дамаски',
                                data: []
                            }, {
                                name: 'д. Ивановка',
                                data: []
                            }, {
                                name: 'с. Кирилло-Анновка',
                                data: []
                            }, {
                                name: 'д. Михайловка',
                                data: []
                            }, {
                                name: 'д. Пащенкова',
                                data: []
                            }, {
                                name: 'с. Покровское',
                                data: []
                            }, {
                                name: 'д. Порскаловка',
                                data: []
                            }, {
                                name: 'д. Солоха',
                                data: []
                            }, {
                                name: 'д. Старо-Бороховщина',
                                data: []
                            }, {
                                name: 'с. Федоровка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Ковалевская волость',
                        data: [
                            {
                                name: 'д. Величкова',
                                data: []
                            }, {
                                name: 'с. Загруновка',
                                data: []
                            }, {
                                name: 'д. Климовка',
                                data: []
                            }, {
                                name: 'м-ко Ковалевка',
                                data: []
                            }, {
                                name: 'д. Колоколовка',
                                data: []
                            }, {
                                name: 'д. Малая Запруновка',
                                data: []
                            }, {
                                name: 'с. Романовка',
                                data: []
                            }, {
                                name: 'д. Хатки',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Комышевская волость',
                        data: [
                            {
                                name: 'с. Комыши',
                                data: []
                            }, {
                                name: 'с. Малая Павловка',
                                data: []
                            }, {
                                name: 'д. Николаевка',
                                data: []
                            }, {
                                name: 'с. Пирки',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Куземинская волость',
                        data: [
                            {
                                name: 'с. Буды',
                                data: []
                            }, {
                                name: 'с. Довжек',
                                data: []
                            }, {
                                name: 'с. Куземин',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Лютеньско-Будищская волость',
                        data: [
                            {
                                name: 'с. Лютеньские Будищи',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Опошнянская волость',
                        data: [
                            {
                                name: 'д. Атамановка',
                                data: []
                            }, {
                                name: 'с. Бухаловка',
                                data: []
                            }, {
                                name: 'д. Васьки',
                                data: []
                            }, {
                                name: 'пос. Лазурка',
                                data: []
                            }, {
                                name: 'д. Лукашевка',
                                data: []
                            }, {
                                name: 'с. Мисские Млины',
                                data: []
                            }, {
                                name: 'м-ко Опошня',
                                data: []
                            }, {
                                name: 'с. Поповка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Тарасовская волость',
                        data: [
                            {
                                name: 'с. Бобровник',
                                data: []
                            }, {
                                name: 'д. Меркульевка (Яновщина)',
                                data: []
                            }, {
                                name: 'с. Тарасовка',
                                data: []
                            }, {
                                name: 'хут. Удовиченко',
                                data: []
                            }
                        ]
                    }
                ]
            },
            {
                name: "Золотоношский уезд",
                data: [
                    {
                        name: 'г. Золотоноша',
                        data: []
            },
            {
                name: 'Безпальчевская волость',
                data: [
                    {
                        name: 'с. Безпальче',
                        data: []
                    }, {
                        name: 'д. Воробьевка',
                        data: []
                    }, {
                        name: 'с. Жерноклевы',
                        data: []
                    }, {
                        name: 'с. Подставки',
                        data: []
                    }, {
                        name: 'д. Софиевка',
                        data: []
                    }, {
                        name: 'д. Тополи',
                        data: []
                    }
                ]
            },
            {
                name: 'Богодуховская волость',
                data: [
                    {
                        name: 'с. Богодуховка',
                        data: []
                    }, {
                        name: 'д. Головатовка',
                        data: []
                    }, {
                        name: 'д. Ивановка',
                        data: []
                    }, {
                        name: 'с. Красеновка',
                        data: []
                    }, {
                        name: 'с. Крестителево',
                        data: []
                    }, {
                        name: 'д. Марьяновка',
                        data: []
                    }, {
                        name: 'д. Прилипки',
                        data: []
                    }, {
                        name: 'с. Савковка',
                        data: []
                    }
                ]
            },
            {
                name: 'Белоусовская волость',
                data: [
                    {
                        name: 'д. Бойковщина',
                        data: []
                    }, {
                        name: 'с. Белоусовка',
                        data: []
                    }, {
                        name: 'с. Деркачевка',
                        data: []
                    }, {
                        name: 'д. Мехедовка',
                        data: []
                    }, {
                        name: 'с. Митлашевка',
                        data: []
                    }, {
                        name: 'с. Созоновка',
                        data: []
                    }
                ]
            },
            {
                name: 'Васютинская волость',
                data: [
                    {
                        name: 'с. Васютинцы (списки фамилий за 1901-06 гг.)',
                        data: 'Антоненко, Бабенко, Бакай, Безкоровайный, Березань, Бубило, Василенко, \n' +
                            'Вергай, Водяник, Гайдамак, Гайдар, Ганницкий, Гречный, Гужол, Гузь, \n' +
                            'Гулий, Гуржий, Дворный, Денисенко, Диденко, Дмитренко, Дубовик, \n' +
                            'Заболотько, Запорожец, Зубченко, Иваненко, Иванец, Калина, Короп, \n' +
                            'Кролевец, Кудря, Кузько, Лелюх, Литвиненко, Любченко, Манько, Моляка, \n' +
                            'Морда, Мосур, Носенко, Овдиенко, Онищенко, Павленко, Пархоменко, \n' +
                            'Перехрест, Петрик, Понурий, Сахно, Скуба, Сумской, Супрун, Таран, \n' +
                            'Терещенко, Тищенко, Троян, Удод, Упир, Фесенко, Харченко, Хоменко, \n' +
                            'Черепинский, Чернявский, Чимбай, Чопенко, Шабельник, Шерстюк, Ярошенко'
                    }, {
                        name: 'с. Котлов',
                        data: []
                    }, {
                        name: 'с. Москаленки',
                        data: []
                    }, {
                        name: 'с. Старое',
                        data: []
                    }
                ]
            },
            {
                name: 'Велико-Буромская волость',
                data: [
                    {
                        name: 'с. Велико-Буромка',
                        data: []
                    }, {
                        name: 'д. Лукашевка',
                        data: []
                    }, {
                        name: 'с. Лящовка',
                        data: []
                    }, {
                        name: 'с. Малая Буромка',
                        data: []
                    }, {
                        name: 'д. Мохнач',
                        data: []
                    }
                ]
            },
            {
                name: 'Велико-Хуторская волость',
                data: [
                    {
                        name: 'д. Ашаниновка',
                        data: []
                    }, {
                        name: 'хут. Бондаревка',
                        data: []
                    }, {
                        name: 'с. Великий Хутор',
                        data: []
                    }, {
                        name: 'д. Гайворонщина',
                        data: []
                    }, {
                        name: 'хут. Галатовка',
                        data: []
                    }, {
                        name: 'с. Драбовцы',
                        data: []
                    }, {
                        name: 'д. Жиловка',
                        data: []
                    }, {
                        name: 'с. Львовка',
                        data: []
                    }, {
                        name: 'с. Николаевка',
                        data: []
                    }, {
                        name: 'хут. Раковка',
                        data: []
                    }, {
                        name: 'с. Сенковцы',
                        data: []
                    }, {
                        name: 'д. Скориковка',
                        data: []
                    }, {
                        name: 'хут. Соколы',
                        data: []
                    }, {
                        name: 'д. Сотницкая Гребля',
                        data: []
                    }
                ]
            },
            {
                name: 'Вознесенская волость',
                data: [
                    {
                        name: 'с. Благовещенское',
                        data: []
                    }, {
                        name: 'с. Богуславец',
                        data: []
                    }, {
                        name: 'с. Вознесенское',
                        data: []
                    }, {
                        name: 'д. Зоровка',
                        data: []
                    }, {
                        name: 'д. Кривоносовка',
                        data: []
                    }, {
                        name: 'с. Лукашевка',
                        data: []
                    }, {
                        name: 'д. Манжаковка',
                        data: []
                    }, {
                        name: 'д. Мелесовка',
                        data: []
                    }, {
                        name: 'д. Пальмир',
                        data: []
                    }, {
                        name: 'с. Синеоковка',
                        data: []
                    }, {
                        name: 'д. Сотниковка',
                        data: []
                    }, {
                        name: 'д. Сухая Згарь',
                        data: []
                    }, {
                        name: 'д. Хрущевка',
                        data: []
                    }
                ]
            },
            {
                name: 'Гельмязовская волость',
                data: [
                    {
                        name: 'с. Богданы',
                        data: []
                    }, {
                        name: 'с. Гельмязово',
                        data: []
                    }, {
                        name: 'д. Дубинка',
                        data: []
                    }, {
                        name: 'с. Каврай',
                        data: []
                    }, {
                        name: 'с. Каврай Левада',
                        data: []
                    }, {
                        name: 'с. Каленики',
                        data: []
                    }, {
                        name: 'с. Плешкани',
                        data: []
                    }, {
                        name: 'д. Софиевка',
                        data: []
                    }
                ]
            },
            {
                name: 'Драбовская волость',
                data: [
                    {
                        name: 'хут. Вершино-Згарский',
                        data: []
                    }, {
                        name: 'с. Драбово',
                        data: []
                    }, {
                        name: 'д. Дуниновка',
                        data: []
                    }, {
                        name: 'с. Михайловка',
                        data: []
                    }, {
                        name: 'с. Олимпиадовка',
                        data: []
                    }, {
                        name: 'д. Павловщина',
                        data: []
                    }, {
                        name: 'д. Рождественская',
                        data: []
                    }
                ]
            },
            {
                name: 'Еремеевская волость',
                data: [
                    {
                        name: 'с. Еремеевка',
                        data: []
                    }, {
                        name: 'д. Митлашевка',
                        data: []
                    }, {
                        name: 'д. Погорелая',
                        data: []
                    }
                ]
            },
            {
                name: 'Жовнинская волость',
                data: [
                    {
                        name: 'д. Воинская Гребля',
                        data: []
                    }, {
                        name: 'с. Жовнино',
                        data: []
                    }, {
                        name: 'с. Клишенцы',
                        data: []
                    }, {
                        name: 'с. Матвеевка',
                        data: []
                    }
                ]
            },
            {
                name: 'Золотоношская волость',
                data: [
                    {
                        name: 'с. Антиповка',
                        data: []
                    }, {
                        name: 'с. Домонтово',
                        data: []
                    }, {
                        name: 'д. Железки',
                        data: []
                    }, {
                        name: 'с. Ковтуны',
                        data: []
                    }, {
                        name: 'с. Коробовка',
                        data: []
                    }, {
                        name: 'д. Кресты',
                        data: []
                    }, {
                        name: 'с. Липовское',
                        data: []
                    }, {
                        name: 'с. Мицаловка',
                        data: []
                    }, {
                        name: 'с. Ольхи',
                        data: []
                    }, {
                        name: 'с. Слюзчиная Слободка',
                        data: []
                    }, {
                        name: 'д. Снигиревка',
                        data: []
                    }
                ]
            },
            {
                name: 'Ирклеевская волость',
                data: [
                    {
                        name: 'д. Григорьевка',
                        data: []
                    }, {
                        name: 'д. Загородище',
                        data: []
                    }, {
                        name: 'с. Ирклеево',
                        data: []
                    }, {
                        name: 'хут. Каврай',
                        data: []
                    }, {
                        name: 'с. Лихолеты',
                        data: []
                    }, {
                        name: 'с. Ревбинцы',
                        data: []
                    }, {
                        name: 'д. Семеногорка',
                        data: []
                    }, {
                        name: 'с. Скородистик',
                        data: []
                    }, {
                        name: 'с. Старый Каврай',
                        data: []
                    }, {
                        name: 'с. Троицкое',
                        data: []
                    }
                ]
            },
            {
                name: 'Кропивенская волость',
                data: [
                    {
                        name: 'с. Богушкова Слободка',
                        data: []
                    }, {
                        name: 'д. Гобитьки',
                        data: []
                    }, {
                        name: 'с. Деньги',
                        data: []
                    }, {
                        name: 'хут. Згарские',
                        data: []
                    }, {
                        name: 'с. Кропивна',
                        data: []
                    }, {
                        name: 'с. Крупское',
                        data: []
                    }, {
                        name: 'д. Малеевка',
                        data: []
                    }, {
                        name: 'д. Тишковка',
                        data: []
                    }, {
                        name: 'хут. Фишев-Сорочинский',
                        data: []
                    }, {
                        name: 'д. Щербиновка',
                        data: []
                    }
                ]
            },
            {
                name: 'Лялинская волость',
                data: [
                    {
                        name: 'с. Гусиное',
                        data: []
                    }, {
                        name: 'с. Лялинцы',
                        data: []
                    }
                ]
            },
            {
                name: 'Мельниковская волость',
                data: [
                    {
                        name: 'с. Воронинцы',
                        data: []
                    }, {
                        name: 'д. Дубинка',
                        data: []
                    }, {
                        name: 'хут. Ильков',
                        data: []
                    }, {
                        name: 'хут. Красный',
                        data: []
                    }, {
                        name: 'с. Крутьки',
                        data: []
                    }, {
                        name: 'с. Мельники',
                        data: []
                    }, {
                        name: 'с. Панское',
                        data: []
                    }, {
                        name: 'с. Чеховка',
                        data: []
                    }
                ]
            },
            {
                name: 'Мойсенская волость',
                data: [
                    {
                        name: 'с. Бузьки',
                        data: []
                    }, {
                        name: 'д. Бельки',
                        data: []
                    }, {
                        name: 'с. Демки',
                        data: []
                    }, {
                        name: 'д. Краснохижинцы',
                        data: []
                    }, {
                        name: 'с. Митьки',
                        data: []
                    }, {
                        name: 'с. Мойсенцы',
                        data: []
                    }, {
                        name: 'с. Мутыхи',
                        data: []
                    }, {
                        name: 'с. Налески',
                        data: []
                    }, {
                        name: 'с. Пищики',
                        data: []
                    }, {
                        name: 'с. Самовицы',
                        data: []
                    }
                ]
            },
            {
                name: 'Песчанская волость',
                data: [
                    {
                        name: 'д. Гладковщина',
                        data: []
                    }, {
                        name: 'с. Дмитровка',
                        data: []
                    }, {
                        name: 'хут. Коврайский',
                        data: []
                    }, {
                        name: 'д. Матвеевка',
                        data: []
                    }, {
                        name: 'д. Новая Гребля',
                        data: []
                    }, {
                        name: 'с. Песчаное',
                        data: []
                    }, {
                        name: 'д. Подольская',
                        data: []
                    }, {
                        name: 'с. Шабельники',
                        data: []
                    }
                ]
            },
            {
                name: 'Прохоровская волость',
                data: [
                    {
                        name: 'с. Бубнов',
                        data: []
                    }, {
                        name: 'с. Бубновская Слободка',
                        data: []
                    }, {
                        name: 'с. Келеберда',
                        data: []
                    }, {
                        name: 'с. Леплавое',
                        data: []
                    }, {
                        name: 'с. Прохоровка',
                        data: []
                    }, {
                        name: 'д. Решотки',
                        data: []
                    }, {
                        name: 'с. Сушки',
                        data: []
                    }
                ]
            },
            {
                name: 'Чернобаевская волость',
                data: [
                    {
                        name: 'с. Великие Каневцы',
                        data: []
                    }, {
                        name: 'хут. Ивановка',
                        data: []
                    }, {
                        name: 'д. Константиниевка',
                        data: []
                    }, {
                        name: 'с. Малые Каневцы',
                        data: []
                    }, {
                        name: 'с. Чернобай',
                        data: []
                    }
                ]
            }]},
            {
                name: "Кобелякский уезд",
                data: [
                    {
                        name: 'г. Кобеляки',
                        data: []
                    },
                    {
                        name: 'Бреусовская волость',
                        data: [
                            {
                                name: 'д. Александровка',
                                data: []
                            }, {
                                name: 'с. Бреусовка',
                                data: []
                            }, {
                                name: 'д. Васильевка',
                                data: []
                            }, {
                                name: 'д. Кринки',
                                data: []
                            }, {
                                name: 'д. Марьевка',
                                data: []
                            }, {
                                name: 'д. Михайловка',
                                data: []
                            }, {
                                name: 'д. Мойсеевка',
                                data: []
                            }, {
                                name: 'д. Новоселовка',
                                data: []
                            }, {
                                name: 'д. Ольговка',
                                data: []
                            }, {
                                name: 'с. Пригаровка',
                                data: []
                            }, {
                                name: 'д. Сухая',
                                data: []
                            }, {
                                name: 'д. Сухой Кобелячек',
                                data: []
                            }, {
                                name: 'с. Улимовка',
                                data: []
                            }, {
                                name: 'д. Хмарина',
                                data: []
                            }, {
                                name: 'д. Штефановка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Бригадировская волость',
                        data: [
                            {
                                name: 'д. Александровка',
                                data: []
                            }, {
                                name: 'с. Бригадировка',
                                data: []
                            }, {
                                name: 'д. Васильевка',
                                data: []
                            }, {
                                name: 'д. Воронина',
                                data: []
                            }, {
                                name: 'д. Гановка',
                                data: []
                            }, {
                                name: 'д. Гуковка',
                                data: []
                            }, {
                                name: 'д. Дзюбановка',
                                data: []
                            }, {
                                name: 'д. Долгая',
                                data: []
                            }, {
                                name: 'д. Еленовка',
                                data: []
                            }, {
                                name: 'с. Козельщина',
                                data: []
                            }, {
                                name: 'д. Куликова',
                                data: []
                            }, {
                                name: 'д. Лутовиновка',
                                data: []
                            }, {
                                name: 'д. Майоровщина',
                                data: []
                            }, {
                                name: 'д. Федоровка',
                                data: []
                            }, {
                                name: 'д. Черноглазовка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Бродщанская волость',
                        data: [
                            {
                                name: 'д. Андреевка',
                                data: []
                            }, {
                                name: 'д. Бабаковка',
                                data: []
                            }, {
                                name: 'д. Берестовка',
                                data: []
                            }, {
                                name: 'с. Брощаны',
                                data: []
                            }, {
                                name: 'д. Васильевка',
                                data: []
                            }, {
                                name: 'д. Геймаровка',
                                data: []
                            }, {
                                name: 'д. Ивановка',
                                data: []
                            }, {
                                name: 'д. Лозоватовка',
                                data: []
                            }, {
                                name: 'д. Лучина',
                                data: []
                            }, {
                                name: 'д. Медяновка',
                                data: []
                            }, {
                                name: 'д. Николаевка',
                                data: []
                            }, {
                                name: 'д. Павловка',
                                data: []
                            }, {
                                name: 'с. Письменное',
                                data: []
                            }, {
                                name: 'хут. Роблено-Могилевские',
                                data: []
                            }, {
                                name: 'д. Семеновка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Беликская волость',
                        data: [
                            {
                                name: 'м-ко Белики',
                                data: []
                            }, {
                                name: 'с. Евстафиево',
                                data: []
                            }, {
                                name: 'хут. Дригина Плотина',
                                data: []
                            }, {
                                name: 'д. Федоровка-Лещиновка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Велико-Кобелякская волость',
                        data: [
                            {
                                name: 'д. Грекопавловка',
                                data: []
                            }, {
                                name: 'д. Давидовка',
                                data: []
                            }, {
                                name: 'д. Емцева Долина',
                                data: []
                            }, {
                                name: 'с. Малый Кобелячек',
                                data: []
                            }, {
                                name: 'д. Ново-Федоровка (Макаровка)',
                                data: []
                            }, {
                                name: 'д. Полузерье (Богдановка)',
                                data: []
                            }, {
                                name: 'с. Столбина Долина',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Волчеречская волость',
                        data: [
                            {
                                name: 'д. Балясновка',
                                data: []
                            }, {
                                name: 'д. Богдановка',
                                data: []
                            }, {
                                name: 'д. Бычева',
                                data: []
                            }, {
                                name: 'с. Великий Кобелячек',
                                data: []
                            }, {
                                name: 'с. Марковка',
                                data: []
                            }, {
                                name: 'д. Михайловка',
                                data: []
                            }, {
                                name: 'д. Нехайновка',
                                data: []
                            }, {
                                name: 'д. Петро-Марьяновка',
                                data: []
                            }, {
                                name: 'с. Попово',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Китайгородская волость',
                        data: [
                            {
                                name: 'д. Екатериновка',
                                data: []
                            }, {
                                name: 'м-ко Китайгород',
                                data: []
                            }, {
                                name: 'д. Плавещины',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Кишенская волость',
                        data: [
                            {
                                name: 'д. Александровка',
                                data: []
                            }, {
                                name: 'д. Бранчевка',
                                data: []
                            }, {
                                name: 'д. Вишеньки',
                                data: []
                            }, {
                                name: 'д. Дубровка',
                                data: []
                            }, {
                                name: 'м-ко Кишенка',
                                data: []
                            }, {
                                name: 'м-ко Переволочное',
                                data: []
                            }, {
                                name: 'д. Рудьки',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Клюсово-Зачепиловская волость',
                        data: [
                            {
                                name: 'д. Живиловка',
                                data: []
                            }, {
                                name: 'предместье Заворскло',
                                data: []
                            }, {
                                name: 'д. Зачепиловка',
                                data: []
                            }, {
                                name: 'с. Клюсовка',
                                data: []
                            }, {
                                name: 'д. Коробкина Роща',
                                data: []
                            }, {
                                name: 'предместье Остров',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Кобелякская волость',
                        data: [
                            {
                                name: 'д. Бережновка',
                                data: []
                            }, {
                                name: 'д. Бобровка',
                                data: []
                            }, {
                                name: 'д. Галагуровка',
                                data: []
                            }, {
                                name: 'с. Волчеречье',
                                data: []
                            }, {
                                name: 'д. Гнилая Колода',
                                data: []
                            }, {
                                name: 'д. Горишние Млины',
                                data: []
                            }, {
                                name: 'д. Григорьевка',
                                data: []
                            }, {
                                name: 'д. Драбиновка',
                                data: []
                            }, {
                                name: 'д. Елизаветовка',
                                data: []
                            }, {
                                name: 'д. Золотаревка',
                                data: []
                            }, {
                                name: 'д. Кобелячек',
                                data: []
                            }, {
                                name: 'д. Колесниковка',
                                data: []
                            }, {
                                name: 'д. Медяновка',
                                data: []
                            }, {
                                name: 'д. Николаевка',
                                data: []
                            }, {
                                name: 'д. Прилесье',
                                data: []
                            }, {
                                name: 'д. Ухановка',
                                data: []
                            }, {
                                name: 'д. Чулковка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Куликовская волость',
                        data: [
                            {
                                name: 'д. Григорьевка',
                                data: []
                            }, {
                                name: 'д. Замятневка (Ивановка)',
                                data: []
                            }, {
                                name: 'д. Михайловка',
                                data: []
                            }, {
                                name: 'с. Михновка',
                                data: []
                            }, {
                                name: 'д. Николаевка (Мазуровка)',
                                data: []
                            }, {
                                name: 'д. Паськовка',
                                data: []
                            }, {
                                name: 'с. Пащенкова Балка',
                                data: []
                            }, {
                                name: 'д. Песчаное',
                                data: []
                            }, {
                                name: 'д. Повякаловка',
                                data: []
                            }, {
                                name: 'д. Поповка',
                                data: []
                            }, {
                                name: 'д. Шамраевка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Кустоловская волость',
                        data: [
                            {
                                name: 'д. Благодатная Мыза',
                                data: []
                            }, {
                                name: 'д. Варваровка',
                                data: []
                            }, {
                                name: 'д. Васильевка',
                                data: []
                            }, {
                                name: 'д. Долгая Пустышь',
                                data: []
                            }, {
                                name: 'с. Драбиновка',
                                data: []
                            }, {
                                name: 'с. Кустолово',
                                data: []
                            }, {
                                name: 'д. Марьяновка',
                                data: []
                            }, {
                                name: 'д. Ревазовка',
                                data: []
                            }, {
                                name: 'хут. Солоницы',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Ляшковская волость',
                        data: [
                            {
                                name: 'с. Ляшковка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Маячская волость',
                        data: [
                            {
                                name: 'с. Андреевка',
                                data: []
                            }, {
                                name: 'д. Губаревка',
                                data: []
                            }, {
                                name: 'с. Канавы',
                                data: []
                            }, {
                                name: 'с. Ливенское',
                                data: []
                            }, {
                                name: 'м-ко Маячка',
                                data: []
                            }, {
                                name: 'с. Михайловка',
                                data: []
                            }, {
                                name: 'д. Николаевка',
                                data: []
                            }, {
                                name: 'д. Пустышь-Семеновка',
                                data: []
                            }, {
                                name: 'д. Рекуновка',
                                data: []
                            }, {
                                name: 'д. Шидеево',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Ново-Сенжаровская волость',
                        data: [
                            {
                                name: 'хут. Горишние',
                                data: []
                            }, {
                                name: 'хут. Забродки',
                                data: []
                            }, {
                                name: 'с. Лелюховка',
                                data: []
                            }, {
                                name: 'м-ко Новые Сенжары',
                                data: []
                            }, {
                                name: 'хут. Рукасы',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Озерская волость',
                        data: [
                            {
                                name: 'д. Александровка',
                                data: []
                            }, {
                                name: 'д. Бригадировка',
                                data: []
                            }, {
                                name: 'д. Бутов Яр',
                                data: []
                            }, {
                                name: 'д. Ивановка',
                                data: []
                            }, {
                                name: 'хут. Коваленковские',
                                data: []
                            }, {
                                name: 'д. Комендантовка',
                                data: []
                            }, {
                                name: 'д. Криничная',
                                data: []
                            }, {
                                name: 'д. Марьевка',
                                data: []
                            }, {
                                name: 'д. Николаевка',
                                data: []
                            }, {
                                name: 'м-ко Озера',
                                data: []
                            }, {
                                name: 'д. Павловка',
                                data: []
                            }, {
                                name: 'д. Просяниновка',
                                data: []
                            }, {
                                name: 'с. Солощино',
                                data: []
                            }, {
                                name: 'д. Чайковка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Орликская волость',
                        data: [
                            {
                                name: 'д. Григорьевка',
                                data: []
                            }, {
                                name: 'с. Заоченское',
                                data: []
                            }, {
                                name: 'д. Ивановка',
                                data: []
                            }, {
                                name: 'м-ко Орлик Новый',
                                data: []
                            }, {
                                name: 'м-ко Орлик Старый',
                                data: []
                            }, {
                                name: 'д. Ревущина',
                                data: []
                            }, {
                                name: 'д. Соколовщина',
                                data: []
                            }, {
                                name: 'д. Ульяновка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Сокольская волость',
                        data: [
                            {
                                name: 'хут. Дашковские',
                                data: []
                            }, {
                                name: 'хут. Дриждовка',
                                data: []
                            }, {
                                name: 'с. Лучки',
                                data: []
                            }, {
                                name: 'д. Перегоновка',
                                data: []
                            }, {
                                name: 'д. Профатиловка',
                                data: []
                            }, {
                                name: 'м-ко Соколка',
                                data: []
                            }, {
                                name: 'с. Ханделеевка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Хорошковская волость',
                        data: [
                            {
                                name: 'д. Александровка (Барабашевка)',
                                data: []
                            }, {
                                name: 'м-ко Буняковка (Яковлево)',
                                data: []
                            }, {
                                name: 'д. Вольная (Гупаловка)',
                                data: []
                            }, {
                                name: 'м-ко Голтва Гора',
                                data: []
                            }, {
                                name: 'д. Княжевка',
                                data: []
                            }, {
                                name: 'д. Марьяновка',
                                data: []
                            }, {
                                name: 'д. Ненадихо-Павловка',
                                data: []
                            }, {
                                name: 'д. Пашенная',
                                data: []
                            }, {
                                name: 'д. Терешковка',
                                data: []
                            }, {
                                name: 'с. Хорошки',
                                data: []
                            }, {
                                name: 'д. Хорошманова (Пирогова Гребля)',
                                data: []
                            }, {
                                name: 'с. Юрки',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Царичанская волость',
                        data: [
                            {
                                name: 'д. Клиново',
                                data: []
                            }, {
                                name: 'м-ко Царичанка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Чорбовская волость',
                        data: [
                            {
                                name: 'д. Антоновка',
                                data: []
                            }, {
                                name: 'д. Васильевка Давниковка',
                                data: []
                            }, {
                                name: 'д. Григорьевка-Глищина',
                                data: []
                            }, {
                                name: 'д. Грузиновка',
                                data: []
                            }, {
                                name: 'с. Ивановка',
                                data: []
                            }, {
                                name: 'с. Капшуки',
                                data: []
                            }, {
                                name: 'с. Комаровка',
                                data: []
                            }, {
                                name: 'с. Кустолово (Чербовки)',
                                data: []
                            }, {
                                name: 'с. Сухая Маячка',
                                data: []
                            }
                        ]
                    }
                ]
            },
            {
                name: "Константиноградский уезд",
                data: [
                    {
                        name: 'г. Константиноград',
                        data: []
            },
            {
                name: 'Берестовенская волость',
                data: [
                    {
                        name: 'с. Берестовенька',
                        data: []
                    }, {
                        name: 'с. Кириловка',
                        data: []
                    }, {
                        name: 'с. Крестище',
                        data: []
                    }
                ]
            },
            {
                name: 'Белуховская волость',
                data: [
                    {
                        name: 'с. Белуховка',
                        data: []
                    }, {
                        name: 'с. Варваровка',
                        data: []
                    }, {
                        name: 'д. Левенцовка',
                        data: []
                    }, {
                        name: 'д. Лисичья',
                        data: []
                    }, {
                        name: 'д. Нагорная',
                        data: []
                    }, {
                        name: 'с. Ольховатка',
                        data: []
                    }
                ]
            },
            {
                name: 'Велико-Бучковская волость',
                data: [
                    {
                        name: 'д. Андреевка',
                        data: []
                    }, {
                        name: 'с. Богатая Чернетчина',
                        data: []
                    }, {
                        name: 'с. Великие Бучки',
                        data: []
                    }, {
                        name: 'с. Дубовые Гряды',
                        data: []
                    }, {
                        name: 'с. Екатериновка',
                        data: []
                    }, {
                        name: 'д. Зиньковщина',
                        data: []
                    }, {
                        name: 'д. Константиновка',
                        data: []
                    }, {
                        name: 'с. Крутояровка',
                        data: []
                    }, {
                        name: 'с. Мажарово',
                        data: []
                    }, {
                        name: 'д. Ново-Мажарово',
                        data: []
                    }, {
                        name: 'д. Ново-Пекельная',
                        data: []
                    }, {
                        name: 'д. Павловка',
                        data: []
                    }, {
                        name: 'д. Пекельная',
                        data: []
                    }, {
                        name: 'кол. Судиха',
                        data: []
                    }, {
                        name: 'кол. Тавежня',
                        data: []
                    }
                ]
            },
            {
                name: 'Ганебновская волость',
                data: [
                    {
                        name: 'д. Андреевка',
                        data: []
                    }, {
                        name: 'д. Васильевка',
                        data: []
                    }, {
                        name: 'с. Ганебное',
                        data: []
                    }, {
                        name: 'д. Дмитровка',
                        data: []
                    }, {
                        name: 'д. Екатериновка',
                        data: []
                    }, {
                        name: 'д. Ивановка',
                        data: []
                    }, {
                        name: 'д. Каможенцы',
                        data: []
                    }, {
                        name: 'с. Конанки',
                        data: []
                    }, {
                        name: 'д. Марьевка',
                        data: []
                    }, {
                        name: 'с. Михайловка',
                        data: []
                    }, {
                        name: 'д. Нееловка',
                        data: []
                    }, {
                        name: 'д. Николаевка',
                        data: []
                    }, {
                        name: 'д. Ново-Александровка',
                        data: []
                    }, {
                        name: 'д. Ново-Васильевка',
                        data: []
                    }, {
                        name: 'д. Ново-Ивановка',
                        data: []
                    }, {
                        name: 'кол. Ново-Михайловка',
                        data: []
                    }, {
                        name: 'д. Ново-Павловка',
                        data: []
                    }, {
                        name: 'д. Новоселовка',
                        data: []
                    }, {
                        name: 'д. Павловка',
                        data: []
                    }, {
                        name: 'с. Парасковея Шляховая',
                        data: []
                    }, {
                        name: 'д. Писаревка',
                        data: []
                    }, {
                        name: 'д. Покровская',
                        data: []
                    }, {
                        name: 'д. Софиевка',
                        data: []
                    }, {
                        name: 'д. Сумская (Гостряковка)',
                        data: []
                    }, {
                        name: 'д. Шляховая',
                        data: []
                    }, {
                        name: 'д. Яковлевка',
                        data: []
                    }
                ]
            },
            {
                name: 'Дар-Надежинская волость',
                data: [
                    {
                        name: 'д. Александровка (Скотарки)',
                        data: []
                    }, {
                        name: 'с. Андреевка (Левченково, Новозыбковка)',
                        data: []
                    }, {
                        name: 'кол. Безак',
                        data: []
                    }, {
                        name: 'д. Богдановка',
                        data: []
                    }, {
                        name: 'д. Верхне-Землянка',
                        data: []
                    }, {
                        name: 'хут. Германовка',
                        data: []
                    }, {
                        name: 'д. Глушковка',
                        data: []
                    }, {
                        name: 'д. Григорьевка',
                        data: []
                    }, {
                        name: 'с. Дар-Надежда (Сахновщина)',
                        data: []
                    }, {
                        name: 'д. Дмитровка',
                        data: []
                    }, {
                        name: 'с. Константиновка (Струковка)',
                        data: []
                    }, {
                        name: 'д. Куликовка',
                        data: []
                    }, {
                        name: 'д. Мажарка',
                        data: []
                    }, {
                        name: 'д. Максимовка (Дьячковка)',
                        data: []
                    }, {
                        name: 'д. Мартыновка',
                        data: []
                    }, {
                        name: 'д. Нагорная',
                        data: []
                    }, {
                        name: 'с. Надеждино (Корнеевка)',
                        data: []
                    }, {
                        name: 'д. Нижне-Землянка',
                        data: []
                    }, {
                        name: 'д. Ново-Дмитровка',
                        data: []
                    }, {
                        name: 'д. Ново-Ивановка',
                        data: []
                    }, {
                        name: 'д. Отрада (Каражевка)',
                        data: []
                    }, {
                        name: 'д. Петровка',
                        data: []
                    }, {
                        name: 'д. Федоровка (Цитовщина)',
                        data: []
                    }, {
                        name: 'д. Чернолозка',
                        data: []
                    }, {
                        name: 'д. Юрьевка',
                        data: []
                    }
                ]
            },
            {
                name: 'Жирковская волость',
                data: [
                    {
                        name: 'с. Абрамовка',
                        data: []
                    }, {
                        name: 'д. Александровка',
                        data: []
                    }, {
                        name: 'д. Варваровка',
                        data: []
                    }, {
                        name: 'д. Глинская',
                        data: []
                    }, {
                        name: 'с. Грабовщина',
                        data: []
                    }, {
                        name: 'д. Григорьевка',
                        data: []
                    }, {
                        name: 'д. Гулаковка',
                        data: []
                    }, {
                        name: 'д. Гуляй-Степ',
                        data: []
                    }, {
                        name: 'с. Жирковка',
                        data: []
                    }, {
                        name: 'д. Ивановка',
                        data: []
                    }, {
                        name: 'с. Красногорка',
                        data: []
                    }, {
                        name: 'д. Липянка',
                        data: []
                    }, {
                        name: 'д. Любимовка',
                        data: []
                    }, {
                        name: 'д. Михайловка',
                        data: []
                    }, {
                        name: 'д. Ново-Григорьевка',
                        data: []
                    }, {
                        name: 'с. Павловка',
                        data: []
                    }, {
                        name: 'хут. Петро-Ольговка',
                        data: []
                    }, {
                        name: 'д. Покров-Мария',
                        data: []
                    }, {
                        name: 'д. Солдатовка',
                        data: []
                    }, {
                        name: 'д. Янополь',
                        data: []
                    }
                ]
            },
            {
                name: 'Зачепиловская волость',
                data: [
                    {
                        name: 'с. Александровка',
                        data: []
                    }, {
                        name: 'д. Алексовка',
                        data: []
                    }, {
                        name: 'д. Алексовка-Никаноровка',
                        data: []
                    }, {
                        name: 'с. Бердянка',
                        data: []
                    }, {
                        name: 'д. Гранковка',
                        data: []
                    }, {
                        name: 'д. Драгомановка',
                        data: []
                    }, {
                        name: 'д. Зиборина',
                        data: []
                    }, {
                        name: 'д. Займанская',
                        data: []
                    }, {
                        name: 'д. Зайцевка',
                        data: []
                    }, {
                        name: 'с. Зачепиловка',
                        data: []
                    }, {
                        name: 'хут. Копанки',
                        data: []
                    }, {
                        name: 'д. Крисовая',
                        data: []
                    }, {
                        name: 'с. Лебяжье',
                        data: []
                    }, {
                        name: 'д. Лукашевка',
                        data: []
                    }, {
                        name: 'с. Нагорная Игрушка',
                        data: []
                    }, {
                        name: 'с. Николаевка',
                        data: []
                    }, {
                        name: 'д. Ново-Григорьевка',
                        data: []
                    }, {
                        name: 'д. Семеновка',
                        data: []
                    }, {
                        name: 'д. Скалоновка',
                        data: []
                    }, {
                        name: 'с. Сомовка',
                        data: []
                    }, {
                        name: 'д. Софиевка',
                        data: []
                    }
                ]
            },
            {
                name: 'Карловская волость',
                data: [
                    {
                        name: 'м-ко Карловка',
                        data: []
                    }, {
                        name: 'с. Нижняя Ланная',
                        data: []
                    }, {
                        name: 'дер. Поповка',
                        data: []
                    }, {
                        name: 'хут. Редуты',
                        data: []
                    }, {
                        name: 'с. Федоровка',
                        data: []
                    }
                ]
            },
            {
                name: 'Кегичевская волость',
                data: [
                    {
                        name: 'д. Александровка',
                        data: []
                    }, {
                        name: 'д. Андреевка',
                        data: []
                    }, {
                        name: 'д. Антоновка',
                        data: []
                    }, {
                        name: 'д. Бессарабовка',
                        data: []
                    }, {
                        name: 'д. Гурьевка',
                        data: []
                    }, {
                        name: 'д. Гутаровка',
                        data: []
                    }, {
                        name: 'д. Добро-Ивановка',
                        data: []
                    }, {
                        name: 'д. Дмитровка',
                        data: []
                    }, {
                        name: 'с. Кегичевка (Егоровка)',
                        data: []
                    }, {
                        name: 'д. Коробковка',
                        data: []
                    }, {
                        name: 'с. Кохановка',
                        data: []
                    }, {
                        name: 'д. Крутояровка',
                        data: []
                    }, {
                        name: 'д. Надеждина',
                        data: []
                    }, {
                        name: 'д. Ново-Львовка',
                        data: []
                    }, {
                        name: 'с. Ново-Парфиевка',
                        data: []
                    }, {
                        name: 'д. Очеретоватая',
                        data: []
                    }, {
                        name: 'с. Росоховатое',
                        data: []
                    }, {
                        name: 'д. Рояковка',
                        data: []
                    }, {
                        name: 'д. Софиевка',
                        data: []
                    }, {
                        name: 'с. Шляховая',
                        data: []
                    }
                ]
            },
            {
                name: 'Мало-Перещепинская волость',
                data: [
                    {
                        name: 'с. Богдановка',
                        data: []
                    }, {
                        name: 'с. Крутая Балка',
                        data: []
                    }, {
                        name: 'д. Лисовка',
                        data: []
                    }, {
                        name: 'с. Малая Перещепина',
                        data: []
                    }, {
                        name: 'д. Паньковка',
                        data: []
                    }, {
                        name: 'д. Пологи Мамчича',
                        data: []
                    }, {
                        name: 'д. Шамраевка',
                        data: []
                    }
                ]
            },
            {
                name: 'Машевская волость',
                data: [
                    {
                        name: 'с. Андреевка',
                        data: []
                    }, {
                        name: 'с. Дмитровка',
                        data: []
                    }, {
                        name: 'с. Жуковка',
                        data: []
                    }, {
                        name: 'с. Ивановка',
                        data: []
                    }, {
                        name: 'д. Коноваловка',
                        data: []
                    }, {
                        name: 'хут. Мануйловка',
                        data: []
                    }, {
                        name: 'д. Машевка',
                        data: []
                    }, {
                        name: 'с. Мокрый Тагамлик',
                        data: []
                    }, {
                        name: 'д. Ново-Григорьевка',
                        data: []
                    }, {
                        name: 'д. Тагамлик',
                        data: []
                    }, {
                        name: 'д. Федоровка',
                        data: []
                    }, {
                        name: 'д. Яковлевка',
                        data: []
                    }
                ]
            },
            {
                name: 'Натальинская волость',
                data: [
                    {
                        name: 'д. Абазовка',
                        data: []
                    }, {
                        name: 'д. Богородичная',
                        data: []
                    }, {
                        name: 'д. Варваровка',
                        data: []
                    }, {
                        name: 'с. Вознесенское',
                        data: []
                    }, {
                        name: 'д. Добренька',
                        data: []
                    }, {
                        name: 'д. Каменка',
                        data: []
                    }, {
                        name: 'д. Катериновка',
                        data: []
                    }, {
                        name: 'д. Кобозовка',
                        data: []
                    }, {
                        name: 'д. Луговая',
                        data: []
                    }, {
                        name: 'д. Мартыновка',
                        data: []
                    }, {
                        name: 'с. Натальино',
                        data: []
                    }, {
                        name: 'д. Ново-Александровка',
                        data: []
                    }, {
                        name: 'д. Ново-Михайловка',
                        data: []
                    }, {
                        name: 'д. Ново-Павловка',
                        data: []
                    }, {
                        name: 'д. Ольховый Рог',
                        data: []
                    }, {
                        name: 'д. Очеретяная',
                        data: []
                    }, {
                        name: 'д. Ульяновка',
                        data: []
                    }
                ]
            },
            {
                name: 'Нефорощанская волость',
                data: [
                    {
                        name: 'хут. Бурты',
                        data: []
                    }, {
                        name: 'д. Катериновка',
                        data: []
                    }, {
                        name: 'с. Коноваловка',
                        data: []
                    }, {
                        name: 'с. Малая Нефорошанка',
                        data: []
                    }, {
                        name: 'м-ко Нефороща',
                        data: []
                    }, {
                        name: 'д. Ороновка',
                        data: []
                    }, {
                        name: 'хут. Свистуновка',
                        data: []
                    }, {
                        name: 'д. Собакаровка',
                        data: []
                    }, {
                        name: 'с. Соколовая Балка',
                        data: []
                    }, {
                        name: 'д. Татьяновка',
                        data: []
                    }
                ]
            },
            {
                name: 'Ново-Тагамликская волость',
                data: [
                    {
                        name: 'д. Васильевка',
                        data: []
                    }, {
                        name: 'с. Ивановка',
                        data: []
                    }, {
                        name: 'д. Козельщина',
                        data: []
                    }, {
                        name: 'д. Коновалова',
                        data: []
                    }, {
                        name: 'д. Кустолово (Лисовка)',
                        data: []
                    }, {
                        name: 'с. Кустолово (Гриневщина)',
                        data: []
                    }, {
                        name: 'с. Новый Тагамлик',
                        data: []
                    }, {
                        name: 'д. Носовка',
                        data: []
                    }, {
                        name: 'с. Писаревка',
                        data: []
                    }, {
                        name: 'д. Степная',
                        data: []
                    }, {
                        name: 'д. Суходолка',
                        data: []
                    }, {
                        name: 'д. Тимченковка',
                        data: []
                    }, {
                        name: 'д. Штеповка',
                        data: []
                    }, {
                        name: 'д. Яковлевка',
                        data: []
                    }
                ]
            },
            {
                name: 'Парасковеевская волость',
                data: [
                    {
                        name: 'д. Власовка',
                        data: []
                    }, {
                        name: 'д. Золотуховка',
                        data: []
                    }, {
                        name: 'экон. Кованька',
                        data: []
                    }, {
                        name: 'с. Лозовая',
                        data: []
                    }, {
                        name: 'с. Медведовка',
                        data: []
                    }, {
                        name: 'с. Парасковея',
                        data: []
                    }, {
                        name: 'с. Семеновка',
                        data: []
                    }, {
                        name: 'д. Григорьевка',
                        data: []
                    }, {
                        name: 'экон. Фон-Дер-Лауница',
                        data: []
                    }
                ]
            },
            {
                name: 'Песчанская волость',
                data: [
                    {
                        name: 'д. Верхняя Ланна',
                        data: []
                    }, {
                        name: 'с. Марьяновка',
                        data: []
                    }, {
                        name: 'с. Песчанка',
                        data: []
                    }, {
                        name: 'д. Тишенковка',
                        data: []
                    }, {
                        name: 'д. Холодное Плесо',
                        data: []
                    }
                ]
            },
            {
                name: 'Петровская волость',
                data: [
                    {
                        name: 'с. Березовка',
                        data: []
                    }, {
                        name: 'хут. Михайловский',
                        data: []
                    }, {
                        name: 'хут. Пелагеевский',
                        data: []
                    }, {
                        name: 'с. Петровка',
                        data: []
                    }, {
                        name: 'с. Поповка',
                        data: []
                    }, {
                        name: 'с. Циглировка',
                        data: []
                    }
                ]
            },
            {
                name: 'Руновская волость',
                data: [
                    {
                        name: 'д. Александровка',
                        data: []
                    }, {
                        name: 'хут. Гусарка',
                        data: []
                    }, {
                        name: 'д. Елизаветовка',
                        data: []
                    }, {
                        name: 'с. Залинейное',
                        data: []
                    }, {
                        name: 'с. Климовка',
                        data: []
                    }, {
                        name: 'д. Орчиковая Руновщина',
                        data: []
                    }, {
                        name: 'с. Орчиковая Чернетчина',
                        data: []
                    }, {
                        name: 'д. Педашка',
                        data: []
                    }, {
                        name: 'с. Руновщина',
                        data: []
                    }, {
                        name: 'с. Русский Орчик',
                        data: []
                    }, {
                        name: 'д. Терновка',
                        data: []
                    }
                ]
            },
            {
                name: 'Рясская волость',
                data: [
                    {
                        name: 'д. Громаковка',
                        data: []
                    }, {
                        name: 'с. Заплавка',
                        data: []
                    }, {
                        name: 'с. Миновка',
                        data: []
                    }, {
                        name: 'с. Рясское',
                        data: []
                    }, {
                        name: 'д. Уст-Липянка',
                        data: []
                    }
                ]
            },
            {
                name: 'Староверовская волость',
                data: [
                    {
                        name: 'д. Дьячковка',
                        data: []
                    }, {
                        name: 'д. Кофановка',
                        data: []
                    }, {
                        name: 'с. Староверовка',
                        data: []
                    }
                ]
            },
                    {
                        name: 'Тагамликская волость',
                        data: [
                            {
                                name: 'д. Александровка',
                                data: []
                            }, {
                                name: 'д. Артюховка',
                                data: []
                            }, {
                                name: 'д. Богдановка',
                                data: []
                            }, {
                                name: 'д. Григорьевка',
                                data: []
                            }, {
                                name: 'д. Елизаветовка',
                                data: []
                            }, {
                                name: 'д. Ивановка',
                                data: []
                            }, {
                                name: 'д. Ладыженка',
                                data: []
                            }, {
                                name: 'д. Максимовка',
                                data: []
                            }, {
                                name: 'д. Марьевка',
                                data: []
                            }, {
                                name: 'д. Николаевка',
                                data: []
                            }, {
                                name: 'д. Павловка',
                                data: []
                            }, {
                                name: 'д. Паськовка',
                                data: []
                            }, {
                                name: 'хут. Паучки',
                                data: []
                            }, {
                                name: 'с. Старицковка',
                                data: []
                            }, {
                                name: 'д. Сухой Тагамлик',
                                data: []
                            }, {
                                name: 'с. Тагамлик',
                                data: []
                            }
                        ]
                    }]
            },
            {
                name: "Кременчугский уезд",
                data: [
                    {
                        name: 'г. Кременчуг',
                        data: []
                    },
                    {
                        name: 'Глобинская волость',
                        data: [
                            {
                                name: 'м-ко Глобино',
                                data: []
                            }, {
                                name: 'пос. при ст. Глобино',
                                data: []
                            }, {
                                name: 'хут. Пасека',
                                data: []
                            }, {
                                name: 'д. Шепелевка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Горбовская волость',
                        data: [
                            {
                                name: 'с. Горбы',
                                data: []
                            }, {
                                name: 'с. Гриньки',
                                data: []
                            }, {
                                name: 'с. Жуки',
                                data: []
                            }, {
                                name: 'с. Кирьяновка',
                                data: []
                            }, {
                                name: 'д. Павловка',
                                data: []
                            }, {
                                name: 'д. Пелиховщина',
                                data: []
                            }, {
                                name: 'д. Петрашевка',
                                data: []
                            }, {
                                name: 'д. Сидоры',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Градижская волость',
                        data: [
                            {
                                name: 'д. Анновка',
                                data: []
                            }, {
                                name: 'с. Максимовка',
                                data: []
                            }, {
                                name: 'д. Николаевка',
                                data: []
                            }, {
                                name: 'д. Сердиполье',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Келебердянская волость',
                        data: [
                            {
                                name: 'д. Гужевино',
                                data: []
                            }, {
                                name: 'м-ко Келеберда',
                                data: []
                            }, {
                                name: 'д. Махмановка',
                                data: []
                            }, {
                                name: 'д. Петрашевка',
                                data: []
                            }, {
                                name: 'д. Шведовка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Кобелячковская волость',
                        data: [
                            {
                                name: 'д. Веселая',
                                data: []
                            }, {
                                name: 'д. Владимировка',
                                data: []
                            }, {
                                name: 'д. Давидовка',
                                data: []
                            }, {
                                name: 'с. Кобелячек',
                                data: []
                            }, {
                                name: 'д. Корнеевка',
                                data: []
                            }, {
                                name: 'д. Лавриковка',
                                data: []
                            }, {
                                name: 'д. Мотрено',
                                data: []
                            }, {
                                name: 'д. Пашковка',
                                data: []
                            }, {
                                name: 'с. Пришиб',
                                data: []
                            }, {
                                name: 'д. Старушковка',
                                data: []
                            }, {
                                name: 'д. Эристовка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Кохновская волость',
                        data: [
                            {
                                name: 'с. Богомоловка',
                                data: []
                            }, {
                                name: 'д. Большая Кохновка',
                                data: []
                            }, {
                                name: 'д. Малая Кохновка',
                                data: []
                            }, {
                                name: 'с. Песчаное',
                                data: []
                            }, {
                                name: 'с. Савино',
                                data: []
                            }, {
                                name: 'д. Терешковка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Крынковская волость',
                        data: [
                            {
                                name: 'д. Бетяговщина',
                                data: []
                            }, {
                                name: 'с. Большие Крынки',
                                data: []
                            }, {
                                name: 'с. Долина',
                                data: []
                            }, {
                                name: 'д. Лукашевка',
                                data: []
                            }, {
                                name: 'д. Лысовка',
                                data: []
                            }, {
                                name: 'с. Малые Крынки',
                                data: []
                            }, {
                                name: 'д. Михайловка',
                                data: []
                            }, {
                                name: 'д. Новоселовка',
                                data: []
                            }, {
                                name: 'д. Семимогила',
                                data: []
                            }, {
                                name: 'д. Скорбное',
                                data: []
                            }, {
                                name: 'д. Яновщина',
                                data: []
                            }, {
                                name: 'с. Фидровка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Крюковская волость',
                        data: [
                            {
                                name: 'пос. Демуровка',
                                data: []
                            }, {
                                name: 'пос. Карантин',
                                data: []
                            }, {
                                name: 'пос. Костромы',
                                data: []
                            }, {
                                name: 'пос. Курчановка',
                                data: []
                            }, {
                                name: 'пос. Новоселовка',
                                data: []
                            }, {
                                name: 'пос. Раковка',
                                data: []
                            }, {
                                name: 'пос. Садки',
                                data: []
                            }, {
                                name: 'пос. Чечелово',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Манжелеевская волость',
                        data: [
                            {
                                name: 'с. Броварки',
                                data: []
                            }, {
                                name: 'с. Григорьевка',
                                data: []
                            }, {
                                name: 'д. Кармазиновка',
                                data: []
                            }, {
                                name: 'с. Ламаное',
                                data: []
                            }, {
                                name: 'м-ко Манжелея',
                                data: []
                            }, {
                                name: 'с. Сиротенки',
                                data: []
                            }, {
                                name: 'с. Троцкое',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Мозолеевская волость',
                        data: [
                            {
                                name: 'с. Броварки',
                                data: []
                            }, {
                                name: 'д. Бугаевка',
                                data: []
                            }, {
                                name: 'с. Великий Узвоз',
                                data: []
                            }, {
                                name: 'д. Кагамлык',
                                data: []
                            }, {
                                name: 'д. Кондратьевка',
                                data: []
                            }, {
                                name: 'с. Лебеховка',
                                data: []
                            }, {
                                name: 'д. Маляровка',
                                data: []
                            }, {
                                name: 'с. Мозолеевка',
                                data: []
                            }, {
                                name: 'д. Натягайловка',
                                data: []
                            }, {
                                name: 'д. Николаевка',
                                data: []
                            }, {
                                name: 'д. Павловка',
                                data: []
                            }, {
                                name: 'д. Пугачевка',
                                data: []
                            }, {
                                name: 'д. Солодовка',
                                data: []
                            }, {
                                name: 'д. Степановка',
                                data: []
                            }, {
                                name: 'д. Таранивка',
                                data: []
                            }, {
                                name: 'д. Темковка',
                                data: []
                            }, {
                                name: 'д. Тоцковка',
                                data: []
                            }, {
                                name: 'д. Трудолюбовка',
                                data: []
                            }, {
                                name: 'д. Хайливка',
                                data: []
                            }, {
                                name: 'м-ко Чигрин-Дуброва',
                                data: []
                            }, {
                                name: 'с. Шушваловка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Недогарская волость',
                        data: [
                            {
                                name: 'д. Андреевка',
                                data: []
                            }, {
                                name: 'д. Букачевка',
                                data: []
                            }, {
                                name: 'м-ко Власовка',
                                data: []
                            }, {
                                name: 'с. Недогарки',
                                data: []
                            }, {
                                name: 'д. Пухальщина',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Омельникская волость',
                        data: [
                            {
                                name: 'с. Демидовка',
                                data: []
                            }, {
                                name: 'д. Замостовая',
                                data: []
                            }, {
                                name: 'с. Запсенье',
                                data: []
                            }, {
                                name: 'м-ко Омельник',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Песковская волость',
                        data: [
                            {
                                name: 'д. Александровка',
                                data: []
                            }, {
                                name: 'с. Васильевка',
                                data: []
                            }, {
                                name: 'д. Книшовка',
                                data: []
                            }, {
                                name: 'д. Корзиновка',
                                data: []
                            }, {
                                name: 'с. Мануйловка (высшая и нижн.)',
                                data: []
                            }, {
                                name: 'д. Шепелевка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Пироговская волость',
                        data: [
                            {
                                name: 'с. Борисы',
                                data: []
                            }, {
                                name: 'д. Выдноги',
                                data: []
                            }, {
                                name: 'д. Марешно',
                                data: []
                            }, {
                                name: 'д. Мойсеевка-Ивановка',
                                data: []
                            }, {
                                name: 'с. Опришки',
                                data: []
                            }, {
                                name: 'с. Пироги',
                                data: []
                            }, {
                                name: 'с. Устимовка',
                                data: []
                            }, {
                                name: 'с. Яроши',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Погребянская волость',
                        data: [
                            {
                                name: 'д. Бабичевка',
                                data: []
                            }, {
                                name: 'д. Коневщина',
                                data: []
                            }, {
                                name: 'д. Миловидовка',
                                data: []
                            }, {
                                name: 'д. Олефировка',
                                data: []
                            }, {
                                name: 'д. Петровка',
                                data: []
                            }, {
                                name: 'д. Писарщина',
                                data: []
                            }, {
                                name: 'с. Погребы',
                                data: []
                            }, {
                                name: 'с. Рублевка',
                                data: []
                            }, {
                                name: 'с. Твердохлебы',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Потокская волость',
                        data: [
                            {
                                name: 'с. Дмитровка',
                                data: []
                            }, {
                                name: 'м-ко Потоки',
                                data: []
                            }, {
                                name: 'д. Хоружевка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Пустовойтовская волость',
                        data: [
                            {
                                name: 'с. Обозновка',
                                data: []
                            }, {
                                name: 'д. Пузиково',
                                data: []
                            }, {
                                name: 'м-ко Пустовойтово',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Святиловская волость',
                        data: [
                            {
                                name: 'с. Галицкое',
                                data: []
                            }, {
                                name: 'д. Кулишевка',
                                data: []
                            }, {
                                name: 'с. Липовое',
                                data: []
                            }, {
                                name: 'д. Ротковка',
                                data: []
                            }, {
                                name: 'с. Святиловка',
                                data: []
                            }, {
                                name: 'д. Сергеевка',
                                data: []
                            }, {
                                name: 'д. Слюзовка',
                                data: []
                            }, {
                                name: 'с. Столбоваха',
                                data: []
                            }, {
                                name: 'д. Струтиловка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Солоницкая волость',
                        data: [
                            {
                                name: 'д. Бутояровка',
                                data: []
                            }, {
                                name: 'д. Верхняя Жужмановка',
                                data: []
                            }, {
                                name: 'д. Нижняя Жужмановка',
                                data: []
                            }, {
                                name: 'с. Останцы',
                                data: []
                            }, {
                                name: 'с. Солоница',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Федоровская волость',
                        data: [
                            {
                                name: 'д. Березняки',
                                data: []
                            }, {
                                name: 'с. Поповка',
                                data: []
                            }, {
                                name: 'д. Скорбное',
                                data: []
                            }, {
                                name: 'с. Федоровка',
                                data: []
                            }
                        ]
                    }
                ]
            },
            {
                name: "Лохвицкий уезд",
                data: [
                    {
                        name: 'г. Лохвица',
                        data: []
            },
            {
                name: 'Андрияшевская волость',
                data: [
                    {
                        name: 'с. Андрияшевка',
                        data: []
                    }, {
                        name: 'с. Гудимы',
                        data: []
                    }, {}
                ]
            },
            {
                name: 'Белоусовская волость',
                data: [
                    {
                        name: 'с. Бондари',
                        data: []
                    }, {
                        name: 'с. Белоусовка',
                        data: []
                    }, {
                        name: 'с. Гольцы',
                        data: []
                    }
                ]
            },
            {
                name: 'Белоцерковская волость',
                data: [
                    {
                        name: 'с. Белоцерковцы',
                        data: []
                    }, {
                        name: 'с. Дащенки',
                        data: []
                    }, {
                        name: 'с. Яцыны',
                        data: []
                    }
                ]
            },
            {
                name: 'Вороньковская волость',
                data: [
                    {
                        name: 'м-ко Вороньки',
                        data: []
                    }, {
                        name: 'м-ко Городище',
                        data: []
                    }, {
                        name: 'с. Загребелье',
                        data: []
                    }, {
                        name: 'с. Мелехи',
                        data: []
                    }, {
                        name: 'с. Поставмуки',
                        data: []
                    }, {
                        name: 'д. Потерюхи',
                        data: []
                    }, {
                        name: 'д. Слободка',
                        data: []
                    }
                ]
            },
            {
                name: 'Гнединская волость',
                data: [
                    {
                        name: 'м-ко Варна',
                        data: []
                    }, {
                        name: 'с. Гнединцы',
                        data: []
                    }, {
                        name: 'с. Остановка',
                        data: []
                    }, {
                        name: 'с. Светличное',
                        data: []
                    }, {
                        name: 'хут. Хортица',
                        data: []
                    }
                ]
            },
            {
                name: 'Ивахникская волость',
                data: [
                    {
                        name: 'с. Бербеницы',
                        data: []
                    }, {
                        name: 'с. Жабки',
                        data: []
                    }, {
                        name: 'с. Ивахники',
                        data: []
                    }, {
                        name: 'с. Новые Жабки',
                        data: []
                    }, {
                        name: 'д. Шмигли',
                        data: []
                    }
                ]
            },
            {
                name: 'Лохвицкая волость',
                data: [
                    {
                        name: 'с. Безсалы',
                        data: []
                    }, {
                        name: 'с. Васильки',
                        data: []
                    }, {
                        name: 'д. Венеславы',
                        data: []
                    }, {
                        name: 'с. Западинцы',
                        data: []
                    }, {
                        name: 'с. Млины',
                        data: []
                    }, {
                        name: 'с. Риги',
                        data: []
                    }, {
                        name: 'с. Скоробагатьки',
                        data: []
                    }, {
                        name: 'с. Харьковцы',
                        data: []
                    }, {
                        name: 'д. Христавовка',
                        data: []
                    }
                ]
            },
            {
                name: 'Лукская волость',
                data: [
                    {
                        name: 'с. Брыси',
                        data: []
                    }, {
                        name: 'с. Белогорелка',
                        data: []
                    }, {
                        name: 'с. Гирявые Исковцы',
                        data: []
                    }, {
                        name: 'с. Лука',
                        data: []
                    }, {
                        name: 'с. Ячники',
                        data: []
                    }
                ]
            },
            {
                name: 'Мокиевская волость',
                data: [
                    {
                        name: 'с. Бубны',
                        data: []
                    }, {
                        name: 'м-ко Куринька',
                        data: []
                    }, {
                        name: 'с. Луговики',
                        data: []
                    }, {
                        name: 'с. Мокиевка',
                        data: []
                    }, {
                        name: 'д. Нетратовка',
                        data: []
                    }, {
                        name: 'с. Пески',
                        data: []
                    }, {
                        name: 'д. Скибинцы',
                        data: []
                    }
                ]
            },
            {
                name: 'Озерянская волость',
                data: [
                    {
                        name: 'с. Брагинцы',
                        data: []
                    }, {
                        name: 'д. Калиновица',
                        data: []
                    }, {
                        name: 'д. Макушица',
                        data: []
                    }, {
                        name: 'д. Мормизовка',
                        data: []
                    }, {
                        name: 'с. Озеряне',
                        data: []
                    }
                ]
            },
            {
                name: 'Песковская волость',
                data: [
                    {
                        name: 'с. Бодаква',
                        data: []
                    }, {
                        name: 'с. Гамалеевка',
                        data: []
                    }, {
                        name: 'с. Пески',
                        data: []
                    }, {
                        name: 'д. Татарине',
                        data: []
                    }, {
                        name: 'с. Токари',
                        data: []
                    }, {
                        name: 'д. Хрули',
                        data: []
                    }
                ]
            },
            {
                name: 'Свиридовская волость',
                data: [
                    {
                        name: 'с. Голенка',
                        data: []
                    }, {
                        name: 'с. Новая Гребля',
                        data: []
                    }, {
                        name: 'с. Свиридовка',
                        data: []
                    }, {
                        name: 'с. Степуки',
                        data: []
                    }, {
                        name: 'с. Ярошевка',
                        data: []
                    }
                ]
            },
            {
                name: 'Сенчанская волость',
                data: [
                    {
                        name: 'с. Засулье',
                        data: []
                    }, {
                        name: 'д. Кононовка',
                        data: []
                    }, {
                        name: 'с. Ломаки',
                        data: []
                    }, {
                        name: 'с. Лучки',
                        data: []
                    }, {
                        name: 'м-ко Сенча',
                        data: []
                    }, {
                        name: 'с. Хитцы',
                        data: []
                    }, {
                        name: 'д. Часниковка',
                        data: []
                    }
                ]
            },
            {
                name: 'Чернухская волость',
                data: [
                    {
                        name: 'с. Ковали',
                        data: []
                    }, {
                        name: 'с. Козловка',
                        data: []
                    }, {
                        name: 'с. Нехристовка',
                        data: []
                    }, {
                        name: 'с. Позники',
                        data: []
                    }, {
                        name: 'с. Сухоносовка',
                        data: []
                    }, {
                        name: 'с. Харсики',
                        data: []
                    }, {
                        name: 'м-ко Чернухи',
                        data: []
                    }
                ]
            },
            {
                name: 'Юсковская волость',
                data: [
                    {
                        name: 'с. Гопановка',
                        data: []
                    }, {
                        name: 'с. Жданы',
                        data: []
                    }, {
                        name: 'с. Окоп',
                        data: []
                    }, {
                        name: 'с. Скоробогатьки',
                        data: []
                    }, {
                        name: 'с. Юсковцы',
                        data: []
                    }
                ]}]
            },
            {
                name: "Лубенский уезд",
                data: [
                    {
                        name: 'г. Лубны',
                        data: []
                    },
                    {
                        name: 'Велико-Селецкая волость',
                        data: [
                            {
                                name: 'с. Великая Селецкая',
                                data: []
                            }, {
                                name: 'м-ко Лукомье',
                                data: []
                            }, {
                                name: 'д. Низший Иржавец',
                                data: []
                            }, {
                                name: 'с. Чирковка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Волчковская волость',
                        data: [
                            {
                                name: 'с. Березоточа',
                                data: []
                            }, {
                                name: 'с. Волчек',
                                data: []
                            }, {
                                name: 'д. Кремянка',
                                data: []
                            }, {
                                name: 'с. Литвяки',
                                data: []
                            }, {
                                name: 'д. Ореховщина',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Денисовкая волость',
                        data: [
                            {
                                name: 'с. Денисовка',
                                data: []
                            }, {
                                name: 'с. Золотухи',
                                data: []
                            }, {
                                name: 'с. Круподеринцы',
                                data: []
                            }, {
                                name: 'с. Савинцы',
                                data: []
                            }, {
                                name: 'с. Чевельча',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Засульская волость',
                        data: [
                            {
                                name: 'с. Ерковцы',
                                data: []
                            }, {
                                name: 'с. Засулье',
                                data: []
                            }, {
                                name: 'с. Пески',
                                data: []
                            }, {
                                name: 'с. Солоница',
                                data: []
                            }, {
                                name: 'с. Шершневка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Лазорская волость',
                        data: [
                            {
                                name: 'д. Александровка',
                                data: []
                            }, {
                                name: 'д. Богодаровка',
                                data: []
                            }, {
                                name: 'с. Воронинцы',
                                data: []
                            }, {
                                name: 'д. Загребелье',
                                data: []
                            }, {
                                name: 'д. Карпиловка',
                                data: []
                            }, {
                                name: 'с. Лазорки',
                                data: []
                            }, {
                                name: 'с-цо Павловское',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Лубенская волость',
                        data: [
                            {
                                name: 'с. Александровка',
                                data: []
                            }, {
                                name: 'с. Высший Булатец',
                                data: []
                            }, {
                                name: 'с. Вязовка',
                                data: []
                            }, {
                                name: 'с. Клепачи',
                                data: []
                            }, {
                                name: 'с. Кононовка',
                                data: []
                            }, {
                                name: 'д. Круглик',
                                data: []
                            }, {
                                name: 'д. Мацковая Лучка',
                                data: []
                            }, {
                                name: 'с. Мацковцы',
                                data: []
                            }, {
                                name: 'с. Мгарь',
                                data: []
                            }, {
                                name: 'с. Михновцы',
                                data: []
                            }, {
                                name: 'с. Низший Булатец',
                                data: []
                            }, {
                                name: 'д. Новая Александровка',
                                data: []
                            }, {
                                name: 'с. Ольшанка',
                                data: []
                            }, {
                                name: 'д. Осовцы',
                                data: []
                            }, {
                                name: 'с. Остаповка',
                                data: []
                            }, {
                                name: 'д. Терны',
                                data: []
                            }, {
                                name: 'д. Чудновцы',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Оржицкая волость',
                        data: [
                            {
                                name: 'с. Вершино-Иржавец',
                                data: []
                            }, {
                                name: 'с. Зарог',
                                data: []
                            }, {
                                name: 'д. Ново-Александровка',
                                data: []
                            }, {
                                name: 'с. Новый Иржавец',
                                data: []
                            }, {
                                name: 'с. Опушки',
                                data: []
                            }, {
                                name: 'м-ко Оржица',
                                data: []
                            }, {
                                name: 'с. Остаповка',
                                data: []
                            }, {
                                name: 'с. Плехово',
                                data: []
                            }, {
                                name: 'с. Старый Иржавец',
                                data: []
                            }, {
                                name: 'с. Чутовка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Снетинская волость',
                        data: [
                            {
                                name: 'м-ко Снетин',
                                data: []
                            }, {
                                name: 'с. Хорошо',
                                data: []
                            }, {
                                name: 'д. Шеки',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Тарандинцевская волость',
                        data: [
                            {
                                name: 'с. Биевцы',
                                data: []
                            }, {
                                name: 'с. Гонцы',
                                data: []
                            }, {
                                name: 'с. Губское',
                                data: []
                            }, {
                                name: 'с. Духовое',
                                data: []
                            }, {
                                name: 'с. Енковцы',
                                data: []
                            }, {
                                name: 'с. Колойдинцы',
                                data: []
                            }, {
                                name: 'с. Новаки',
                                data: []
                            }, {
                                name: 'с. Оробьи',
                                data: []
                            }, {
                                name: 'с. Тарандинцы',
                                data: []
                            }, {
                                name: 'с. Хелепцы',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Тишковская волость',
                        data: [
                            {
                                name: 'д. Гребище',
                                data: []
                            }, {
                                name: 'с. Исачки',
                                data: []
                            }, {
                                name: 'с. Козубовка',
                                data: []
                            }, {
                                name: 'с. Крутой Берег',
                                data: []
                            }, {
                                name: 'с. Лука',
                                data: []
                            }, {
                                name: 'д. Лучники',
                                data: []
                            }, {
                                name: 'с. Тишки',
                                data: []
                            }, {
                                name: 'с. Хитцы',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Черевковская волость',
                        data: [
                            {
                                name: 'с. Пулинцы',
                                data: []
                            }, {
                                name: 'д. Пятигорцы',
                                data: []
                            }, {
                                name: 'с. Хорошки',
                                data: []
                            }, {
                                name: 'с. Черевки',
                                data: []
                            }, {
                                name: 'с. Юсковцы',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Яблоновская волость',
                        data: [
                            {
                                name: 'д. Александровка',
                                data: []
                            }, {
                                name: 'д. Высокий Горб',
                                data: []
                            }, {
                                name: 'д. Загребелье',
                                data: []
                            }, {
                                name: 'с. Овсюки',
                                data: []
                            }, {
                                name: 'с. Перервинцы',
                                data: []
                            }, {
                                name: 'с. Рудка',
                                data: []
                            }, {
                                name: 'с. Стукаловка',
                                data: []
                            }, {
                                name: 'с. Тишки',
                                data: []
                            }, {
                                name: 'с. Филипповичи',
                                data: []
                            }, {
                                name: 'м-ко Яблоново',
                                data: []
                            }
                        ]
                    }
                ]
            },
            {
                name: "Миргородский уезд",
                data: [
                    {
                        name: 'г. Миргород',
                        data: []
            },
            {
                name: 'Барановская волость',
                data: [
                    {
                        name: 'с. Барановка',
                        data: []
                    }, {
                        name: 'с. Великий Перевоз',
                        data: []
                    }, {
                        name: 'д. Малый Перевоз',
                        data: []
                    }, {
                        name: 'с. Портянки',
                        data: []
                    }
                ]
            },
            {
                name: 'Березоволукская волость',
                data: [
                    {
                        name: 'м-ко Березовая Лука',
                        data: []
                    }, {
                        name: 'с. Остановка',
                        data: []
                    }
                ]
            },
            {
                name: 'Богачанская волость',
                data: [
                    {
                        name: 'с. Байрак',
                        data: []
                    }, {
                        name: 'м-ко Богачка',
                        data: []
                    }, {
                        name: 'с. Малая Решетиловка',
                        data: []
                    }, {
                        name: 'с. Николаевка',
                        data: []
                    }, {
                        name: 'с. Стефановщина',
                        data: []
                    }
                ]
            },
            {
                name: 'Зубовская волость',
                data: [
                    {
                        name: 'с. Белики',
                        data: []
                    }, {
                        name: 'с. Зубовка',
                        data: []
                    }, {
                        name: 'с. Малые Сорочинцы',
                        data: []
                    }, {
                        name: 'д. Поганцы',
                        data: []
                    }
                ]
            },
            {
                name: 'Зуевская волость',
                data: [
                    {
                        name: 'с. Зуевцы',
                        data: []
                    }, {
                        name: 'с. Черевки',
                        data: []
                    }
                ]
            },
            {
                name: 'Кибинская волость',
                data: [
                    {
                        name: 'с. Ерки',
                        data: []
                    }, {
                        name: 'с. Кибинцы',
                        data: []
                    }, {
                        name: 'посад, дер. и ст. Ромодан',
                        data: []
                    }, {
                        name: 'с. Шарковщина',
                        data: []
                    }, {
                        name: 'с. Ярмаки',
                        data: []
                    }
                ]
            },
            {
                name: 'Комышанская волость',
                data: [
                    {
                        name: 'м-ко Комышня',
                        data: []
                    }, {
                        name: 'с. Корсуновая Слободка',
                        data: []
                    }
                ]
            },
            {
                name: 'Миргородская волость',
                data: [
                    {
                        name: 'д. Дубровка',
                        data: []
                    }, {
                        name: 'д. Любовшина',
                        data: []
                    }, {
                        name: 'с. Шафоростовка',
                        data: []
                    }
                ]
            },
            {
                name: 'Петровская волость',
                data: [
                    {
                        name: 'с. Горкушенцы',
                        data: []
                    }, {
                        name: 'хут. Мальцы',
                        data: []
                    }, {
                        name: 'с. Петровцы',
                        data: []
                    }, {
                        name: 'д. Скибовщина',
                        data: []
                    }, {
                        name: 'м-ко Слободка',
                        data: []
                    }
                ]
            },
            {
                name: 'Поповская волость',
                data: [
                    {
                        name: 'с. Александро-Николаевка',
                        data: []
                    }, {
                        name: 'с. Гремяча',
                        data: []
                    }, {
                        name: 'д. Малая Гремячка',
                        data: []
                    }, {
                        name: 'м-ко Поповка',
                        data: []
                    }, {
                        name: 'д. Трегубовка',
                        data: []
                    }, {
                        name: 'хут. Черкащенков',
                        data: []
                    }
                ]
            },
            {
                name: 'Савинская волость',
                data: [
                    {
                        name: 'с. Великая Обуховка',
                        data: []
                    }, {
                        name: 'д. Малая Обуховка',
                        data: []
                    }, {
                        name: 'с. Олефировка',
                        data: []
                    }, {
                        name: 'с. Панасовка',
                        data: []
                    }, {
                        name: 'с. Савинцы',
                        data: []
                    }, {
                        name: 'д. Сакаловка',
                        data: []
                    }, {
                        name: 'д. Семереньки',
                        data: []
                    }
                ]
            },
            {
                name: 'Сорочинская волость',
                data: [
                    {
                        name: 'м-ко Сорочинцы',
                        data: []
                    }
                ]
            },
            {
                name: 'Устивицкая волость',
                data: [
                    {
                        name: 'посад Гоголево',
                        data: []
                    }, {
                        name: 'д. Злодеевка',
                        data: []
                    }, {
                        name: 'д. Марьинская',
                        data: []
                    }, {
                        name: 'д. Михайловка',
                        data: []
                    }, {
                        name: 'м-ко Устивица',
                        data: []
                    }, {
                        name: 'хут. Широкая Долина',
                        data: []
                    }
                ]
            },
            {
                name: 'Хомутецкая волость',
                data: [
                    {
                        name: 'с. Бакумовка',
                        data: []
                    }, {
                        name: 'с. Довгалевка',
                        data: []
                    }, {
                        name: 'м-ко Хомутец',
                        data: []
                    }
                ]
            },
            {
                name: 'Шишакская волость',
                data: [
                    {
                        name: 'д. Богдановка',
                        data: []
                    }, {
                        name: 'с. Грузкая Говтва',
                        data: []
                    }, {
                        name: 'д. Матвеевка',
                        data: []
                    }, {
                        name: 'д. Пелагеевка',
                        data: []
                    }, {
                        name: 'с. Пришиб',
                        data: []
                    }, {
                        name: 'д. Толстое',
                        data: []
                    }, {
                        name: 'д. Федоровка',
                        data: []
                    }, {
                        name: 'д. Фошевое',
                        data: []
                    }, {
                        name: 'д. Чернышевка',
                        data: []
                    }, {
                        name: 'с. Шафрановка',
                        data: []
                    }, {
                        name: 'м-ко Шишаки',
                        data: []
                    }
                ]
            },
            {
                name: 'Яреськовская волость',
                data: [
                    {
                        name: 'д. Андреевка',
                        data: []
                    }, {
                        name: 'д. Григорьевка',
                        data: []
                    }, {
                        name: 'д. Жабокрики',
                        data: []
                    }, {
                        name: 'с. Матяшевка',
                        data: []
                    }, {
                        name: 'д. Молодыковщина',
                        data: []
                    }, {
                        name: 'пос. Сагайдак',
                        data: []
                    }, {
                        name: 'д. Тух',
                        data: []
                    }, {
                        name: 'д. Фальки',
                        data: []
                    }, {
                        name: 'с. Федунка',
                        data: []
                    }, {
                        name: 'м-ко Яреськи',
                        data: []
                    }
                ]}]
            },
            {
                name: "Переяславский уезд",
                data: [
                    {
                        name: 'г. Переяслав',
                        data: []
                    },
                    {
                        name: 'Барышевская волость',
                        data: [
                            {
                                name: 'м-ко Барышевка',
                                data: []
                            }, {
                                name: 'с. Вел.-Старица',
                                data: []
                            }, {
                                name: 'д. Власовка',
                                data: []
                            }, {
                                name: 'д. Дерновка',
                                data: []
                            }, {
                                name: 'д. Коржи',
                                data: []
                            }, {
                                name: 'предместье Липнявки',
                                data: []
                            }, {
                                name: 'с. Мал.-Старица',
                                data: []
                            }, {
                                name: 'д. Морозовка',
                                data: []
                            }, {
                                name: 'с. Остролучье',
                                data: []
                            }, {
                                name: 'предм. Пасечная',
                                data: []
                            }, {
                                name: 'с. Селище',
                                data: []
                            }, {
                                name: 'с. Селичевка',
                                data: []
                            }, {
                                name: 'с. Сулимовка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Березанская волость',
                        data: [
                            {
                                name: 'д. Бакумовка',
                                data: []
                            }, {
                                name: 'м-ко Березань',
                                data: []
                            }, {
                                name: 'хут. Заостровский',
                                data: []
                            }, {
                                name: 'д. Лелячки',
                                data: []
                            }, {
                                name: 'с. Паришков',
                                data: []
                            }, {
                                name: 'с. Семеновка',
                                data: []
                            }, {
                                name: 'хут. Хмелевик',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Бориспольская волость',
                        data: [
                            {
                                name: 'хут. Аполоновка',
                                data: []
                            }, {
                                name: 'м-ко Борисполь',
                                data: []
                            }, {
                                name: 'хут. Гора',
                                data: []
                            }, {
                                name: 'хут. Оробьевка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Вороньковская волость',
                        data: [
                            {
                                name: 'м-ко Вороньков',
                                data: []
                            }, {
                                name: 'д. Жеребятин',
                                data: []
                            }, {
                                name: 'с. Койлов',
                                data: []
                            }, {
                                name: 'д. Мартусовка',
                                data: []
                            }, {
                                name: 'д. Процев',
                                data: []
                            }, {
                                name: 'хут. Ревный',
                                data: []
                            }, {
                                name: 'с. Рудяков',
                                data: []
                            }, {
                                name: 'с. Сальков',
                                data: []
                            }, {
                                name: 'д. Софиевка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Войтовская волость',
                        data: [
                            {
                                name: 'м-ко Вел.-Круполь',
                                data: []
                            }, {
                                name: 'с. Войтово',
                                data: []
                            }, {
                                name: 'хут. Дегтярев',
                                data: []
                            }, {
                                name: 'с. Лукаши',
                                data: []
                            }, {
                                name: 'с. Лукьяновка',
                                data: []
                            }, {
                                name: 'д. Малый Круполь',
                                data: []
                            }, {
                                name: 'с. Рудницкое',
                                data: []
                            }, {
                                name: 'д. Софиевка',
                                data: []
                            }, {
                                name: 'с. Усовка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Демянская волость',
                        data: [
                            {
                                name: 'д. Борисовка',
                                data: []
                            }, {
                                name: 'с. Волчков',
                                data: []
                            }, {
                                name: 'с. Гайшин',
                                data: []
                            }, {
                                name: 'с. Гланишев',
                                data: []
                            }, {
                                name: 'д. Глебовка',
                                data: []
                            }, {
                                name: 'д. Гречаники',
                                data: []
                            }, {
                                name: 'с. Демянцы',
                                data: []
                            }, {
                                name: 'с. Пристромы',
                                data: []
                            }, {
                                name: 'с. Столпяги',
                                data: []
                            }, {
                                name: 'с. Харьковцы',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Ерковецкая волость',
                        data: [
                            {
                                name: 'с. Гусинцы',
                                data: []
                            }, {
                                name: 'с. Девички',
                                data: []
                            }, {
                                name: 'с. Ерковцы',
                                data: []
                            }, {
                                name: 'с. Кальное',
                                data: []
                            }, {
                                name: 'с. Ковалин',
                                data: []
                            }, {
                                name: 'с. Подсенное',
                                data: []
                            }, {
                                name: 'с. Сошников',
                                data: []
                            }, {
                                name: 'д. Староселье',
                                data: []
                            }, {
                                name: 'с. Ячники',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Иваньковская волость',
                        data: [
                            {
                                name: 'с. Иваньков',
                                data: []
                            }, {
                                name: 'д. Кучаков',
                                data: []
                            }, {
                                name: 'д. Лебедин',
                                data: []
                            }, {
                                name: 'с. Сеньковка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Лехновская волость',
                        data: [
                            {
                                name: 'с. Корнеевка',
                                data: []
                            }, {
                                name: 'с. Лехновка',
                                data: []
                            }, {
                                name: 'с. Мал.-Березанка',
                                data: []
                            }, {
                                name: 'с. Недра',
                                data: []
                            }, {
                                name: 'с. Пилипчичи',
                                data: []
                            }, {
                                name: 'с. Покровское',
                                data: []
                            }, {
                                name: 'с. Черевки',
                                data: []
                            }, {
                                name: 'с. Ярешки',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Переяславская волость',
                        data: [
                            {
                                name: 'с. Андруши',
                                data: []
                            }, {
                                name: 'с. Вел.-Каратуль',
                                data: []
                            }, {
                                name: 'с. Воскресенское',
                                data: []
                            }, {
                                name: 'с. Вьюнище',
                                data: []
                            }, {
                                name: 'д. Городище',
                                data: []
                            }, {
                                name: 'д. Карань',
                                data: []
                            }, {
                                name: 'с. Козинцы',
                                data: []
                            }, {
                                name: 'с. Мал.-Каратуль',
                                data: []
                            }, {
                                name: 'с. Чирское',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Помокельская волость',
                        data: [
                            {
                                name: 'с. Выползки',
                                data: []
                            }, {
                                name: 'с. Денисы',
                                data: []
                            }, {
                                name: 'с. Помокли',
                                data: []
                            }, {
                                name: 'с. Сосново',
                                data: []
                            }, {
                                name: 'с. Строково',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Рогозовская волость',
                        data: [
                            {
                                name: 'хут. Александровка',
                                data: []
                            }, {
                                name: 'хут. Бурбуна',
                                data: []
                            }, {
                                name: 'с. Глубокое',
                                data: []
                            }, {
                                name: 'с. Любарцы',
                                data: []
                            }, {
                                name: 'с. Рогозово',
                                data: []
                            }, {
                                name: 'с. Старое Краснополье',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Скопецкая волость',
                        data: [
                            {
                                name: 'с. Бзов',
                                data: []
                            }, {
                                name: 'с. Борщев',
                                data: []
                            }, {
                                name: 'д. Волошиновка',
                                data: []
                            }, {
                                name: 'с. Войтовцы',
                                data: []
                            }, {
                                name: 'хут. Грушки',
                                data: []
                            }, {
                                name: 'с. Мазинки',
                                data: []
                            }, {
                                name: 'с. Масковцы',
                                data: []
                            }, {
                                name: 'с. Скопцы',
                                data: []
                            }, {
                                name: 'хут. Устенкова Гребля',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Студениковская волость',
                        data: [
                            {
                                name: 'с. Козлов',
                                data: []
                            }, {
                                name: 'д. Кулябовка',
                                data: []
                            }, {
                                name: 'с. Панфилы',
                                data: []
                            }, {
                                name: 'ж/д ст. Переяслав',
                                data: []
                            }, {
                                name: 'с. Сомкова Долина',
                                data: []
                            }, {
                                name: 'с. Студеники',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Ташанская волость',
                        data: [
                            {
                                name: 'с. Горбани',
                                data: []
                            }, {
                                name: 'д. Нетягайловка',
                                data: []
                            }, {
                                name: 'с. Пологи Вертуны',
                                data: []
                            }, {
                                name: 'с. Пологи Чеботьки',
                                data: []
                            }, {
                                name: 'с. Положаи',
                                data: []
                            }, {
                                name: 'д. Ташань',
                                data: []
                            }, {
                                name: 'с. Ченилки',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Хоцковская волость',
                        data: [
                            {
                                name: 'с. Войницы',
                                data: []
                            }, {
                                name: 'с. Комаровка',
                                data: []
                            }, {
                                name: 'с. Лецки',
                                data: []
                            }, {
                                name: 'с. Пологи-Яненки',
                                data: []
                            }, {
                                name: 'с. Хоцки',
                                data: []
                            }, {
                                name: 'с. Цыбли',
                                data: []
                            }
                        ]
                    }
                ]
            },
            {
                name: "Пирятинский уезд",
                data: [
                    {
                        name: 'г. Пирятин',
                        data: []
            },
            {
                name: 'Антоновская волость',
                data: [
                    {
                        name: 'с. Антоновка',
                        data: []
                    }, {
                        name: 'с. Богданы',
                        data: []
                    }, {
                        name: 'м-ко Журавка',
                        data: []
                    }, {
                        name: 'д. Кулишовка',
                        data: []
                    }, {
                        name: 'с. Мокиевка',
                        data: []
                    }, {
                        name: 'с. Усовка',
                        data: []
                    }
                ]
            },
            {
                name: 'Городищенская волость',
                data: [
                    {
                        name: 'м-ко Городище',
                        data: []
                    }, {
                        name: 'ж/д ст. Гребенки',
                        data: []
                    }, {
                        name: 'д. Корнеевка',
                        data: []
                    }, {
                        name: 'с. Короваи',
                        data: []
                    }, {
                        name: 'с. Кулажинцы',
                        data: []
                    }, {
                        name: 'д. Лутайка',
                        data: []
                    }, {
                        name: 'с. Майорщина',
                        data: []
                    }, {
                        name: 'д. Марьяновка',
                        data: []
                    }, {
                        name: 'с. Мечет',
                        data: []
                    }, {
                        name: 'д. Михайловка',
                        data: []
                    }, {
                        name: 'д. Писарщина',
                        data: []
                    }, {
                        name: 'с-цо Покровщина',
                        data: []
                    }, {
                        name: 'д. Слобода-Петровка',
                        data: []
                    }, {
                        name: 'д. Убежище',
                        data: []
                    }, {
                        name: 'д. Чепурковка',
                        data: []
                    }
                ]
            },
            {
                name: 'Жоравская волость',
                data: [
                    {
                        name: 'с. Годуновка',
                        data: []
                    }, {
                        name: 'д. Жоравка',
                        data: []
                    }, {
                        name: 'хут. Бакшевский',
                        data: []
                    }, {
                        name: 'с. Лемешовка',
                        data: []
                    }, {
                        name: 'с. Лозовый Яр',
                        data: []
                    }
                ]
            },
            {
                name: 'Кантанузовская волость',
                data: [
                    {
                        name: 'с. Голотоношка',
                        data: []
                    }, {
                        name: 'д. Каевка',
                        data: []
                    }, {
                        name: 'с. Кантакузовка',
                        data: []
                    }, {
                        name: 'д. Ковтуновка',
                        data: []
                    }, {
                        name: 'с. Коломийцы',
                        data: []
                    }, {
                        name: 'д. Кохновка',
                        data: []
                    }, {
                        name: 'д. Криштоповка',
                        data: []
                    }, {
                        name: 'с. Мойсевка',
                        data: []
                    }, {
                        name: 'д. Остаповка',
                        data: []
                    }, {
                        name: 'д. Потребы',
                        data: []
                    }, {
                        name: 'с. Свечковка',
                        data: []
                    }, {
                        name: 'д. Семеновка',
                        data: []
                    }, {
                        name: 'д. Степановка',
                        data: []
                    }
                ]
            },
            {
                name: 'Капустинская волость',
                data: [
                    {
                        name: 'с. Демки',
                        data: []
                    }, {
                        name: 'д. Добраничевка',
                        data: []
                    }, {
                        name: 'с. Капустинцы',
                        data: []
                    }, {
                        name: 'с. Нехайки',
                        data: []
                    }, {
                        name: 'д. Плужники',
                        data: []
                    }, {
                        name: 'с. Фарбоване',
                        data: []
                    }
                ]
            },
            {
                name: 'Ковалевская волость',
                data: [
                    {
                        name: 'с. Богодаровка',
                        data: []
                    }, {
                        name: 'с. Бырловка',
                        data: []
                    }, {
                        name: 'с. Ковалевка',
                        data: []
                    }, {
                        name: 'с. Кононовка',
                        data: []
                    }, {
                        name: 'д. Слобода Бырловка',
                        data: []
                    }
                ]
            },
            {
                name: 'Линовицкая волость',
                data: [
                    {
                        name: 'с. Линовица',
                        data: []
                    }, {
                        name: 'д. Лутайка',
                        data: []
                    }, {
                        name: 'с. Мамаевка',
                        data: 'Головатенко, Максимович, Махно'
                    }, {
                        name: 'д. Мокляки',
                        data: []
                    }, {
                        name: 'д. Новая Гребля',
                        data: []
                    }, {
                        name: 'с. Полонки',
                        data: 'Балаба, Базикало, Величко, Вовк, Гарященко, Гладкой, Головко, \n' +
                            'Гришко, Дегтяр, Дредун, Еременко, Карпуша, Коваль, Курило, Лещак, \n' +
                            'Ляшенко, Паволоцкий, Пастух, Радионов, Радченко, Сахно, Сипко, \n' +
                            'Сташевский, Супрун, Терницкий, Ужва, Фененко, Хижняк, Хитрик, Яременко'
                    }
                ]
            },
            {
                name: 'Пирятинская волость',
                data: [
                    {
                        name: 'д. Богодаровка',
                        data: []
                    }, {
                        name: 'с. Великая Круча',
                        data: []
                    }, {
                        name: 'с. Заречье',
                        data: []
                    }, {
                        name: 'д. Малая Круча',
                        data: []
                    }, {
                        name: 'д. Максимовка',
                        data: []
                    }, {
                        name: 'д. Михайловка',
                        data: []
                    }, {
                        name: 'с. Повстин',
                        data: []
                    }, {
                        name: 'д. Сотниковка',
                        data: []
                    }, {
                        name: 'д. Сторожевка',
                        data: []
                    }, {
                        name: 'д. Щербаковка',
                        data: []
                    }
                ]
            },
            {
                name: 'Поповская волость',
                data: [
                    {
                        name: 'д. Ганзеровщина',
                        data: []
                    }, {
                        name: 'д. Гречная Гребля',
                        data: []
                    }, {
                        name: 'с. Лизогубовская Слободка',
                        data: []
                    }, {
                        name: 'хут. Оржицко-Безбородовский',
                        data: []
                    }, {
                        name: 'д. Пайки',
                        data: []
                    }, {
                        name: 'с. Поповка',
                        data: []
                    }
                ]
            },
            {
                name: 'Сасиновская волость',
                data: [
                    {
                        name: 'с. Бубновщина',
                        data: []
                    }, {
                        name: 'с. Вечорки',
                        data: []
                    }, {
                        name: 'с. Грабаровка',
                        data: []
                    }, {
                        name: 'с. Гурбинцы',
                        data: []
                    }, {
                        name: 'с. Давидовка',
                        data: []
                    }, {
                        name: 'с. Кейбаловка',
                        data: []
                    }, {
                        name: 'с. Кроты',
                        data: []
                    }, {
                        name: 'д. Леляки',
                        data: []
                    }, {
                        name: 'с. Митченки',
                        data: []
                    }, {
                        name: 'хут. Россошь',
                        data: []
                    }, {
                        name: 'с. Расиновка',
                        data: []
                    }
                ]
            },
            {
                name: 'Тепловская волость',
                data: [
                    {
                        name: 'с. Алексеевка',
                        data: []
                    }, {
                        name: 'с. Березовая Рудка',
                        data: []
                    }, {
                        name: 'с. Крячковка',
                        data: []
                    }, {
                        name: 'с. Малютинцы',
                        data: []
                    }, {
                        name: 'д. Наталовка',
                        data: []
                    }, {
                        name: 'д. Смотрики',
                        data: []
                    }, {
                        name: 'д. Сурмачевка',
                        data: []
                    }, {
                        name: 'м-ко Тепловка',
                        data: []
                    }
                ]
            },
            {
                name: 'Харьковецкая волость',
                data: [
                    {
                        name: 'с. Деймановка',
                        data: []
                    }, {
                        name: 'с. Каплинцы',
                        data: []
                    }, {
                        name: 'с. Приходьки',
                        data: []
                    }, {
                        name: 'с. Харьковцы',
                        data: []
                    }, {
                        name: 'д. Шкураты',
                        data: []
                    }
                ]
            },
            {
                name: 'Черняховская волость',
                data: [
                    {
                        name: 'д. Богдановка',
                        data: []
                    }, {
                        name: 'хут. Коптевический',
                        data: []
                    }, {
                        name: 'с. Нечипоровка',
                        data: []
                    }, {
                        name: 'хут. Трубовщина',
                        data: []
                    }, {
                        name: 'с. Черняховка',
                        data: []
                    }
                ]
            },
            {
                name: 'Яблоновская волость',
                data: [
                    {
                        name: 'с. Белошпаки',
                        data: []
                    }, {
                        name: 'с. Ковтуновка',
                        data: []
                    }, {
                        name: 'с. Крутояровка',
                        data: []
                    }, {
                        name: 'с. Сергеевка',
                        data: []
                    }, {
                        name: 'с. Яблоновка',
                        data: []
                    }
                ]
            },
            {
                name: 'Яготинская волость',
                data: [
                    {
                        name: 'д. Безугловка',
                        data: []
                    }, {
                        name: 'с. Войтовцы',
                        data: []
                    }, {
                        name: 'с. Лесняки',
                        data: []
                    }, {
                        name: 'с. Сытниковка',
                        data: []
                    }, {
                        name: 'с. Тамаровка',
                        data: []
                    }, {
                        name: 'м-ко Яготин',
                        data: []
                    }
                ]}]
            },
            {
                name: "Полтавский уезд",
                data: [
                    {
                        name: 'г. Полтава',
                        data: []
            },
            {
                name: 'Балясновская волость',
                data: [
                    {
                        name: 'с. Андреевка',
                        data: []
                    }, {
                        name: 'с. Балясное',
                        data: []
                    }, {
                        name: 'д. Воронянщина',
                        data: []
                    }, {
                        name: 'д. Дейнековка',
                        data: []
                    }, {
                        name: 'д. Кокозовка',
                        data: []
                    }, {
                        name: 'д. Нелюбовка',
                        data: []
                    }
                ]
            },
            {
                name: 'Байракская волость',
                data: [
                    {
                        name: 'с. Байрак',
                        data: []
                    }, {
                        name: 'с. Великая Рудка',
                        data: []
                    }, {
                        name: 'д. Каплуновка',
                        data: []
                    }, {
                        name: 'д. Кокозовка',
                        data: []
                    }, {
                        name: 'д. Малая Рудка',
                        data: []
                    }, {
                        name: 'д. Степановка',
                        data: []
                    }, {
                        name: 'д. Черноглазовка',
                        data: []
                    }
                ]
            },
            {
                name: 'Братешковская волость',
                data: [
                    {
                        name: 'д. Бакай-Игнатовка',
                        data: []
                    }, {
                        name: 'хут. Братешки (Погребняки)',
                        data: []
                    }, {
                        name: 'хут. Бардаков',
                        data: []
                    }, {
                        name: 'пос. Белокони',
                        data: []
                    }, {
                        name: 'пос. Кобы',
                        data: []
                    }, {
                        name: 'д. Потеряйки',
                        data: []
                    }, {
                        name: 'пос. Призы',
                        data: []
                    }, {
                        name: 'д. Пселовка',
                        data: []
                    }, {
                        name: 'д. Раздолье',
                        data: []
                    }, {
                        name: 'пос. Райды',
                        data: []
                    }, {
                        name: 'пос. Серидевщина',
                        data: []
                    }, {
                        name: 'пос. Тривайлы',
                        data: []
                    }
                ]
            },
            {
                name: 'Васильевская волость',
                data: [
                    {
                        name: 'д. Александровка',
                        data: []
                    }, {
                        name: 'с. Васильевка',
                        data: []
                    }, {
                        name: 'д. Вольховщина',
                        data: []
                    }, {
                        name: 'д. Войновка',
                        data: []
                    }, {
                        name: 'д. Гарнещина',
                        data: []
                    }, {
                        name: 'д. Григорьевка (Горовая и Низовая)',
                        data: []
                    }, {
                        name: 'д. Жуковка',
                        data: []
                    }, {
                        name: 'д. Зеленьковка',
                        data: []
                    }, {
                        name: 'д. Клименковка',
                        data: []
                    }, {
                        name: 'д. Мартыновка',
                        data: []
                    }, {
                        name: 'д. Нечитайловка',
                        data: []
                    }, {
                        name: 'д. Николаевка',
                        data: []
                    }, {
                        name: 'д. Новоселовка',
                        data: []
                    }, {
                        name: 'д. Осиновка',
                        data: []
                    }, {
                        name: 'с. Парасковеевка',
                        data: []
                    }, {
                        name: 'д. Петрашевка',
                        data: []
                    }, {
                        name: 'д. Петропавловка',
                        data: []
                    }, {
                        name: 'д. Писаревщина',
                        data: []
                    }, {
                        name: 'д. Самойловка',
                        data: []
                    }, {
                        name: 'д. Степановка',
                        data: []
                    }, {
                        name: 'с. Сторожевое',
                        data: []
                    }, {
                        name: 'д. Федорощина',
                        data: []
                    }, {
                        name: 'д. Фириньковка',
                        data: []
                    }, {
                        name: 'с. Черкасовка',
                        data: []
                    }, {
                        name: 'д. Шатунова',
                        data: []
                    }
                ]
            },
            {
                name: 'Васильцовская волость',
                data: [
                    {
                        name: 'д. Александровка',
                        data: []
                    }, {
                        name: 'д. Боровая',
                        data: []
                    }, {
                        name: 'с. Марьевка',
                        data: []
                    }, {
                        name: 'д. Матвеевка',
                        data: []
                    }, {
                        name: 'с. Милорадово',
                        data: []
                    }, {
                        name: 'д. Михайловка',
                        data: []
                    }, {
                        name: 'д. Никольское',
                        data: []
                    }, {
                        name: 'д. Ступки',
                        data: []
                    }, {
                        name: 'д. Федоро-Александровка',
                        data: []
                    }, {
                        name: 'д. Яцунова Слободка',
                        data: []
                    }
                ]
            },
            {
                name: 'Демидовская волость',
                data: [
                    {
                        name: 'д. Андреевка',
                        data: []
                    }, {
                        name: 'д. Гричановка',
                        data: []
                    }, {
                        name: 'с. Демидовка',
                        data: []
                    }, {
                        name: 'д. Житковка',
                        data: []
                    }, {
                        name: 'д. Ивановка',
                        data: []
                    }, {
                        name: 'д. Келебердовка',
                        data: []
                    }, {
                        name: 'д. Коломак',
                        data: []
                    }, {
                        name: 'д. Поповка',
                        data: []
                    }, {
                        name: 'д. Стенка (Чернещина)',
                        data: []
                    }
                ]
            },
            {
                name: 'Диканьская волость',
                data: [
                    {
                        name: 'с. Брусия',
                        data: []
                    }, {
                        name: 'д. Васильевка',
                        data: []
                    }, {
                        name: 'с. Гавронцы',
                        data: []
                    }, {
                        name: 'хут. Голтва',
                        data: []
                    }, {
                        name: 'с. Диканька',
                        data: []
                    }, {
                        name: 'с. Камянка',
                        data: []
                    }, {
                        name: 'д. Марченково',
                        data: []
                    }, {
                        name: 'д. Михайловка',
                        data: []
                    }, {
                        name: 'хут. Нелюбовка',
                        data: []
                    }, {
                        name: 'хут. Прони',
                        data: []
                    }, {
                        name: 'с. Стаси',
                        data: []
                    }, {
                        name: 'д. Судиевка',
                        data: []
                    }, {
                        name: 'д. Федоровка',
                        data: []
                    }
                ]
            },
            {
                name: 'Елизаветинская волость',
                data: [
                    {
                        name: 'д. Андреевка',
                        data: []
                    }, {
                        name: 'д. Бугаевка',
                        data: []
                    }, {
                        name: 'д. Войтовка',
                        data: []
                    }, {
                        name: 'д. Гвоздиковка',
                        data: []
                    }, {
                        name: 'д. Дедова-долина',
                        data: []
                    }, {
                        name: 'с. Елизаветино',
                        data: []
                    }, {
                        name: 'д. Кованьковка',
                        data: []
                    }, {
                        name: 'д. Николаевка',
                        data: []
                    }, {
                        name: 'д. Паськовка',
                        data: []
                    }, {
                        name: 'д. Прокофьевка',
                        data: []
                    }, {
                        name: 'с. Федиевка',
                        data: []
                    }
                ]
            },
            {
                name: 'Мачехская волость',
                data: [
                    {
                        name: 'д. Барановка',
                        data: []
                    }, {
                        name: 'д. Буланово',
                        data: []
                    }, {
                        name: 'д. Высшая Ольшана',
                        data: []
                    }, {
                        name: 'д. Зачепиловка',
                        data: []
                    }, {
                        name: 'д. Кислая Балка',
                        data: []
                    }, {
                        name: 'д. Куклинцы',
                        data: []
                    }, {
                        name: 'м-ко Мачехи',
                        data: []
                    }, {
                        name: 'д. Низшая Ольшана',
                        data: []
                    }, {
                        name: 'д. Россошенцы',
                        data: []
                    }, {
                        name: 'д. Судьевка',
                        data: []
                    }
                ]
            },
            {
                name: 'Никольская волость',
                data: [
                    {
                        name: 'с. Головач',
                        data: []
                    }, {
                        name: 'д. Грабиновка (Макуховка)',
                        data: []
                    }, {
                        name: 'с. Локошина',
                        data: []
                    }, {
                        name: 'с. Никольское',
                        data: []
                    }
                ]
            },
            {
                name: 'Первозвановская волость',
                data: [
                    {
                        name: 'д. Андреевка',
                        data: []
                    }, {
                        name: 'д. Васьки',
                        data: []
                    }, {
                        name: 'д. Водяная',
                        data: []
                    }, {
                        name: 'д. Воздвиженка',
                        data: []
                    }, {
                        name: 'д. Гуляй-Поле',
                        data: []
                    }, {
                        name: 'д. Кантамировка',
                        data: []
                    }, {
                        name: 'ж/д ст. Кочубеевка',
                        data: []
                    }, {
                        name: 'с. Первозвановка',
                        data: []
                    }, {
                        name: 'д. Покровская',
                        data: []
                    }, {
                        name: 'д. Свинковка',
                        data: []
                    }, {
                        name: 'д. Сулимовка',
                        data: []
                    }, {
                        name: 'д. Трудолюбовка',
                        data: []
                    }, {
                        name: 'с. Флоровка',
                        data: []
                    }
                ]
            },
            {
                name: 'Песчанская волость',
                data: [
                    {
                        name: 'д. Анновка',
                        data: []
                    }, {
                        name: 'д. Браговка',
                        data: []
                    }, {
                        name: 'с. Васильевка',
                        data: []
                    }, {
                        name: 'д. Житниковка',
                        data: []
                    }, {
                        name: 'хут. Климковка',
                        data: []
                    }, {
                        name: 'д. Малодиковщина',
                        data: []
                    }, {
                        name: 'д. Надежда',
                        data: []
                    }, {
                        name: 'д. Ново-Михайловка',
                        data: []
                    }, {
                        name: 'с. Песчаное',
                        data: []
                    }, {
                        name: 'д. Славки',
                        data: []
                    }, {
                        name: 'хут. Токари',
                        data: []
                    }, {
                        name: 'хут. Хорольский',
                        data: []
                    }, {
                        name: 'хут. Шарлаевка',
                        data: []
                    }
                ]
            },
            {
                name: 'Площанская волость',
                data: [
                    {
                        name: 'д. Александровка',
                        data: []
                    }, {
                        name: 'д. Западновка',
                        data: []
                    }, {
                        name: 'с. Лиман',
                        data: []
                    }, {
                        name: 'д. Новиковка',
                        data: []
                    }, {
                        name: 'д. Петровка',
                        data: []
                    }, {
                        name: 'с. Плоское',
                        data: []
                    }
                ]
            },
            {
                name: 'Полтавская волость',
                data: [
                    {
                        name: 'д. Антоновка',
                        data: []
                    }, {
                        name: 'д. Берековка',
                        data: []
                    }, {
                        name: 'д. Гора',
                        data: []
                    }, {
                        name: 'с. Горбаневка',
                        data: []
                    }, {
                        name: 'д. Дальние Павленки',
                        data: []
                    }, {
                        name: 'д. Дублянщина',
                        data: []
                    }, {
                        name: 'д. Кривохатки',
                        data: []
                    }, {
                        name: 'д. Кулики',
                        data: []
                    }, {
                        name: 'с. Нижние Млины',
                        data: []
                    }, {
                        name: 'д. Огневка',
                        data: []
                    }, {
                        name: 'д. Рудка',
                        data: []
                    }, {
                        name: 'д. Тютюнники',
                        data: []
                    }, {
                        name: 'д. Шмиголи (Мороховцы)',
                        data: []
                    }, {
                        name: 'д. Щербани',
                        data: []
                    }, {
                        name: 'с. Яковцы',
                        data: []
                    }
                ]
            },
            {
                name: 'Руновщинская волость',
                data: [
                    {
                        name: 'д. Бруновка',
                        data: []
                    }, {
                        name: 'д. Вакулинцы',
                        data: []
                    }, {
                        name: 'д. Высоцковка',
                        data: []
                    }, {
                        name: 'с. Ковалевка',
                        data: []
                    }, {
                        name: 'д. Кованьковка',
                        data: []
                    }, {
                        name: 'с. Крутой Берег',
                        data: []
                    }, {
                        name: 'д. Крюково',
                        data: []
                    }, {
                        name: 'д. Паськовка',
                        data: []
                    }, {
                        name: 'д. Петрашовка',
                        data: []
                    }, {
                        name: 'с. Руновщина',
                        data: []
                    }, {
                        name: 'д. Терентовка',
                        data: []
                    }, {
                        name: 'д. Терновщина',
                        data: []
                    }
                ]
            },
            {
                name: 'Решетиловская волость',
                data: [
                    {
                        name: 'м-ко Решетиловка',
                        data: []
                    }
                ]
            },
            {
                name: 'Старо-Сенжаровская волость',
                data: [
                    {
                        name: 'м-ко Старые Сенжары',
                        data: []
                    }
                ]
            },
            {
                name: 'Супруновская волость',
                data: [
                    {
                        name: 'с. Гожулы',
                        data: []
                    }, {
                        name: 'с. Ивашки',
                        data: []
                    }, {
                        name: 'д. Лавки',
                        data: []
                    }, {
                        name: 'д. Малая Пушкаревка',
                        data: []
                    }, {
                        name: 'с. Мильцы',
                        data: []
                    }, {
                        name: 'с. Пушкаревка',
                        data: []
                    }, {
                        name: 'с. Рыбцы',
                        data: []
                    }, {
                        name: 'д. Рябухи',
                        data: []
                    }, {
                        name: 'с. Супруновка',
                        data: []
                    }, {
                        name: 'д. Шиловка',
                        data: []
                    }, {
                        name: 'д. Шостаки',
                        data: []
                    }
                ]
            },
            {
                name: 'Тахтауловская волость',
                data: [
                    {
                        name: 'с. Жуки',
                        data: []
                    }, {
                        name: 'с. Ивончинцы',
                        data: []
                    }, {
                        name: 'с. Малые Будищи',
                        data: []
                    }, {
                        name: 'с. Осмачки',
                        data: []
                    }, {
                        name: 'д. Патлаевка',
                        data: []
                    }, {
                        name: 'с. Петровка',
                        data: []
                    }, {
                        name: 'с. Семеновка',
                        data: []
                    }, {
                        name: 'с. Тахтаулово',
                        data: []
                    }, {
                        name: 'д. Терновщина',
                        data: []
                    }, {
                        name: 'хут. Чихачев',
                        data: []
                    }
                ]
            },
            {
                name: 'Чутовская волость',
                data: [
                    {
                        name: 'д. Александровка (Курносовка)',
                        data: []
                    }, {
                        name: 'хут. Васильковщина',
                        data: []
                    }, {
                        name: 'с. Искровка',
                        data: []
                    }, {
                        name: 'с. Кочубеевка',
                        data: []
                    }, {
                        name: 'д. Ново-Дмитровка',
                        data: []
                    }, {
                        name: 'д. Ровни',
                        data: []
                    }, {
                        name: 'д. Степановка',
                        data: []
                    }, {
                        name: 'д. Стенка',
                        data: []
                    }, {
                        name: 'хут. Сягайлы',
                        data: []
                    }, {
                        name: 'д. Федоровка',
                        data: []
                    }, {
                        name: 'с. Черняковка',
                        data: []
                    }, {
                        name: 'с. Чутово',
                        data: []
                    }
                ]}]

            },
            {
                name: "Прилукский уезд",
                data: [
                    {
                        name: 'г. Прилуки',
                        data: []
                    },
                    {
                        name: 'Березовская волость',
                        data: [
                            {
                                name: 'с. Березовка',
                                data: []
                            }, {
                                name: 'с. Карпиловка',
                                data: []
                            }, {
                                name: 'с. Харитоновка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Блотницкая волость',
                        data: [
                            {
                                name: 'с. Блотница',
                                data: []
                            }, {
                                name: 'с. Довгалевка',
                                data: []
                            }, {
                                name: 'д. Касьяновка',
                                data: []
                            }, {
                                name: 'с. Юрковцы',
                                data: []
                            }, {
                                name: 'с. Ярошевка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Богдановская волость',
                        data: [
                            {
                                name: 'с. Богдановка',
                                data: []
                            }, {
                                name: 'с. Голубовка',
                                data: []
                            }, {
                                name: 'с. Дубовый Гай',
                                data: []
                            }, {
                                name: 'с. Ивковцы',
                                data: []
                            }, {
                                name: 'д. Малковка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Гнилицкая волость',
                        data: [
                            {
                                name: 'м-ко Бейсбаховка',
                                data: []
                            }, {
                                name: 'с. Гнилица',
                                data: []
                            }, {
                                name: 'с. Николаевка',
                                data: []
                            }, {
                                name: 'с. Погребы',
                                data: []
                            }, {
                                name: 'экон. Пологи (Заводовщина)',
                                data: []
                            }, {
                                name: 'д. Сердовка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Згуровская волость',
                        data: [
                            {
                                name: 'д. Александровка',
                                data: []
                            }, {
                                name: 'с. Аркадьевка',
                                data: []
                            }, {
                                name: 'с. Згуровка',
                                data: []
                            }, {
                                name: 'с. Красное',
                                data: []
                            }, {
                                name: 'хут. Петровасик',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Иваницкая волость',
                        data: [
                            {
                                name: 'с. Бережовка',
                                data: []
                            }, {
                                name: 'д. Верескуны',
                                data: []
                            }, {
                                name: 'с. Иваница',
                                data: []
                            }, {
                                name: 'с. Ржовец',
                                data: []
                            }, {
                                name: 'с. Ступаковка',
                                data: []
                            }, {
                                name: 'с. Цуровка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Иванковская волость',
                        data: [
                            {
                                name: 'с. Гурбинцы',
                                data: []
                            }, {
                                name: 'с. Дегтяри',
                                data: []
                            }, {
                                name: 'с. Иванковцы',
                                data: []
                            }, {
                                name: 'д. Игнатовка',
                                data: []
                            }, {
                                name: 'с. Леляки',
                                data: []
                            }, {
                                name: 'с. Оробиевка',
                                data: []
                            }, {
                                name: 'с. Савинцы',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Малодевицкая волость',
                        data: [
                            {
                                name: 'д. Буды',
                                data: []
                            }, {
                                name: 'с. Великая Девица (список фамилий казенных крестьян, 1858 г.)',
                                data: 'Беда, Бугай, Вегера, Гайдаш, Горбань, Гриб, Деревянко, Довженко, \n' +
                                    'Коваленко, Костенко, Кравец, Кулик, Кушнир, Лазаренко, Лихолеп, Луценко, \n' +
                                    'Маценко, Михайличенко, Мовчан, Нестеренко, Онопко, Оробей, Охрименко, \n' +
                                    'Паливода, Панченко, Пилипенко, Поливаный, Сербин, Скорик, Супруненко, \n' +
                                    'Третяченко, Филипенко, Хапатченко, Чемерисовский, Шурло, Яременко, Ярошенко'
                            }, {
                                name: 'д. Грабово',
                                data: []
                            }, {
                                name: 'с. Колесники',
                                data: []
                            }, {
                                name: 'с. Лучковка',
                                data: []
                            }, {
                                name: 'д. Лесовые Сорочинцы',
                                data: []
                            }, {
                                name: 'с. Малая Девица (список фамилий казаков, 1858 г.)',
                                data: 'Бурда, Гармата, Гринь, Гришко, Копка, Коробка, Крисенко, Куценко, \n' +
                                    'Мелешко, Мищенко, Плющ, Пушкаренко, Фень, Хоруженко, Яценко'
                            }, {
                                name: 'с. Обычев',
                                data: []
                            }, {
                                name: 'с. Петровка',
                                data: []
                            }, {
                                name: 'с. Радьковка',
                                data: []
                            }, {
                                name: 'д. Стрельники',
                                data: []
                            }, {
                                name: 'с. Толкачевка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Ольшанская волость',
                        data: [
                            {
                                name: 'д. Вороновка',
                                data: []
                            }, {
                                name: 'с. Высокое',
                                data: []
                            }, {
                                name: 'с. Гмирянка',
                                data: []
                            }, {
                                name: 'с. Городня',
                                data: []
                            }, {
                                name: 'д. Левки',
                                data: []
                            }, {
                                name: 'с. Ольшана',
                                data: []
                            }, {
                                name: 'с. Сезьки',
                                data: []
                            }, {
                                name: 'с. Хаенки',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Переволочанская волость',
                        data: [
                            {
                                name: 'с. Красляны (список фамилий казаков, 1858 г.)',
                                data: 'Бартош, Бородавка, Власенко, Гавриш, Горбань, Гриценко, Даниленко, \n' +
                                    'Дид, Дуленко, Зазева, Ивашура, Игнатенко, Калениченко, Кисель, \n' +
                                    'Коврижка, Коновченко, Костюк, Кузьменко, Куцюруб, Лебедь, Марченко, \n' +
                                    'Мелашенко, Мищенко, Москаленко, Нестеренко, Ночовский, Омеляненко, \n' +
                                    'Охрименко, Остах, Повшенко, Проненко, Руденко, Сидоренко, Соболь, \n' +
                                    'Тендетный, Хажанец, Харченко, Федоренко, Филоненко, Чемерис, Чистик, \n' +
                                    'Шевченко, Шуба, Ювченко, Якунь, Ярмоленко'
                            }, {
                                name: 'с. Ладин (список фамилий казенных крестьян, 1858 г.)',
                                data: 'Балаба, Банюх, Барабаш, Белоус, Биховец, Бондаренко, Бочка, Бровко, \n' +
                                    'Бульба, Васильченко, Верлуп, Герасименко, Гетьманенко, Глущенко, Годун, \n' +
                                    'Денисенко, Дудка, Евлиенко, Жук, Жуменко, Зюбенко, Иженко, Калениченко, \n' +
                                    'Калян, Кисленко, Костенко, Кутуленко, Куцюруб, Лазаренко, Лимаренко, \n' +
                                    'Луценко, Маслик, Марченко, Матвеенко, Маценко, Науменко, Нетребко, \n' +
                                    'Огиенко, Олейник, Палюха, Парафин, Потужный, Руденко, Сахно, Спихач, \n' +
                                    'Сотниченко, Степаненко, Тарасенко, Терещенко, Титуленко, Тоцкий, Харенко, \n' +
                                    'Хоменко, Хурхало, Циганок, Чинчик, Шульженко, Юрченко, Юшка, Якименко'
                            }, {
                                name: 'с. Лиски',
                                data: []
                            }, {
                                name: 'с. Мольки',
                                data: []
                            }, {
                                name: 'с. Охоньки',
                                data: []
                            }, {
                                name: 'м-ко Переволочна (список фамилий казенных крестьян, 1858 г.)',
                                data: 'Байша, Бардак, Барановский, Болабан, Голий, Горошко, Донец, Кич, \n' +
                                    'Клочко, Койстрик, Куценко, Лукаш, Михалок, Олексеенко, Овдюшко, Пестич, \n' +
                                    'Пилипченко, Подлясный, Повх, Савченко, Собор, Старчило, Третяк, Троценко, \n' +
                                    'Тютюнник, Хилобоковой, Чабрат, Щербина'
                            }, {
                                name: 'с. Подыще',
                                data: []
                            }, {
                                name: 'д. Рыбцы',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Прилукская волость',
                        data: [
                            {
                                name: 'с. Боршна',
                                data: []
                            }, {
                                name: 'с. Валки',
                                data: []
                            }, {
                                name: 'с. Дедовцы',
                                data: []
                            }, {
                                name: 'д. Замостье',
                                data: []
                            }, {
                                name: 'д. Лапинцы',
                                data: []
                            }, {
                                name: 'д. Литвиновщина',
                                data: []
                            }, {
                                name: 'д. Манжосовка',
                                data: []
                            }, {
                                name: 'с. Мациевка',
                                data: []
                            }, {
                                name: 'д. Пироговцы',
                                data: []
                            }, {
                                name: 'сл. Подмонастырская',
                                data: []
                            }, {
                                name: 'с. Полова',
                                data: []
                            }, {
                                name: 'с. Сорочинцы',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Рудовская волость',
                        data: [
                            {
                                name: 'с. Заезд',
                                data: []
                            }, {
                                name: 'с. Каневщина',
                                data: []
                            }, {
                                name: 'с. Рудовка',
                                data: []
                            }, {
                                name: 'д. Тернавщина',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Ряшковская волость',
                        data: [
                            {
                                name: 'д. Аникиевка',
                                data: []
                            }, {
                                name: 'хут. Ильяшенков',
                                data: []
                            }, {
                                name: 'хут. Новая Гребля',
                                data: []
                            }, {
                                name: 'с. Ряшки',
                                data: []
                            }, {
                                name: 'с. Смошь',
                                data: []
                            }, {
                                name: 'хут. Солохский',
                                data: []
                            }, {
                                name: 'хут. Степь',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Сокиренская волость',
                        data: [
                            {
                                name: 'с. Васковцы',
                                data: []
                            }, {
                                name: 'с. Калюженцы',
                                data: []
                            }, {
                                name: 'с. Сокиренцы',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Сребрянская волость',
                        data: [
                            {
                                name: 'с. Алексенцы',
                                data: []
                            }, {
                                name: 'с. Грицовка',
                                data: []
                            }, {
                                name: 'с. Деймановка',
                                data: []
                            }, {
                                name: 'д. Зигайки',
                                data: []
                            }, {
                                name: 'с. Никоновка',
                                data: []
                            }, {
                                name: 'д. Побачивка',
                                data: []
                            }, {
                                name: 'с. Подол',
                                data: []
                            }, {
                                name: 'м-ко Сребное',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Туровская волость',
                        data: [
                            {
                                name: 'с. Оржица',
                                data: []
                            }, {
                                name: 'с. Паськовщина',
                                data: []
                            }, {
                                name: 'с. Поддубновка',
                                data: []
                            }, {
                                name: 'с. Туровка',
                                data: []
                            }, {
                                name: 'хут. Урсаловка',
                                data: []
                            }
                        ]
                    }
                ]
            },
            {
                name: "Роменский уезд",
                data: [
                    {
                        name: 'г. Ромны',
                        data: []
            },
            {
                name: 'Бацмановская волость',
                data: [
                    {
                        name: 'с. Бацманы',
                        data: []
                    }, {
                        name: 'с. Гавриловка',
                        data: []
                    }, {
                        name: 'хут. Кропивенцы',
                        data: []
                    }, {
                        name: 'с. Малые Бубны',
                        data: []
                    }, {
                        name: 'д. Ненадовка',
                        data: []
                    }, {
                        name: 'с. Репки',
                        data: []
                    }, {
                        name: 'с. Салагубовка',
                        data: []
                    }
                ]
            },
            {
                name: 'Бобрикская волость',
                data: [
                    {
                        name: 'с. Бобрик',
                        data: []
                    }, {
                        name: 'с. Беловод',
                        data: []
                    }, {
                        name: 'д. Поповка',
                        data: []
                    }, {
                        name: 'сл. Поповщина',
                        data: []
                    }
                ]
            },
            {
                name: 'Велико-Бубновская волость',
                data: [
                    {
                        name: 'с. Великие Бубны',
                        data: []
                    }, {
                        name: 'с. Галка',
                        data: []
                    }, {
                        name: 'д. Вьюнное',
                        data: []
                    }, {
                        name: 'д. Глобовка',
                        data: []
                    }, {
                        name: 'д. Заезд',
                        data: []
                    }, {
                        name: 'с. Медвежье',
                        data: []
                    }, {
                        name: 'с. Мокиевка',
                        data: []
                    }
                ]
            },
            {
                name: 'Глинская волость',
                data: [
                    {
                        name: 'с. Артюховка',
                        data: []
                    }, {
                        name: 'с. Волошиновка',
                        data: []
                    }, {
                        name: 'с. Глинск',
                        data: []
                    }, {
                        name: 'с. Локня',
                        data: []
                    }, {
                        name: 'д. Сурмачовка',
                        data: []
                    }, {
                        name: 'с. Хоминцы',
                        data: []
                    }, {
                        name: 'д. Чеберяки',
                        data: []
                    }, {
                        name: 'д. Шумск',
                        data: []
                    }, {
                        name: 'д. Щемиловка',
                        data: []
                    }, {
                        name: 'с. Ярмолинцы',
                        data: []
                    }
                ]
            },
            {
                name: 'Гриневская волость',
                data: [
                    {
                        name: 'хут. Беседовка',
                        data: []
                    }, {
                        name: 'с. Гриневка',
                        data: []
                    }, {
                        name: 'с. Томашевка',
                        data: []
                    }, {
                        name: 'с. Хрещатик',
                        data: []
                    }
                ]
            },
            {
                name: 'Засульская волость',
                data: [
                    {
                        name: 'с. Аксютинцы',
                        data: []
                    }, {
                        name: 'с. Герасимовка',
                        data: []
                    }, {
                        name: 'с. Засулье',
                        data: []
                    }, {
                        name: 'с. Пустовойтовка',
                        data: []
                    }
                ]
            },
            {
                name: 'Коровинская волость',
                data: [
                    {
                        name: 'с. Волковцы',
                        data: []
                    }, {
                        name: 'с. Коровинцы',
                        data: []
                    }, {
                        name: 'д. Лахновщина',
                        data: []
                    }, {
                        name: 'д. Рубанка',
                        data: []
                    }
                ]
            },
            {
                name: 'Краснослободская волость',
                data: [
                    {
                        name: 'с. Красная Слобода',
                        data: []
                    }, {
                        name: 'хут. Переточки',
                        data: []
                    }, {
                        name: 'с. Сакунова Слобода',
                        data: []
                    }, {
                        name: 'хут. Школовщина',
                        data: []
                    }
                ]
            },
            {
                name: 'Курмановская волость',
                data: [
                    {
                        name: 'д. Березняки',
                        data: []
                    }, {
                        name: 'м-ко Константиново',
                        data: []
                    }, {
                        name: 'с. Кулишовка',
                        data: []
                    }, {
                        name: 'с. Курманы',
                        data: []
                    }, {
                        name: 'с. Малые Будки',
                        data: []
                    }
                ]
            },
            {
                name: 'Липовская волость',
                data: [
                    {
                        name: 'с. Липовое',
                        data: []
                    }
                ]
            },
            {
                name: 'Пекаревская волость',
                data: [
                    {
                        name: 'хут. Анциборов',
                        data: []
                    }, {
                        name: 'д. Болонковка',
                        data: []
                    }, {
                        name: 'д. Вороновка',
                        data: []
                    }, {
                        name: 'хут. Ново-Николаев',
                        data: []
                    }, {
                        name: 'с. Пекари',
                        data: []
                    }
                ]
            },
            {
                name: 'Перекоповская волость',
                data: [
                    {
                        name: 'с. Москалевка',
                        data: []
                    }, {
                        name: 'с. Перекоповка',
                        data: []
                    }
                ]
            },
            {
                name: 'Рогинская волость',
                data: [
                    {
                        name: 'с. Рогинцы',
                        data: []
                    }
                ]
            },
            {
                name: 'Роменская волость',
                data: [
                    {
                        name: 'с. Евлаши',
                        data: []
                    }, {
                        name: 'с. Житное',
                        data: []
                    }, {
                        name: 'с. Коржи',
                        data: []
                    }, {
                        name: 'с. Левченки',
                        data: []
                    }, {
                        name: 'с. Лозовая',
                        data: []
                    }, {
                        name: 'д. Пески',
                        data: []
                    }, {
                        name: 'с. Плавинище',
                        data: []
                    }, {
                        name: 'д. Погребы',
                        data: []
                    }, {
                        name: 'с. Працовка',
                        data: []
                    }
                ]
            },
            {
                name: 'Смелянская волость',
                data: [
                    {
                        name: 'с. Протасовка',
                        data: []
                    }, {
                        name: 'м-ко Смелое',
                        data: []
                    }
                ]
            },
            {
                name: 'Талалаевская волость',
                data: [
                    {
                        name: 'с. Слободка',
                        data: []
                    }, {
                        name: 'с. Талалаевка',
                        data: []
                    }
                ]
            },
            {
                name: 'Хмеловская волость',
                data: [
                    {
                        name: 'с. Басовка',
                        data: []
                    }, {
                        name: 'с. Будки Великие',
                        data: []
                    }, {
                        name: 'с. Николаевка',
                        data: []
                    }, {
                        name: 'м-ко Хмелов',
                        data: []
                    }
                ]
            },
            {
                name: 'Хоружевская волость',
                data: [
                    {
                        name: 'хут. Великий Дараган',
                        data: []
                    }, {
                        name: 'с. Ивановское',
                        data: []
                    }, {
                        name: 'хут. Люминарщина',
                        data: []
                    }, {
                        name: 'с. Хоружевка',
                        data: []
                    }, {
                        name: 'д. Чемодановка',
                        data: []
                    }
                ]
            },
            {
                name: 'Хустянская волость',
                data: [
                    {
                        name: 'хут. Глушков Хустянка',
                        data: []
                    }
                ]
            },
            {
                name: 'Чернече-слободская волость',
                data: [
                    {
                        name: 'с. Чернечья Слобода',
                        data: []
                    }
                ]}]
            },
            {
                name: "Хорольский уезд",
                data: [
                    {
                        name: 'г. Хорол',
                        data: []
                    },
                    {
                        name: 'Балаклийская волость',
                        data: [
                            {
                                name: 'м-ко Балаклия',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Белоцерковская волость',
                        data: [
                            {
                                name: 'с. Борки',
                                data: []
                            }, {
                                name: 'м-ко Белоцерковка',
                                data: []
                            }, {
                                name: 'с. Лиман',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Горшинская волость',
                        data: [
                            {
                                name: 'м-ко Горошино',
                                data: []
                            }, {
                                name: 'с. Нарожье',
                                data: []
                            }, {
                                name: 'с. Новый Калкаев',
                                data: []
                            }, {
                                name: 'с. Старый Калкаев',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Еньковская волость',
                        data: [
                            {
                                name: 'с. Андреевка',
                                data: []
                            }, {
                                name: 'д. Болбасовка',
                                data: []
                            }, {
                                name: 'д. Вязовок',
                                data: []
                            }, {
                                name: 'д. Елисаветская',
                                data: []
                            }, {
                                name: 'с. Еньки',
                                data: []
                            }, {
                                name: 'д. Еньковская Каплица',
                                data: []
                            }, {
                                name: 'д. Николаевка (Байрак)',
                                data: []
                            }, {
                                name: 'д. Олемпиадовка (Демочановка)',
                                data: []
                            }, {
                                name: 'с. Хощевка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Заиченская волость',
                        data: [
                            {
                                name: 'д. Бакумовка',
                                data: []
                            }, {
                                name: 'д. Брусовка',
                                data: []
                            }, {
                                name: 'с. Беляки',
                                data: []
                            }, {
                                name: 'с. Васильевка',
                                data: []
                            }, {
                                name: 'с. Заиченцы',
                                data: []
                            }, {
                                name: 'д. Николаевка',
                                data: []
                            }, {
                                name: 'с. Тройняки',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Зубаневская волость',
                        data: [
                            {
                                name: 'д. Андриановка',
                                data: []
                            }, {
                                name: 'с. Зубани',
                                data: []
                            }, {
                                name: 'с. Петровка',
                                data: []
                            }, {
                                name: 'с. Радаловка',
                                data: []
                            }, {
                                name: 'д. Руда',
                                data: []
                            }, {
                                name: 'д. Яновщина',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Калениковская волость',
                        data: [
                            {
                                name: 'хут. Бакай',
                                data: []
                            }, {
                                name: 'с. Каленики',
                                data: []
                            }, {
                                name: 'пос. Настасовка',
                                data: []
                            }, {
                                name: 'с. Сухорабовка',
                                data: []
                            }, {
                                name: 'д. Хрищатая',
                                data: []
                            }, {
                                name: 'с. Шиловка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Клепачевская волость',
                        data: [
                            {
                                name: 'м-ко Вергуны',
                                data: []
                            }, {
                                name: 'с. Клепачи',
                                data: []
                            }, {
                                name: 'м-ко Княжая-Лука',
                                data: []
                            }, {
                                name: 'с. Новачиха',
                                data: []
                            }, {
                                name: 'д. Павловка',
                                data: []
                            }, {
                                name: 'д. Стойки',
                                data: []
                            }, {
                                name: 'с. Шишаки',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Криворудская волость',
                        data: [
                            {
                                name: 'д. Буромка',
                                data: []
                            }, {
                                name: 'д. Захаровка',
                                data: []
                            }, {
                                name: 'с. Казенная Кривая Руда',
                                data: []
                            }, {
                                name: 'д. Переняки',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Ново-Аврамовская волость',
                        data: [
                            {
                                name: 'с. Бутовцы',
                                data: []
                            }, {
                                name: 'с. Ковали',
                                data: []
                            }, {
                                name: 'д. Лагодовка',
                                data: []
                            }, {
                                name: 'д. Малая Поповка',
                                data: []
                            }, {
                                name: 'с. Милюшки',
                                data: []
                            }, {
                                name: 'с. Ново-Аврамовка',
                                data: []
                            }, {
                                name: 'с. Ново-Ивановка',
                                data: []
                            }, {
                                name: 'с. Поповка',
                                data: []
                            }, {
                                name: 'с. Старо-Аврамовка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Оболонянская волость',
                        data: [
                            {
                                name: 'с. Демяновка',
                                data: []
                            }, {
                                name: 'с. Ивановка',
                                data: []
                            }, {
                                name: 'д. Новоселицы',
                                data: []
                            }, {
                                name: 'м-ко Оболонь',
                                data: []
                            }, {
                                name: 'с. Погребняковщина',
                                data: []
                            }, {
                                name: 'с. Степановка',
                                data: []
                            }, {
                                name: 'д. Слюзовка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Остаповская волость',
                        data: [
                            {
                                name: 'хут. Большая Рокита',
                                data: []
                            }, {
                                name: 'с. Запселье',
                                data: []
                            }, {
                                name: 'м-ко Остапье',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Покровско-Богачанская волость',
                        data: [
                            {
                                name: 'д. Анастасиевка',
                                data: []
                            }, {
                                name: 'с. Березняки',
                                data: []
                            }, {
                                name: 'д. Бочки',
                                data: []
                            }, {
                                name: 'д. Ванжина-Долина',
                                data: []
                            }, {
                                name: 'д. Григорьевка',
                                data: []
                            }, {
                                name: 'д. Иванчики',
                                data: []
                            }, {
                                name: 'д. Остров',
                                data: []
                            }, {
                                name: 'с. Покровская Богачка',
                                data: []
                            }, {
                                name: 'с. Хильковка',
                                data: []
                            }, {
                                name: 'д. Шинковщина',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Родионовская волость',
                        data: [
                            {
                                name: 'д. Богачка',
                                data: []
                            }, {
                                name: 'с. Бригадировка',
                                data: []
                            }, {
                                name: 'с. Владимировка',
                                data: []
                            }, {
                                name: 'с. Елисаветино',
                                data: []
                            }, {
                                name: 'хут. Ивановка',
                                data: []
                            }, {
                                name: 'д. Поповка',
                                data: []
                            }, {
                                name: 'с. Родионовка',
                                data: []
                            }, {
                                name: 'с. Семионовка',
                                data: []
                            }, {
                                name: 'д. Степановка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Рокитянская волость',
                        data: [
                            {
                                name: 'с. Богдановка',
                                data: []
                            }, {
                                name: 'д. Бурбино',
                                data: []
                            }, {
                                name: 'с. Владельческая Кривая Руда',
                                data: []
                            }, {
                                name: 'с. Рокиты',
                                data: []
                            }, {
                                name: 'д. Софино',
                                data: []
                            }, {
                                name: 'д. Толстая',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Семеновская волость',
                        data: [
                            {
                                name: 'д. Большие Липняги',
                                data: []
                            }, {
                                name: 'с. Вербки',
                                data: []
                            }, {
                                name: 'с. Веселый Подол',
                                data: []
                            }, {
                                name: 'д. Герасимовка',
                                data: []
                            }, {
                                name: 'с. Еремеевка',
                                data: []
                            }, {
                                name: 'д. Замуловка',
                                data: []
                            }, {
                                name: 'д. Ивановка',
                                data: []
                            }, {
                                name: 'д. Малые Липняги',
                                data: []
                            }, {
                                name: 'д. Николаевка',
                                data: []
                            }, {
                                name: 'с. Очеретоватое',
                                data: []
                            }, {
                                name: 'д. Пан-Ивановка',
                                data: []
                            }, {
                                name: 'м-ко Семеновка',
                                data: []
                            }, {
                                name: 'с. Устимовка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Хорольская волость',
                        data: [
                            {
                                name: 'с. Вишняки',
                                data: []
                            }, {
                                name: 'д. Глубокая Долина',
                                data: []
                            }, {
                                name: 'с. Трубойцы',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Худолеевская волость',
                        data: [
                            {
                                name: 'с. Матвеевка',
                                data: []
                            }, {
                                name: 'с. Моисеевка (новая и старая)',
                                data: []
                            }, {
                                name: 'с. Худолеевка',
                                data: []
                            }
                        ]
                    }
                ]}]
            },
            {
                name: "Таврическая губерния",
                data: [
                    {
                        name: "Бердянский уезд",
                        data: [
                            {
                                name: 'г. Бердянск',
                                data: []
                    },
                    {
                        name: 'Александровская волость',
                        data: [
                            {
                                name: 'с. Александровка (Невкус)',
                                data: []
                            }, {
                                name: 'пос. Викторовка',
                                data: []
                            }, {
                                name: 'с. Второ-Константиновка',
                                data: []
                            }, {
                                name: 'с. Гирсовка (Тульга) - болг. Некоторые фамилии жителей села в 1900 г.',
                                data: 'Андреев, Афанасьев, Балабанов, Бинчев, Васильев, Вельчев, Владов, \n' +
                                    'Волков, Ганев, Георгиев, Греблиев, Гребнев, Димитров, Димов, Дичев, \n' +
                                    'Добрев, Дончев, Дупов, Желязков, Зябрев, Иванов, Кирчев, Кисилев, \n' +
                                    'Лисов, Мавров, Маринов, Марков, Мигов, Миндов, Миронов, Митев, \n' +
                                    'Недельчев, Николаев, Пейков, Петров, Попов, Радилов, Рашков, \n' +
                                    'Тодаркиев, Сивов, Симов, Станчев, Стоев, Стойков, Стоянов, Тодоров, \n' +
                                    'Чимлекчиев'
                            }, {
                                name: 'с. Дунаевка (Майтугай) - молд. Некоторые фамилии жителей села в 1910 г.',
                                data: 'Анастасов, Андрюшко, Барба, Берли, Бобол, Будей, Булат, Гвинтовка, \n' +
                                    'Гойдулян, Гойчев, Даниленко, Детушев, Жакот, Жидков, Засовенко, Иванов, \n' +
                                    'Иорданов, Каббатут, Каланча, Кирпалов, Кожухарь, Кошель, Куюнджи, \n' +
                                    'Лопата, Маринов, Монастырли, Мустяц, Нестеренко, Обрежа, Олексенко, \n' +
                                    'Пано, Пантелеев, Петришкан, Продан, Романенко, Рошь, Сербов, Стоев, \n' +
                                    'Стоянов, Трюхан, Тютюник, Цуркан, Чабан, Чакир, Черепьян, Черняга, \n' +
                                    'Щетка, Яковенко'
                            }, {
                                name: 'с. Мироновка',
                                data: []
                            }, {
                                name: 'с. Ново-Константиновка (Тубал)',
                                data: []
                            }, {
                                name: 'с. Степановка (Янцегур)',
                                data: []
                            }, {
                                name: 'с. Троицкое',
                                data: []
                            }, {
                                name: 'пос. Тульга №1 и №2',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Андреевская волость',
                        data: [
                            {
                                name: 'с. Андреевка',
                                data: []
                            }, {
                                name: 'хут. Величко',
                                data: []
                            }, {
                                name: 'хут. Гуля',
                                data: []
                            }, {
                                name: 'хут. Дядикова',
                                data: []
                            }, {
                                name: 'хут. Козина',
                                data: []
                            }, {
                                name: 'хут. Сахно',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Белицкая волость',
                        data: [
                            {
                                name: 'с. Белицкое (Юрковка)',
                                data: []
                            }, {
                                name: 'с. Ново-Яковлевка (Бойково)',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Берестовацкая волость',
                        data: [
                            {
                                name: 'с. Берестовое',
                                data: []
                            }, {
                                name: 'хут. Гуржиев',
                                data: []
                            }, {
                                name: 'с. Довбино',
                                data: []
                            }, {
                                name: 'хут. Ланцев',
                                data: []
                            }, {
                                name: 'с. Сачки',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Больше-Токмакская волость',
                        data: [
                            {
                                name: 'м-ко Большой Токмак (списки фамилий за 1910-11 гг.)',
                                data: 'Баштовой, Блоха, Бугаенко, Бут, Верхогляд, Гарбуз, Гарькавый, \n' +
                                    'Губенко, Дереза, Дымченко, Дьяченко, Евфименко, Жмурко, Жолудь, \n' +
                                    'Загребельный, Залозный, Зубков, Кавун,? Калашник, Калюжный, Капинос, \n' +
                                    'Касьян, Касинский, Кириченко, Кныш, Кобезев, Корж, Кравченко, Кущенко, \n' +
                                    'Ластенко, Лебедь, Лисняк, Лобурь, Лукаш, Мазнюк, Майсак, Максименко, \n' +
                                    'Митяненко, Моляр, Моценко, Немченко, Овчаренко, Орехов, Рябко, Синица, \n' +
                                    'Старосвитский, Стрюк, Танич, Таран, Твердый, Уманский, Халецкий, Халява, \n' +
                                    'Чабан, Чебытько, Чумак, Шамрай, Шарий, Шевченко, Шевчук, Штепа, Щекин'
                            }, {
                                name: 'сел. Нижний Куркулак (списки фамилий за 1911-12 гг.)',
                                data: 'Антипенко, Васильченко, Витер, Гарькавый, Гойда, Дереза, Дудка, \n' +
                                    'Дьяченко, Ефименко, Жук, Ищенко, Киценко, Клец, Костюк, Костюченко, \n' +
                                    'Кременчугский, Кулиш, Лисняк, Литвиненко, Мелехин, Мелешко, Михайлюк, \n' +
                                    'Мороз, Муха, Овчаренко, Федан, Хилько, Шаповал, Шевченко, Шкарупило, \n' +
                                    'Шматько, Шостак, Щедрый, Щусь, Ярошенко'
                            }
                        ]
                    },
                    {
                        name: 'Вознесенская волость',
                        data: [
                            {
                                name: 'с. Вознесенка',
                                data: []
                            }, {
                                name: 'с. Константиновка',
                                data: []
                            }, {
                                name: 'с. Мордвиновка',
                                data: []
                            }, {
                                name: 'с. Тихоновка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Гальбштадская волость (менонитские поселения)',
                        data: [
                            {
                                name: 'с. Блюменорт (поселяне-собственники за 1915 г.)',
                                data: 'Горн Яков Петрович, усадьба с домом и службами.'
                            }, {
                                name: 'с. Гальбштадт (Молочанск). Поселяне-собственники за 1915 г.',
                                data: 'Шаад Готлиб Готлибович, Шефер Карл Андреевич, Шредер Г.Г.'
                            }, {
                                name: 'с. Либенау (поселяне-собственники за 1915 г.)',
                                data: 'Франц Яков Петрович, 63 д. 1032 кв. саж. земли с домом \n' +
                                    'и постройками.'
                            }, {
                                name: 'с. Линденау (поселяне-собственники за 1915 г.)',
                                data: 'Балау Петр Иоганнович, 1100 кв. саж. усадебной земли. \n' +
                                    'Балау Яков Иоганнович, усадьба с домом и службами.'
                            }, {
                                name: 'с. Ней-Гальбштадт (поселяне-собственники за 1915 г.)',
                                data: 'Винс Петр Генрихович, 6 д. 1972 кв. саж. земли.'
                            }, {
                                name: 'с. Петерсганен (поселяне-собственники за 1915 г.)',
                                data: 'Барковский Иоганн Михайлович, 636 кв. с, усадебной земли с домом.'
                            }, {
                                name: 'с. Рикенау (поселяне-собственники за 1915 г.)',
                                data: 'Ведлер Иоганн Мартынов, 872 кв.саж. усадебной земли с домом и сараем.'
                            }, {
                                name: 'с. Тигенгаген (поселяне-собственники за 1915 г.)',
                                data: 'Фаст Корнелиус Корнелиусович, 15 д. 183 кв. саж. земли \n' +
                                    'с усадьбой и домами.'
                            }
                        ]
                    },
                    {
                        name: 'Гнаденфельдская волость',
                        data: [
                            {
                                name: 'с. Александрталь',
                                data: []
                            }, {
                                name: 'с. Гнаденфельд (Богдановка)',
                                data: []
                            }, {
                                name: 'с. Ландскроне (поселяне-собственники за 1915 г.)',
                                data: 'Тиссен Генрих Клаасов, 14 д. 2136 к. с. земли.',
                            }, {
                                name: 'с. Мариаволь (поселяне-собственники за 1915 г.)',
                                data: 'Франзен Мария Якубовна, 69 д. 2129 к. с. земли.',
                            }, {
                                name: 'с. Францталь (поселяне-собственники за 1915 г.)',
                                data: 'Мартенс Иоганн Якубов, 78 д. 237 к. с. земли.'
                            }, {
                                name: 'с. Шпарау (поселяне-собственники за 1915 г.)',
                                data: 'Дик Корнелиус и Иоганн Германовичи, 64 д. 1046 кв. с. земли.'
                            }
                        ]
                    },
                    {
                        name: 'Дмитриевская волость',
                        data: [
                            {
                                name: 'с. Борисовка (Белекмес, Ивановка)',
                                data: []
                            }, {
                                name: 'с. Дмитриевка (Югартамгалы)',
                                data: []
                            }, {
                                name: 'хут. Греков (Царев-Дар, болг.)',
                                data: []
                            }, {
                                name: 'с. Лозановка (Курумбаш)',
                                data: []
                            }, {
                                name: 'с. Николаевское (Куцая)',
                                data: []
                            }, {
                                name: 'с. Ново-Павловка',
                                data: []
                            }, {
                                name: 'хут. Трояны (Батрак, болг.)',
                                data: []
                            }, {
                                name: 'хут. Шоль (нем.)',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Елисеевская волость',
                        data: [
                            {
                                name: 'с. Гюневка (болг.)',
                                data: []
                            }, {
                                name: 'с. Елисеевка (Шеклы)',
                                data: []
                            }, {
                                name: 'с. Нейгофнугсталь (нем.)',
                                data: []
                            }, {
                                name: 'с. Нельговка',
                                data: []
                            }, {
                                name: 'с. Радановка (Радоловка)',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Зеленовская волость',
                        data: [
                            {
                                name: 'с. Зеленовка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Мало-Токмакская волость',
                        data: [
                            {
                                name: 'с. Барвиновка',
                                data: []
                            }, {
                                name: 'с. Вербовое',
                                data: []
                            }, {
                                name: 'с. Малая Токмачка',
                                data: []
                            }, {
                                name: 'хут. Тарана',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Николаевская волость',
                        data: [
                            {
                                name: 'хут. Браилка',
                                data: []
                            }, {
                                name: 'хут. Веременко',
                                data: []
                            }, {
                                name: 'хут. Глодовая',
                                data: []
                            }, {
                                name: 'с. Николаевка (Железная Балка)',
                                data: []
                            }, {
                                name: 'с. Роенко',
                                data: []
                            }, {
                                name: 'хут. Шевченко',
                                data: []
                            }, {
                                name: 'хут. Широкая',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Ново-Алексеевская волость',
                        data: [
                            {
                                name: 'с. Диановка',
                                data: []
                            }, {
                                name: 'с. Мариино',
                                data: []
                            }, {
                                name: 'с. Ново-Алексеевка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Ново-Васильевская волость',
                        data: [
                            {
                                name: 'с. Астраханка',
                                data: []
                            }, {
                                name: 'с. Анно-Апанлы',
                                data: []
                            }, {
                                name: 'с. Беседовка (Тубал)',
                                data: []
                            }, {
                                name: 'с. Воскресенка (Кислик)',
                                data: []
                            }, {
                                name: 'с. Задунаевка (Темир-Хаджа)',
                                data: []
                            }, {
                                name: 'с. Ново-Александровка (Андреевка)',
                                data: []
                            }, {
                                name: 'с. Ново-Борисовка',
                                data: []
                            }, {
                                name: 'с. Ново-Васильевка',
                                data: []
                            }, {
                                name: 'с. Ново-Николаевка',
                                data: []
                            }, {
                                name: 'Ново-Спасское (Шавкай)',
                                data: []
                            }, {
                                name: 'хут. Степное (нем.)',
                                data: []
                            }, {
                                name: 'с. Федоровка',
                                data: []
                            }, {
                                name: 'с. Царе-Александровка (Ореховка)',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Ново-Григорьевская волость',
                        data: [
                            {
                                name: 'с. Ново-Григорьевка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Ново-Михайловская волость',
                        data: [
                            {
                                name: 'с. Кайкулак',
                                data: []
                            }, {
                                name: 'с. Ново-Зеленое',
                                data: []
                            }, {
                                name: 'с. Ново-Казанковатое',
                                data: []
                            }, {
                                name: 'с. Ново-Михайловка',
                                data: []
                            }, {
                                name: 'с. Ново-Скелеватое',
                                data: []
                            }, {
                                name: 'с. Остриково-Скелеватое',
                                data: []
                            }, {
                                name: 'с. Очеретоватое',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Ново-Павловская волость',
                        data: [
                            {
                                name: 'с. Ново-Павловка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Ореховская волость',
                        data: [
                            {
                                name: 'с. Ново-Андреевка',
                                data: []
                            }, {
                                name: 'с. Ново-Даниловка',
                                data: []
                            }, {
                                name: 'с. Ново-Павловка',
                                data: []
                            }, {
                                name: 'г. Орехов',
                                data: []
                            }, {
                                name: 'с. Щербаки',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Петровская волость',
                        data: [
                            {
                                name: 'с. Анновка',
                                data: []
                            }, {
                                name: 'с. Апостоловка',
                                data: []
                            }, {
                                name: 'с. Дмитриевка',
                                data: []
                            }, {
                                name: 'с. Манойловка',
                                data: []
                            }, {
                                name: 'с. Мариановка',
                                data: []
                            }, {
                                name: 'с. Перво-Николаевка',
                                data: []
                            }, {
                                name: 'с. Петровка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Петро-Павловская волость',
                        data: [
                            {
                                name: 'дер. Ольгополь',
                                data: []
                            }, {
                                name: 'с. Петро-Павловка',
                                data: []
                            }, {
                                name: 'хут. Таран',
                                data: []
                            }, {
                                name: 'хут. Шеларь',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Покровская волость',
                        data: [
                            {
                                name: 'с. Гаммовка (Джантран)',
                                data: []
                            }, {
                                name: 'с. Георгиевка (Тююшке)',
                                data: []
                            }, {
                                name: 'с. Девненское (Таз)',
                                data: []
                            }, {
                                name: 'с. Надеждино (Караруга)',
                                data: []
                            }, {
                                name: 'с. Ново-Троицкое (Бурун)',
                                data: []
                            }, {
                                name: 'с. Покровка (Шуют-Джурет)',
                                data: []
                            }, {
                                name: 'хут. Царицынский',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Поповская волость',
                        data: [
                            {
                                name: 'с. Поповка',
                                data: []
                            }, {
                                name: 'с. Салтычия',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Преславская волость',
                        data: [
                            {
                                name: 'с. Бановка',
                                data: []
                            }, {
                                name: 'с. Инзовка (Орманчи)',
                                data: []
                            }, {
                                name: 'с. Камышеватка',
                                data: []
                            }, {
                                name: 'с. Обиточное (Денисовка)',
                                data: []
                            }, {
                                name: 'с. Орловка (Сустукан)',
                                data: []
                            }, {
                                name: 'с. Преслав (Шеклы)',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Романовская волость',
                        data: [
                            {
                                name: 'с. Богородицкое',
                                data: []
                            }, {
                                name: 'с. Вячеславка (Эникёй, болг.)',
                                data: []
                            }, {
                                name: 'с. Елисаветовка (Кара-курсак)',
                                data: []
                            }, {
                                name: 'с. Нейштутгарт (нем.)',
                                data: []
                            }, {
                                name: 'с. Романовка (болг.)',
                                data: []
                            }, {
                                name: 'с. Юрьевка (Беш-Аул)',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Сладко-Балковская волость',
                        data: [
                            {
                                name: 'с. Копани',
                                data: []
                            }, {
                                name: 'с. Ново-Прокофьевка',
                                data: []
                            }, {
                                name: 'дер. Работино',
                                data: []
                            }, {
                                name: 'с. Сладкая Балка',
                                data: 'Безручко, Левченко, Сидоренко',
                            }
                        ]
                    },
                    {
                        name: 'Софиевская волость',
                        data: [
                            {
                                name: 'с. Андровка (Канжолы, болг.)',
                                data: []
                            }, {
                                name: 'с. Нейгофнунг (нем.)',
                                data: []
                            }, {
                                name: 'с. Ново-Троицкое',
                                data: []
                            }, {
                                name: 'с. Палаузовка (Калеул, болг.)',
                                data: []
                            }, {
                                name: 'с. Розенфельд (нем.)',
                                data: []
                            }, {
                                name: 'с. Софиевка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Цареволодаровская волость',
                        data: [
                            {
                                name: 'с. Богдановка (Нижний Чишмели)',
                                data: []
                            }, {
                                name: 'с. Браиловка',
                                data: []
                            }, {
                                name: 'с. Владимировка (Альшин)',
                                data: []
                            }, {
                                name: 'с. Дмитриевка (Бодай)',
                                data: []
                            }, {
                                name: 'с. Ново-Поповка',
                                data: []
                            }, {
                                name: 'с. Приморский Посад',
                                data: []
                            }, {
                                name: 'с. Районовка (Вайсал)',
                                data: []
                            }, {
                                name: 'с. Степановка (Верхние Чишмели)',
                                data: []
                            }, {
                                name: 'с. Строгановка (Кичкен)',
                                data: []
                            }, {
                                name: 'с. Цареводаровка (Сустугун)',
                                data: []
                            }
                        ]
                    },
                            {
                                name: 'Черниговская волость',
                                data: [
                                    {
                                        name: 'с. Бегим-Чокрак',
                                        data: []
                                    }, {
                                        name: 'с. Верхний Токмак',
                                        data: []
                                    }, {
                                        name: 'с. Зубово',
                                        data: []
                                    }, {
                                        name: 'с. Могиляны',
                                        data: []
                                    }, {
                                        name: 'с. Ново-Полтавка',
                                        data: []
                                    }, {
                                        name: 'с. Приморский Посад',
                                        data: []
                                    }, {
                                        name: 'с. Ново-Семеновка',
                                        data: []
                                    }, {
                                        name: 'с. Стульнево',
                                        data: []
                                    }, {
                                        name: 'с. Черниговка',
                                        data: []
                                    }
                                ]
                            }]//asdasd
            },
            {
                name: "Днепровский уезд",
                data: [
                    {
                        name: 'Алешковская волость',
                        data: [
                            {
                                name: 'г. Алешки',
                                data: []
                            }, {
                                name: 'с. Кардашинка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Бехтерская волость',
                        data: [
                            {
                                name: 'с. Бехтеры',
                                data: []
                            }, {
                                name: 'с. Ивановка',
                                data: []
                            }, {
                                name: 'с. Кларовка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Больше-Копанская волость',
                        data: [
                            {
                                name: 'с. Большие Копани',
                                data: []
                            }, {
                                name: 'с. Брилевка',
                                data: []
                            }, {
                                name: 'с. Раденск',
                                data: []
                            }, {
                                name: 'с. Чалбурда',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Громовская волость',
                        data: [
                            {
                                name: 'с. Воскресенка',
                                data: []
                            }, {
                                name: 'с. Громовка',
                                data: []
                            }, {
                                name: 'хут. Марьяновский',
                                data: []
                            }, {
                                name: 'с. Николаевка',
                                data: []
                            }, {
                                name: 'с. Новопокровка',
                                data: []
                            }, {
                                name: 'с. Новореповка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Збурьевская волость',
                        data: [
                            {
                                name: 'с. Голая Пристань',
                                data: []
                            }, {
                                name: 'с. Новая Збурьевка',
                                data: []
                            }, {
                                name: 'с. Старая Збурьевка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Казачье-Лагерская волость',
                        data: [
                            {
                                name: 'с. Казачьи Лагери',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Каирская волость',
                        data: [
                            {
                                name: 'с. Большая Благовещенка',
                                data: []
                            }, {
                                name: 'с. Горностаевка',
                                data: []
                            }, {
                                name: 'с. Каиры',
                                data: []
                            }, {
                                name: 'с. Константиновка',
                                data: []
                            }, {
                                name: 'с. Любимовка',
                                data: []
                            }, {
                                name: 'с. Новоалександровка',
                                data: []
                            }, {
                                name: 'с. Софиевка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Каланчакская волость',
                        data: [
                            {
                                name: 'с. Каланчак',
                                data: []
                            }, {
                                name: 'с. Ново-Киевка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Каховская волость',
                        data: [
                            {
                                name: 'с. Большая Каховка',
                                data: []
                            }, {
                                name: 'с. Британы (Днепряны)',
                                data: []
                            }, {
                                name: 'с. Любимовка',
                                data: []
                            }, {
                                name: 'с. Софиевка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Князь-Григорьевская волость',
                        data: [
                            {
                                name: 'с. Завадовка',
                                data: []
                            }, {
                                name: 'с. Князь-Григорьевка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Красная волость',
                        data: [
                            {
                                name: 'с. Карга',
                                data: []
                            }, {
                                name: 'с. Красное',
                                data: []
                            }, {
                                name: 'с. Михайловка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Маячковская волость',
                        data: [
                            {
                                name: 'с. Белоцерковка',
                                data: []
                            }, {
                                name: 'с. Новая (Большая) Маячка',
                                data: []
                            }, {
                                name: 'с. Старая (Малая) Маячка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Ново-Троицкая волость',
                        data: [
                            {
                                name: 'с. Ново-Троицкое (Сарыбулат)',
                                data: []
                            }, {
                                name: 'с. Рождественское (Каракчи)',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Перво-Константиновская волость',
                        data: [
                            {
                                name: 'с. Перво-Константиновка (Мало-Чокрак)',
                                data: []
                            }, {
                                name: 'с. Строгоновка (Джайна)',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Покровская волость',
                        data: [
                            {
                                name: 'с. Васильевка',
                                data: []
                            }, {
                                name: 'с. Покровка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Чалбасская волость',
                        data: [
                            {
                                name: 'с. Костогрызовка',
                                data: []
                            }, {
                                name: 'с. Малые Копани',
                                data: []
                            }, {
                                name: 'с. Чалбасы',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Чаплынская волость',
                        data: [
                            {
                                name: 'с. Преображенка',
                                data: []
                            }, {
                                name: 'с. Чаплынка',
                                data: []
                            }, {
                                name: 'с. Чаплынско-Преображенка',
                                data: []
                            }
                        ]
                    }
                ]
            },
            {
                name: "Евпаторийский уезд",
                data: [
                    {
                        name: 'г. Евпатория',
                        data: []
            },
            {
                name: 'Агайская волость',
                data: []
            },
            {
                name: 'Донузлавская волость',
                data: []
            },
            {
                name: 'Камбарская волость',
                data: []
            },
            {
                name: 'Коджамбакская волость',
                data: []
            },
            {
                name: 'Кокейская волость',
                data: []
            },
            {
                name: 'Кунанская волость',
                data: []
            },
            {
                name: 'Сакская волость',
                data: []
            }]},
            {
                name: "Мелитопольский уезд",
                data: [
                    {
                        name: 'г. Мелитополь',
                        data: []
                    },
                    {
                        name: 'Агайманская волость',
                        data: [
                            {
                                name: 'с. Агайманы',
                                data: []
                            }, {
                                name: 'с. Таргаевка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Акимовская волость',
                        data: [
                            {
                                name: 'с. Акимовка',
                                data: []
                            }, {
                                name: 'д. Александровка',
                                data: []
                            }, {
                                name: 'д. Анновка',
                                data: []
                            }, {
                                name: 'д. Владимировка',
                                data: []
                            }, {
                                name: 'с. Даниловка',
                                data: []
                            }, {
                                name: 'д. Дмитриевка',
                                data: []
                            }, {
                                name: 'д. Домузлы',
                                data: []
                            }, {
                                name: 'д. Екатериновка',
                                data: []
                            }, {
                                name: 'д. Елизаветовка',
                                data: []
                            }, {
                                name: 'д. Михайловка',
                                data: []
                            }, {
                                name: 'д. Петровка',
                                data: []
                            }, {
                                name: 'с. Радионовка',
                                data: []
                            }, {
                                name: 'д. Терновка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Балковская волость',
                        data: [
                            {
                                name: 'с. Балки',
                                data: []
                            }, {
                                name: 'с. Благовещенка',
                                data: []
                            }, {
                                name: 'д. Елизаветовка',
                                data: []
                            }, {
                                name: 'д. Златополь',
                                data: []
                            }, {
                                name: 'с. Ивановка',
                                data: []
                            }, {
                                name: 'с. Орлянск',
                                data: []
                            }, {
                                name: 'д. Маячка',
                                data: []
                            }, {
                                name: 'д. Павловка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Васильевская волость',
                        data: [
                            {
                                name: 'д. Бурчак',
                                data: []
                            }, {
                                name: 'с. Васильевка',
                                data: []
                            }, {
                                name: 'д. Карачокрак',
                                data: []
                            }, {
                                name: 'с. Скельки',
                                data: []
                            }, {
                                name: 'д. Эристовка',
                                data: []
                            }, {
                                name: 'д. Янчекрак',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Велико-Белозерская волость',
                        data: [
                            {
                                name: 'с. Великая Белозерка',
                                data: []
                            }, {
                                name: 'с. Корнеевка',
                                data: []
                            }, {
                                name: 'с. Ново-Петровка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Верхне-Белозерская волость',
                        data: [
                            {
                                name: 'с. Белоозерск',
                                data: []
                            }, {
                                name: 'с. Верхняя Белозерка (Малая Белозерка)',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Верхне-Рогачицкая волость',
                        data: [
                            {
                                name: 'с. Верхний Рогачик',
                                data: []
                            }, {
                                name: 'с. Гюневка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Веселовская волость',
                        data: [
                            {
                                name: 'с. Веселое',
                                data: []
                            }, {
                                name: 'с. Гавриловка',
                                data: []
                            }, {
                                name: 'д. Елизаветовка',
                                data: []
                            }, {
                                name: 'д. Конотопка',
                                data: []
                            }, {
                                name: 'с. Менчикуры',
                                data: []
                            }, {
                                name: 'с. Ново-Ивановка',
                                data: []
                            }, {
                                name: 'д. Ново-Поповка',
                                data: []
                            }, {
                                name: 'с. Ново-Успеновка',
                                data: []
                            }, {
                                name: 'с. Пискошено',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Веселянская волость',
                        data: [
                            {
                                name: 'с. Веселянка',
                                data: []
                            }, {
                                name: 'д. Хитровка',
                                data: []
                            }, {
                                name: 'с. Царицын Кут (Приморское)',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Волконештская волость',
                        data: [
                            {
                                name: 'с. Волконешты (Волчанское)',
                                data: []
                            }, {
                                name: 'с. Терновка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Зеленовская волость',
                        data: [
                            {
                                name: 'с. Зеленое',
                                data: []
                            }, {
                                name: 'с. Малая Лепетиха',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Знаменская волость',
                        data: [
                            {
                                name: 'с. Большая Знаменка',
                                data: []
                            }, {
                                name: 'с. Ильинка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Иоганнесруская волость',
                        data: [
                            {
                                name: 'с. Гуттерталь (Кирпичное)',
                                data: []
                            }, {
                                name: 'с. Иоганнесруэ (Долинское)',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Каменская волость',
                        data: [
                            {
                                name: 'с. Водяное',
                                data: []
                            }, {
                                name: 'с. Днепровка',
                                data: []
                            }, {
                                name: 'с. Каменка (Малая Знаменка, Каменка-Днепровская)',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Лепатихская волость',
                        data: [
                            {
                                name: 'с. Великая Лепетиха',
                                data: []
                            }, {
                                name: 'с. Екатериновка',
                                data: []
                            }, {
                                name: 'д. Константиновка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Михайловская волость',
                        data: [
                            {
                                name: 'с. Волковка',
                                data: []
                            }, {
                                name: 'с. Матвеевка',
                                data: []
                            }, {
                                name: 'с. Михайловка',
                                data: []
                            }, {
                                name: 'с. Тимошовка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Нижне-Рогачицкая волость',
                        data: [
                            {
                                name: 'с. Бабино',
                                data: []
                            }, {
                                name: 'с. Бережанка',
                                data: []
                            }, {
                                name: 'с. Нижний Рогачик',
                                data: []
                            }, {
                                name: 'с. Ушкалка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Нижне-Серогозская волость',
                        data: [
                            {
                                name: 'с. Верхние Серогозы',
                                data: []
                            }, {
                                name: 'с. Верхние Торгаи',
                                data: []
                            }, {
                                name: 'с. Демьяновка',
                                data: []
                            }, {
                                name: 'с. Нижние Серогозы',
                                data: []
                            }, {
                                name: 'с. Нижние Торгаи',
                                data: []
                            }, {
                                name: 'с. Ново-Александровка',
                                data: []
                            }, {
                                name: 'с. Покровка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Охримовская волость',
                        data: [
                            {
                                name: 'с. Кирилловка',
                                data: []
                            }, {
                                name: 'с. Охримовка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Петровская волость',
                        data: [
                            {
                                name: 'с. Ивановка',
                                data: []
                            }, {
                                name: 'с. Калга',
                                data: []
                            }, {
                                name: 'с. Петровка',
                                data: []
                            }, {
                                name: 'д. Романовка',
                                data: []
                            }, {
                                name: 'с. Шотовка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Пришибская волость',
                        data: [
                            {
                                name: 'кол. Александргейм (список поселян-собственников за 1915 г.)',
                                data: 'Берегер, Бернгард, Бургарт Бернгард Бернгардов, Геберт, Гейер, \n' +
                                    'Герб, Грейлих Иосиф Антонович, Кистнер, Лаутеншлегер Иосиф \n' +
                                    'Матеасович, Лейер Иосиф Христофоров, Лупп Георг Фридрихович, \n' +
                                    'Пфлуг Филипп Георгов, Пфлунд Иосиф Иоганнович, Сингер, Трониман \n' +
                                    'Иосиф Адамов, Фрост Иосиф Эристов, Фукс, Церр, Шенкель'
                            }, {
                                name: 'кол. Альт-Монталь (список поселян-собственников за 1915 г.)',
                                data: 'Брет, Блеч Густав, Бургард Гейнрих Георгов, Вагнер, Гасс Фридрих, \n' +
                                    'Гехт Иоганн Христианов, Денцель, Иордан Христиан Яковлев, Кремер, \n' +
                                    'Лейппи Иоганн Иоганнов, Мартын Людвиг Николаусов, Шмидт Амандус \n' +
                                    'Людвигов, Шульц Карл Иоганнов'
                            }, {
                                name: 'кол. Альт-Нассау (Стрепетовка). Список поселян-собственников за 1915 г.',
                                data: 'Артеc Гейнрих Людвигович, Бланк Фридрих Фридрихов, Вертман, \n' +
                                    'Вибе Петр Абрамович, Ганерсон Флорентина Иоганновна, Гартвиг \n' +
                                    'Иоганн Иоганнович, Гертвиг Иоганн Гейнрихов, Гросс Александр \n' +
                                    'и Густав Готлибовы, Дель, Ленц, Моос Роберт Христианов, Попп, \n' +
                                    'Приб Иоганн Иоганнович, Рамм, Рихтер Эммануил Яковлев, Фей, \n' +
                                    'Цейгер Амалия Христиановна, Шелль Адольф Генрихов, Шефер Иоганн \n' +
                                    'Фридрихов, Шлегель Эдуард Христианович, Шмидт, Шпрингер, Штельвак \n' +
                                    'Гейнрих Данилов, Штром, Эсерт Иоганн Иоганнович, Эдиг'
                            }, {
                                name: 'кол. Андребург (список поселян-собственников за 1915 г.)',
                                data: 'Балес, Буш Иоганн Фридрихов, Верле Эманул Иоганов, Гасс Готлиб \n' +
                                    'Яковлевич, Гильц Яков Яковлевич, Дильман, Кох, Литтиг Тугенрейх \n' +
                                    'Готлибов, Ульрих Эдуард Филиппович, Фей Иоганн Генрихович, Фольц, \n' +
                                    'Фрикер, Шмидт, Шмитгаль Александр Яковлевич, Эберт, Экштейн Иоганн Иоганнов'
                            }, {
                                name: 'кол. Блюменталь (список поселян-собственников за 1915 г.)',
                                data: 'Бадер Иоганн, Бернгард, Больц Яков Карлов, Вальтер, Варт Петр \n' +
                                    'Георгов, Видовский, Витмер Антон Иосифов, Герб, Камерлог Петр \n' +
                                    'Петрович, Карх, Мумберг Иоганн Егоров, Пфейфер, Фогель Гейнрих, \n' +
                                    'Фукс, Ценглер, Шефер, Шлее, Эрллер'
                            }, {
                                name: 'кол. Вальдорф (список поселян-собственников за 1915 г.)',
                                data: 'Вальтер, Гардок, Кауль Лоренц Яковлевич, Эрлер, Эссерт Фридрих Георгов'
                            }, {
                                name: 'кол. Вассерау (Водное). Список поселян-собственников за 1915 г.',
                                data: 'Гарг Иоганн и Гейнрих Данииловы, Гаус Яков Лоренцов, Грюгер Яков \n' +
                                    'Георгиевич, Лерке Даниил Августович, Линк Эммануил Карлович, \n' +
                                    'Лучер, Отт Яков Михайлович, Пальмтах Фридрих Иоганнович, Ратке \n' +
                                    'Фридрих Фридрихович, Штоль Христиан Михайлович, Энес Эммануил \n' +
                                    'Фридрихович'
                            }, {
                                name: 'кол. Вейнау (Благодатное). Список поселян-собственников за 1915 г.',
                                data: 'Бланк Фридрих Фридрихов, Веймер, Ганш Яков Петров, Гауз, Дитер \n' +
                                    'Фридрих Фридрихов, Иордан, Отт, Пальмтаг Яков Иоганнов, Ценер, \n' +
                                    'Штоль Яков Михайлов'
                            }, {
                                name: 'кол. Гейдельберг (список поселян-собственников за 1915 г.)',
                                data: 'Бильман, Варт, Гардок Иоганн Валентинович, Геллер Гейнрих \n' +
                                    'Иосифович, Герти Павел Петров, Гласснер Рафаил Петров, Граф  \n' +
                                    'Георг Лоренцов, Грейлих Антон Антонов, Камерлогер, Каспер Матиас \n' +
                                    'Иосифович, Копп, Леболод Христофор Иоганнов, Мак, Матц Маргарита \n' +
                                    'Яковлевна, Морр, Пфейфер, Риттер, Сингер Иоганн Иоганнов, Томе \n' +
                                    'Филипп Георгиевич, Фишер Петр Иосифов, Шрепп Иосиф Яковлев, \n' +
                                    'Штейнер Филипп Иосифов, Эйзеле Мартын Яковлев, Эйзенкрейн Карл \n' +
                                    'Христофоров, Эппингер, Эрлер Гейнрих Иосифов, Юнгкинд Антон Антонов'
                            }, {
                                name: 'кол. Гофенталь (Чайкино). Список поселян-собственников за 1915 г.',
                                data: 'Бильфельд Гейнрих Иосифов, Вальтер Вильгельм Вильгельмов, Ганн \n' +
                                    'Готлиб Яковлев, Герстенбергер, Гольбек Александр Христианович, \n' +
                                    'Динкель, Ленц Фердинанд Карлов, Нефф Паулина Адамова, Нюрнберг \n' +
                                    'Андреас Михайлов, Пфефер Иоганн Лоренцович, Ригер, Руфф Роберт \n' +
                                    'Вильгельмович, Ценер Густав Готлибович, Шлижевский, Шмидт, Штейн \n' +
                                    'Теодор Яковлевич, Юнг'
                            }, {
                                name: 'кол. Гохштедт (список поселян-собственников за 1915 г.)',
                                data: 'Биркле Гейнрих Готфридович, Видман Иоганн Михайлов, Гартштейн, \n' +
                                    'Гауз Иоганн Лоренцев, Геринг Георг Георгов, Гормон Карл \n' +
                                    'Вильгельмов, Гофман Эдуард Карлов, Гукенгеймер, Гуссер Исаак \n' +
                                    'Николев, Девольд Адам Карлович, Келлер Георг Карлов, Кольб Готлиб \n' +
                                    'Готлибович, Кольмиллер Готлиб Францевич, Лучер Яков Фридрихов, \n' +
                                    'Морель Эдуард Исааков, Нейбергер Яков Иоганнович, Прейс Гейнрих \n' +
                                    'Касперов, Пробст Эдуард Фридрихович, Рапп Мартын Фридрихов, Теске \n' +
                                    'Даниил Фридрихович, Ульрих Отто Филиппов, Фейбергер Фридрих Петров, \n' +
                                    'Шиль, Шильце Вильгельм Андриасов, Шульц Вильгельм Иоганнович'
                            }, {
                                name: 'кол. Гохгейм (список поселян-собственников за 1915 г.)',
                                data: 'Берновский, Вальф Август Иоганнов, Варт Яков Георгиевич, Герб, \n' +
                                    'Класс, Классен Андреас, Мак, Приб Яков Иосифов, Пфейфер Фридрих \n' +
                                    'Ксафов, Риттер Яков Яковлев, Фридель, Фриден Иосиф Иосифов, Цер \n' +
                                    'Екатерина Иоганновна, Шлейхер, Штейнингер Филипп Иосифович, Яуфман'
                            }, {
                                name: 'кол. Гринталь (список поселян-собственников за 1915 г.)',
                                data: 'Арнольд Эдуард Вильгельмович, Блеч Даниил Иосифович, Буш Август \n' +
                                    'Фридрихович, Бек Фридрих Вильгельмович, Дильман Отто Яковлев, \n' +
                                    'Екель Фридрих Карлович, Зеель Иоганн Карлович, Ивель Фридрих \n' +
                                    'Карлов, Кеппель Готлиб Конрадович, Мельман, Фольц Вильгельм, Фриккер \n' +
                                    'Фридрих Францевич, Штейнингер'
                            }, {
                                name: 'кол. Карлсруэ (список поселян-собственников за 1915 г.)',
                                data: 'Альгеер Эмануил Христианович, Бишлер, Вертман Христиан Карлович, \n' +
                                    'Гофман Адам Яковлев, Кресс, Майер, Мертенс Август Готфридов, Ульман \n' +
                                    'Яков Николаев, Цейтер, Швицгебель, Шеллер Фридрих Георгов, Штихлинг, \n' +
                                    'Штол Андреас Михайлович, Шумахер Теофиль Людвигович'
                            }, {
                                name: 'кол. Костгейм (список поселян-собственников за 1915 г.)',
                                data: 'Бадер Николай Эммануилович, Больц Николай Карлов, Вейнингер Антон \n' +
                                    'Иосифов, Гардок, Гласнер Петр Иоганнов, Кайзер, Келлерман Эмануил \n' +
                                    'Петров, Лабер, Пфлуг Георг Георгов, Фукс Михаил Петров, Цейзер \n' +
                                    'Андреас Фридрихов'
                            }, {
                                name: 'кол. Кронcфельд (список поселян-собственников за 1915 г.)',
                                data: 'Бургер, Биркле, Гауз, Гениг Юлиус Августович, Геллерт, Гречман, \n' +
                                    'Кальбах Николай Яковлевич, Киндоп, Майер, Полле, Ульмер, \n' +
                                    'Фалькеншерн, Фридрих Иоганн Георгиевич, Цейтер, Шлегель Иоганн \n' +
                                    'Христианов, Штамлер Иоганн Иоганнов'
                            }, {
                                name: 'кол. Лейтерлаузен (список поселян-собственников за 1915 г.)',
                                data: 'Гардок, Гласнер, Гольц, Келлерман Антон Августов, Кольмиллер, Кунц \n' +
                                    'Андреас Валентинов, Пфейфер Иосиф Антонов, Сингер, Шиндлер, Шреп \n' +
                                    'Екатерина Антоновна, Юнгкинд Иосиф Леопольдов'
                            }, {
                                name: 'кол. Мариагейм (список поселян-собственников за 1915 г.)',
                                data: 'Адэ Антон Иоганнов, Ангальд Петр Францович, Геберт, Гардок, \n' +
                                    'Гейер Яков Иоганнович, Грейлих Иоганн Адамович, Гуменник Фридрих \n' +
                                    'Петрович, Камерлогер Яков Иоганнович, Мац Антон Христианович, \n' +
                                    'Фукс Петр Петрович, Цейзер Фридрих Фридрихович'
                            }, {
                                name: 'кол. Ней-Монталь (список поселян-собственников за 1915 г.)',
                                data: 'Байтингер Яков Фридрихов, Бишлер, Ваккер, Вальтер Яков Яковлевич, \n' +
                                    'Гилунг Георгий Георгиевич, Гофман Фридрих Петрович, Гроссе \n' +
                                    'Эрдгард-Иоганн Иоганнов, Зеель Даниил Карлов, Кефер, Киблер Карл \n' +
                                    'Михайлов, Лейппи Мартин Иоганнович, Люц Густав Христофоров, Мерман \n' +
                                    'Иоганн Иоганнов, Насейде, Нейзер Яков Гейнрихов, Пальмтах Иоганн \n' +
                                    'Иоганнович, Пфефер Филипп Лоренцов, Рихтер Адам Давидов, Шенеман \n' +
                                    'Гейнрих Иоганнов, Шпрингер Абрам Абрамович, Шульц Филипп Иоганнович'
                            }, {
                                name: 'кол. Ней-Насау (список поселян-собственников за 1915 г.)',
                                data: 'Артес, Вернер Яков Вильгельмов, Гартштейн Карл Фридрихович, \n' +
                                    'Гауз Христиан Готлибович, Герберсгаген Карл Иоганнович, Гукенгемер \n' +
                                    'Эдуард и Георг Фридриховичи, Дель, Кольмиллер Готлиб, Лерг \n' +
                                    'Екатерина, Нейзер, Редер Варвара Иосифовна, Ульрих Филипп \n' +
                                    'Филиппович, Шнейдер Карл Яковлев, Шрелле Карл Матвеев, Эссерт \n' +
                                    'Иоганн Иоганнович',
                            }, {
                                name: 'кол. Николайфельд (список поселян-собственников за 1915 г.)',
                                data: 'Байтингер, Вальтер Матиеус Матиеусов, Гасс Густав Даниилов, Гауз \n' +
                                    'Гейнрих Лоренцович, Гехт Отт Христианович, Гильц Иоганн Иаковлев, \n' +
                                    'Граб Фридрих Иоганнов, Дильман Яков Иоганнов, Киндопп, Кофинск Яков \n' +
                                    'Христианов, Майер Яков Георгиев, Мельман Густав Яковлев, Ульмер, \n' +
                                    'Цибарт Иоганн Христианов, Штрекер Яков Яковлев, Эйтейнеер Фридрих Фридрихов'
                            }, {
                                name: 'с. Пришиб (список поселян-собственников за 1915 г.)',
                                data: 'Вагнер, Гайдт, Гайдт Траугот Людвигович, Гауз Яков Христианович, \n' +
                                    'Гейне, Гейнрих Фридрих Адамович, Герман, Герт Яков Яковлевич, \n' +
                                    'Глейх, Гофман, Дильман, Динкель, Зейтц Фридрих Карлович, \n' +
                                    'Зильбернагель Карл Конрадович, Кебс Петр Иосифович, Клейн Александр \n' +
                                    'Михайлович, Клейнингер Христиан Иоганнович, Крес Катерина Францевна, \n' +
                                    'Крафт Эмилия Иоганновна, Майер, Мартин Эммануил Иосифович, Моос, \n' +
                                    'Нольде Карл Килианов, Приб, Раговская Амалия Мартыновна, Рамакер \n' +
                                    'Флорентина Францовна, Рамм Генрих Фридрихович, Слижевский Вильгельм \n' +
                                    'Даниилович, Тренкеншу Иоганн Яковлев, Ульман, Фей Петр Георгиевич, \n' +
                                    'Фогель, Фослер Килиан, Ценнер Иоганн Христианович, Шлижевский \n' +
                                    'Вильгельм Данилович, Шмидт, Шпарвасер Иоганн, Штарк Лебрех Августович, \n' +
                                    'Штреле Барбара, Шульц Иоганн Готфридович'
                            }, {
                                name: 'кол. Рейхенфельд (список поселян-собственников за 1915 г.)',
                                data: 'Бауэр, Бек, Биркле, Бишлер Густав Августович, Бюллер Михаил \n' +
                                    'Иоганнович, Ванзидлер Гейнрих Михайлов, Ветштейны Иоганн и Карл \n' +
                                    'Карловы, Гау, Гауз, Гофман, Гречман Филипп Иоганнович, Зейбель \n' +
                                    'Вильгельм Конрадов, Зейлиг, Кальмбах Август Яковлевич, Кремзер Карп \n' +
                                    'Иоганнов, Кригер, Лейппи, Лоренц, Лутчер Георг Мартынович, Май \n' +
                                    'Гейнрих Яковлев, Мартын Даниил Яковлев, Морост Иоганн Данилов, \n' +
                                    'Нейзер Иоганн и Даниил Фридриховы, Приб, Фей Иоганн Иоганнович, \n' +
                                    'Фрейндт Доротея Фридриховна, Шац Густав Адамов, Шлегель Конрад \n' +
                                    'Христианов, Штейнингер Эдмунд Яковлев, Штихлинг, Эшнаур'
                            }, {
                                name: 'кол. Розенталь (список поселян-собственников за 1915 г.)',
                                data: 'Бенке Яков, Вальтер Рейнгод Адамов, Ганске Готлиб Георгиевич, \n' +
                                    'Гасс Вильгельм Христианович, Гейн Фридрих Фридрихов, Гехт Иоганн \n' +
                                    'Иоганнович, Гилунг Отто Иоганнович, Динкель Луиза, Камерлог Филипп \n' +
                                    'Иоганнович, Кеппель, Кох Мартын Петрович, Линк Вильгельм Готфридов, \n' +
                                    'Ляутеншлегер Эмануил Адамович, Мельм Гейнрих Филиппович, Ратке \n' +
                                    'Фридрих Фридрихов, Рунг, Сар Килиан Данилов, Теске, Ульман, Шиль \n' +
                                    'Готлиб Яковлевич, Штейнингер Эдуард Яковлевич, Штреккер'
                            }, {
                                name: 'кол. Тифенбрун (список поселян-собственников за 1915 г.)',
                                data: 'Вейс, Вехтер, Гехт, Гилинг, Гильц, Идлер Гейнрих Гейнрихов, Лейппи, \n' +
                                    'Линда Яков Мартынов, Мертин Фридрих Иоганнович, Попп Фридрих \n' +
                                    'Фридрихович, Пфейфер Килиан Лоренцев, Фондис, Фурман, Шмитгаль, \n' +
                                    'Штамлер Иоганн Яковлев, Штрошерер, Шулер Мария, Эмиш Иоганн и Христиан \n' +
                                    'Иоганновы, Эссер Фридрих Фридрихов'
                            }, {
                                name: 'кол. Фридрихсфельд (список поселян-собственников за 1915 г.)',
                                data: 'Альгеер, Баллес Фридрих Георгов, Блеч Георг Иосифов, Байтингер, \n' +
                                    'Бальке Карл Фридрихов, Бихе Яков Георгов, Геберсгаген, Гильц Петр \n' +
                                    'Иоганнов, Горай Гейнрих Яковлев, Гофман, Грюнер, Дитер Теофил \n' +
                                    'Конрадов, Камерлох Фридрих Гейнрихов, Коппель Теодор Конрадович, \n' +
                                    'Кох, Кремзер Михаил Иоганнович, Лен, Лорай Гейнрих Яковлевич, Отто \n' +
                                    'Андриас Готлибов, Ратке, Рихтер Вильгельм Давидов, Ульмер Яков \n' +
                                    'Яковлев, Фогель Август Иоганнович, Фурман Адам Даниилович, Шац Яков \n' +
                                    'Готфридович, Экштейн, Энгель Адам-Христофоров'
                            }
                        ]
                    },
                    {
                        name: 'Рубановская волость',
                        data: [
                            {
                                name: 'с. Николаевка',
                                data: []
                            }, {
                                name: 'с. Рубановка (списки фамилий за 1851-52 гг.)',
                                data: 'Бабанин, Белохватов, Бойко, Борсук, Вареха, Витренко, Воробьев, \n' +
                                    'Горлов, Гридасов, Дидык, Дидыченко, Дорохов, Ермак, Жиронкин, \n' +
                                    'Закалюжный, Звегинцов, Зинченко, Каличенко, Каменев, Кишкин, \n' +
                                    'Коваленко, Коломийченко, Колосов, Комарев, Корж, Коц, Крючков, \n' +
                                    'Ландарь, Литвиненко, Максименко, Медведский, Митрофанов, Москалев, \n' +
                                    'Мусиенко, Муха, Мухин, Мяснянкин, Онищенко, Павлюк, Пахомов, \n' +
                                    'Перерва, Пирог, Позняк, Польской, Попов, Проскурин, Проценко, \n' +
                                    'Ралко, Романенко, Русанов, Рябинин, Рядинский, Светловский, \n' +
                                    'Семенов, Сисоев, Скрипец, Слюсарь, Собакин, Сапронов, Струков, \n' +
                                    'Ступак, Таран, Татаринцов, Титов, Трунов, Трухманов, Улин, Ушаков, \n' +
                                    'Федорцов, Фесик, Харин, Хижняк, Хорбатко, Хуртовский, Чуйков, \n' +
                                    'Ширин, Шишлаков, Шокоров, Яковенко, Якунин'
                            }]
                    },
                    {
                        name: 'Терпеньевская волость',
                        data: [
                            {
                                name: 'с. Богдановка',
                                data: []
                            }, {
                                name: 'с. Кизияр (список фамилий за 1883 г.)',
                                data: 'Ануфриев, Арсененко, Борисенко, Буряк, Вакуленко, Вдовиченко, \n' +
                                    'Гаркуша, Герасименко, Глеков, Глушко, Горбань, Деркач, Джмиль, \n' +
                                    'Дудка, Евтиков, Еременко, Жадан, Зинченко, Зинюхов, Ильченко, Квач, \n' +
                                    'Киреев, Кириленко, Клещ, Коваленко, Козлов, Копиченко, Кошиль, \n' +
                                    'Кравченко, Курдубан, Лабинцов, Лагода, Лебедь, Лоза, Ломоносов, \n' +
                                    'Лупарев, Лысенко, Мазин, Мелаш, Молодчик, Мороз, Овдиенко, Огурцов, \n' +
                                    'Опришка, Педан, Передерий, Петрак, Пинчук, Погибайло, Поясов, \n' +
                                    'Приступа, Прокопенко, Прядко, Романюта, Ротань, Рубан, Санин, Свищ, \n' +
                                    'Сердюков, Синеокий, Скороход, Солотин, Тарасенко, Удовиченко, \n' +
                                    'Федоров, Филоненко, Хрипун, Четвериков, Шелудько, Шинкаренко, \n' +
                                    'Щербаченко, Юшка, Ярмак'
                            }, {
                                name: 'с. Ново-Богдановка',
                                data: []
                            }, {
                                name: 'с. Ново-Николаевка',
                                data: []
                            }, {
                                name: 'д. Ново-Павловка',
                                data: []
                            }, {
                                name: 'с. Песчаное',
                                data: []
                            }, {
                                name: 'с. Семеновка',
                                data: []
                            }, {
                                name: 'с. Спасское',
                                data: []
                            }, {
                                name: 'с. Тамбовка',
                                data: []
                            }, {
                                name: 'с. Терпенье',
                                data: []
                            }, {
                                name: 'с. Троицкое',
                                data: []
                            }, {
                                name: 'с. Федоровка',
                                data: []
                            }
                        ]
                    },
                    {
                        name: 'Эйгенфельдская волость',
                        data: [
                            {
                                name: 'кол. Александрфельд (список поселян-собственников за 1915 г.)',
                                data: 'Билер, Ванзиндлер Фридрих Иоганнович, Вирт Иоган Иоганович, Галлер, \n' +
                                    'Гиллут, Гиллунг, Девальд, Келлер, Керхер, Крауз Яков Готфридович, \n' +
                                    'Лейних Готфрид Фридрихович, Лупп Георг Фридрихович, Мейнцер, Мелер, \n' +
                                    'Ноль, Позен Иоганн Иоганнович, Тоблер Готлиб Карлович, Фогель \n' +
                                    'Людвиг Людвигович, Фрешер Петр Михайлович, Ценер Густав и Яков \n' +
                                    'Яковлев, Шейреле Яков Христианович, Шлегель Христиан Иоганнович, \n' +
                                    'Шлехт Гейнрих Фридрихович, Шмидт, Шредер Иоганн Иоганнович'
                            }, {
                                name: 'кол. Дармштадт (список поселян-собственников за 1915 г.)',
                                data: 'Август Христиан Христианович, Браун Карл Карлович, Вальтер Филипп \n' +
                                    'Вильгельмович, Ванзидлер, Ветштейн, Гартвиг Адольф Христианович, \n' +
                                    'Гречман, Дерхо Карл Петрович, Думлер Генрих Генрихович, Кригер \n' +
                                    'Христиан Христианов, Лейпих, Никкель Адольф Фердинандов, Нюрнберг, \n' +
                                    'Фалькенштерн, Шлехт, Шмидт, Эйгерис'
                            }, {
                                name: 'кол. Кайзерталь (список поселян-собственников за 1915 г.)',
                                data: 'Бекк Христиан Андреасов, Брейт Фридрих Даниилович, Бургардт, Вебер \n' +
                                    'Готфрид Валентинов, Зель Христиан Карлович, Кине Эмилия Иоганновна, \n' +
                                    'Кирхмейер Рафаил Августович, Лучер Иоганн Христианович, Мейер \n' +
                                    'Георг Георгиевич, Полле, Реннер, Ульрих, Фель, Фуст Иоганн Иоганнов, \n' +
                                    'Шмидт'
                            }, {
                                name: 'кол. Мариенфельд (список поселян-собственников за 1915 г.)',
                                data: 'Бишлер, Ванзилдер Иоганн Теодорович, Вецель Фридрих Фридрихович, \n' +
                                    'Ган Рейнгольд Готлибович, Гофман, Кемф Карл Христианович, Конрад \n' +
                                    'Иоган Фридрихович, Кремзер Христиан Христианович, Лебтах, Лейппи \n' +
                                    'Генрих Генрихович, Лоренц, Меллер Яков Генрихович, Реннер Фридрих \n' +
                                    'Христианович, Фалькенштерн Христиан Адамович, Шац Вильгельм \n' +
                                    'Вильгельмов, Шмидт Иоганн Иоганнович'
                            }, {
                                name: 'кол. Чехоград (Новгородковка)',
                                data: []
                            }, {
                                name: 'кол. Эйгенфельд (Поляновка). Список поселян-собственников за 1915 г.',
                                data: 'Абб Георг Георгиевич, Бургард Готлиб Францевич, Бух Юлиана \n' +
                                    'Вильгельмовна, Вальтер Густав Фридрихович, Вейс, Вецель Генрих \n' +
                                    'Георгиевич, Галлер Фридрих Георгиевич, Гехт, Ган, Гофман Георг \n' +
                                    'Августович, Дитер Иоганн Андреасов, Дрягер Эмилия Карловна, Зеель, \n' +
                                    'Зелиг Филипп Готфридович, Кирхмейр Иоганн Филиппович, Кремзер Яков \n' +
                                    'Яковлевич, Лер Теодор Иоганнович, Линд Петр Иоганнов, Лучер, Манн \n' +
                                    'Карл Фридрихов, Нейбергер, Оберландер Георг Матиасов, Приб, Репп, \n' +
                                    'Ульрих Христиан Иоганнович, Фрешер Мартин Готлибович, Шамей Яков \n' +
                                    'Августович, Шлегель, Шмидт Яков Христианович, Штол Даниил \n' +
                                    'Георгиевич, Шумахер Адам Яковлевич, Юнг Иоганн Карлович'
                            }
                        ]
                    },
                    {
                        name: 'Юзкуйская волость',
                        data: [
                            {
                                name: 'с. Геническ',
                                data: []
                            }, {
                                name: 'с. Ново-Григорьевка',
                                data: []
                            }, {
                                name: 'с. Стокопани',
                                data: []
                            }, {
                                name: 'с. Юзкуй (Вольное)',
                                data: []
                            }
                        ]
                    }
                ]
            },
            {
                name: "Перекопский уезд",
                data: [
                    {
                        name: 'г. Перекоп',
                        data: []
            },
            {
                name: 'Ак-Шеихская волость',
                data: [
                    {
                        name: 'с. Аджи-Ахмат (Табачное)',
                        data: []
                    }, {
                        name: 'д. Акимовка (Казанки)',
                        data: []
                    }, {
                        name: 'с. Ак-Шеих (Раздольное)',
                        data: []
                    }, {
                        name: 'д. Акчора (Васильевка)',
                        data: []
                    }, {
                        name: 'д. Антониновка',
                        data: []
                    }, {
                        name: 'д. Баботай (Болотное)',
                        data: []
                    }, {
                        name: 'д. Большой Кут',
                        data: []
                    }, {
                        name: 'д. Байгончик Новый (Октябрь)',
                        data: []
                    }, {
                        name: 'д. Байгончик Старый (Пирогово)',
                        data: []
                    }, {
                        name: 'д. Барын (нем., Стальное). Члены товарищества в 1915 г.',
                        data: 'Бухман Андреас Иванов, Вальц, Кайзер Генрих Яковлев, Рапп \n' +
                            'Христиан Давыдов, Сутер Иоганнес и Петр Петровы, Фоленвейдер, \n' +
                            'Штоль Гейнрих Карлов'
                    }, {
                        name: 'д. Барын тат. (Озерки)',
                        data: []
                    }, {
                        name: 'д. Баш-Киргиз (Кунцево)',
                        data: []
                    }, {
                        name: 'д. Бийгазы (Кирсановка)',
                        data: []
                    }, {
                        name: 'д. Большой Кут',
                        data: []
                    }, {
                        name: 'д. Владимировка (Апрелевка)',
                        data: []
                    }, {
                        name: 'д. Джага-Кипчак',
                        data: []
                    }, {
                        name: 'д. Джанкой Северный (Любимовка)',
                        data: []
                    }, {
                        name: 'д. Джанкой Средний (Утиное)',
                        data: []
                    }, {
                        name: 'д. Джумаш-Кирк (Морозово)',
                        data: []
                    }, {
                        name: 'д. Дулат (нем., Зоркино). Члены сельского общ-ва в 1915 г.',
                        data: 'Антони Петр Михайлов, Бадер Эгидий и Михаил Иогановы, \n' +
                            'Гернер Петр Францович, Грамлих Бернгард Фридрихов, Кернер, \n' +
                            'Рукгабер Яков Михайлов, Фитерер Генрих и Петр Иоганновы, \n' +
                            'Шайдер Филипп Яковлев, Шерер Адам Генрихович'
                    }, {
                        name: 'д. Ириновка',
                        data: []
                    }, {
                        name: 'д. Казанки (Сенокосное)',
                        data: []
                    }, {
                        name: 'д. Камаджи (Заречное)',
                        data: []
                    }, {
                        name: 'д. Камбар (Перепелкино)',
                        data: []
                    }, {
                        name: 'д. Караджа-Кат (Видное)',
                        data: []
                    }, {
                        name: 'д. Карангит (Пшеничное)',
                        data: []
                    }, {
                        name: 'д. Кельдыбай (Корнеевка)',
                        data: []
                    }, {
                        name: 'д. Кипчак (Кринички)',
                        data: []
                    }, {
                        name: 'д. Колай Месит',
                        data: []
                    }, {
                        name: 'д. Култамак (нем., Нежинское). Члены сельского общ-ва в 1915 г. ',
                        data: 'Вагнер, Веккер Яков Яковлевич, Гампер Генрих Генрихов, Клоц \n' +
                            'Самуил Иванов, Мерц, Райзер Христиан Христианович, Риккер, Фель \n' +
                            'Христиан Иванов, Цейс Юлия Готлибова, Шиликовская Каролина Христианова'
                    }, {
                        name: 'д. Куремес (Армейское)',
                        data: []
                    }, {
                        name: 'д. Куремес Месит (Сафьяновка)',
                        data: []
                    }, {
                        name: 'д. Моллалар (Смежное)',
                        data: []
                    }, {
                        name: 'д. Макут (Луговое)',
                        data: []
                    }, {
                        name: 'д. Мангит (Коврово)',
                        data: []
                    }, {
                        name: 'д. Ново-Александровка (Таганашмин, Великоселье)',
                        data: []
                    }, {
                        name: 'д. Ногайчи Ахмат (Червоное)',
                        data: []
                    }, {
                        name: 'д. Сейтлер (Нижнегорский)',
                        data: []
                    }, {
                        name: 'д. Сивашное',
                        data: []
                    }, {
                        name: 'д. Стефановка',
                        data: []
                    }, {
                        name: 'с. Тарханлар (нем., Победное). Члены сельского общ-ва в 1915 г.',
                        data: 'Биргольц Христиан Иоганов, Вагнер Михаил Михаилов, Веккер, \n' +
                            'Гагины Фридрих и Карл Фридриховичи, Кнауер Яков Яковлев, Краутер, \n' +
                            'Принц, Райзер Самуил Христианов, Це Яков Михайлов'
                    }, {
                        name: 'д. Тереклы Абаш (Прозрачное)',
                        data: []
                    }, {
                        name: 'д. Тобен (Аллейное)',
                        data: []
                    }, {
                        name: 'д. Чуча (нем., Межевое). Члены сельского общ-ва в 1915 г.',
                        data: 'Бромер, Вильд, Гейгер Георг Сильвестров, Кауц Христиан Михайлович, \n' +
                            'Клоц Иоганес Иоганесович, Кохендерфер, Лайер Христиан Иоганесович, \n' +
                            'Млейнек Вильгельм Вильгельмов, Принц, Траутер, Фель, Штек'
                    }, {
                        name: 'д. Шейхлар (Заливное)',
                        data: []
                    }, {
                        name: 'д. Шибань (Лужки)',
                        data: []
                    }, {
                        name: 'д. Ширин (Славянское)',
                        data: []
                    }, {
                        name: 'д. Эльгеры-Чуча (Линейное)',
                        data: []
                    }
                ]
            },
            {
                name: 'Александровская волость',
                data: [
                    {
                        name: 'с. Айбары (Войково)',
                        data: []
                    }, {
                        name: 'д. Алгазы-Конрат (Победино)',
                        data: []
                    }, {
                        name: 'с. Александровка',
                        data: []
                    }, {
                        name: 'дер. Андреевка',
                        data: []
                    }, {
                        name: 'пос. Антоновка (Курман-Кемельчи)',
                        data: []
                    }, {
                        name: 'д. Аргин (тат.)',
                        data: []
                    }, {
                        name: 'д. Ачкора (Гвардейское)',
                        data: []
                    }, {
                        name: 'д. Биюк-Караджа (Чижовка)',
                        data: []
                    }, {
                        name: 'д. Биюк-Конрат (Братское)',
                        data: []
                    }, {
                        name: 'д. Биюк-Корджав (Чкалово)',
                        data: []
                    }, {
                        name: 'д. Боз-Гоз (Весеневка)',
                        data: []
                    }, {
                        name: 'д. Боз-Гоз-Китай (Спокойный)',
                        data: []
                    }, {
                        name: 'д. Даниловка',
                        data: []
                    }, {
                        name: 'д. Джамбу-Челеби (Разино)',
                        data: []
                    }, {
                        name: 'д. Джанболду (нем., Находка). Члены товарищества в 1915 г.',
                        data: 'Бюллер Яков Фридрихович, 284 дес. и усадьба; Майер Конрад Яковлев, \n' +
                            '500 д. и усадьба; Миллер Христиан Фридрихов, 500 дес. и усадьба'
                    }, {
                        name: 'д. Джангара-Кемельчи (Видное)',
                        data: []
                    }, {
                        name: 'д. Девлет-Али (Свердловское)',
                        data: []
                    }, {
                        name: 'д. Ишунь-Немецкий (Шапталай, Ковыльное). Члены товарищества в 1915 г.',
                        data: 'Герцен Петр Петров, Завадский Корнелий Корнелиусов, Пенер Герман \n' +
                            'Вильгельмович, Фот Вильгельм Фридрихов, Янцен Дитрих Петров'
                    }, {
                        name: 'д. Кадыр-Аджи (Малое)',
                        data: []
                    }, {
                        name: 'д. Карагоджа',
                        data: []
                    }, {
                        name: 'д. Кара-Софу',
                        data: []
                    }, {
                        name: 'д. Караул Джангара (Карповка)',
                        data: []
                    }, {
                        name: 'д. Кара Чокмак (Красная Поляна)',
                        data: []
                    }, {
                        name: 'д. Кендже-Ташлы-Конрат (Бутовка)',
                        data: []
                    }, {
                        name: 'д. Кият (Ближнее)',
                        data: []
                    }, {
                        name: 'д. Кодагай (нем., Вишняковка). Члены сельского общ-ва в 1915 г.',
                        data: 'Валл, Вибе Петр Яковлевич, Дик Иоганн Иоганнович, Мейер Конрад \n' +
                            'Яковлевич, Фаст Бернгард Бернгардович'
                    }, {
                        name: 'д. Кончи-Шавва (Краснодарка)',
                        data: []
                    }, {
                        name: 'д. Кудьяр',
                        data: []
                    }, {
                        name: 'д. Самав (нем., Известковое). Члены сельского общ-ва в 1915 г.',
                        data: 'Вейнднер, Гарвард, Миллер Яков Георгович, Приб Эдуард Христианович, \n' +
                            'Эйзенбраун'
                    }, {
                        name: 'д. Сырт-Каракчора (Даниловка)',
                        data: []
                    }, {
                        name: 'д. Ташлы-Кипчак (Клепинино)',
                        data: []
                    }, {
                        name: 'д. Ташлы-Конрат (Красноармейское)',
                        data: []
                    }, {
                        name: 'д. Ташлы-Шейх-Эли (Беседино)',
                        data: []
                    }, {
                        name: 'д. Темир-Джурек-Ишунь (Ястребовка)',
                        data: []
                    }, {
                        name: 'д. Тереклы-Ишунь (Анастасьево)',
                        data: []
                    }, {
                        name: 'д. Топай-Кемельчи',
                        data: []
                    }, {
                        name: 'хут. Тюбий (Зерновое)',
                        data: []
                    }, {
                        name: 'д. Цареквич (Пушкино)',
                        data: []
                    }, {
                        name: 'д. Эльгеры-Каракчора (Горловка)',
                        data: []
                    }, {
                        name: 'хут. Япунджа (Выпасное)',
                        data: []
                    }
                ]
            },
            {
                name: 'Богемская волость',
                data: []
            },
            {
                name: 'Бютеньская волость',
                data: []
            },
            {
                name: 'Воинская волость',
                data: []
            },
            {
                name: 'Джурчинская волость',
                data: [
                    {
                        name: 'д. Акмечет-Найман (нем., Щедрово)',
                        data: []
                    }, {
                        name: 'хут. Арджак Джабу (Абрикосово)',
                        data: []
                    }, {
                        name: 'с. Байказак',
                        data: []
                    }, {
                        name: 'д. Биеч-Найман (Столбцы)',
                        data: []
                    }, {
                        name: 'д. Биюк Бараш (Безлесное)',
                        data: []
                    }, {
                        name: 'д. Биюк Бишкара (Курганное)',
                        data: []
                    }, {
                        name: 'д. Воронцовка',
                        data: []
                    }, {
                        name: 'д. Джавгачты',
                        data: []
                    }, {
                        name: 'д. Джан-Сакал-Мангит',
                        data: []
                    }, {
                        name: 'д. Джелишай (Сокол)',
                        data: []
                    }, {
                        name: 'с. Джурчи (Первомайское)',
                        data: []
                    }, {
                        name: 'хут. Дюрмен (Максимовка)',
                        data: []
                    }, {
                        name: 'д. Кирей-Табор (Макаровка)',
                        data: []
                    }, {
                        name: 'д. Кият-Орка (Упорное)',
                        data: []
                    }, {
                        name: 'д. Когенлы (Когенлы-Кият, Крапивное)',
                        data: []
                    }, {
                        name: 'д. Конурбай',
                        data: []
                    }, {
                        name: 'с. Куллар-Кипчак (нем., Красная Равнина). Члены сел. общ-ва в 1915 г.',
                        data: 'Бауэр, Гальтер Генрих Генрихович, Гооге Фридрих Фридрихович, Люц \n' +
                            'Вильгельм Якубович, Титц Иосиф Августович, Траутер Фридрих Георгиевич, \n' +
                            'Ульман Фридрих Фридрихович, Швайцер, Шредер Вильгельм Георгиевич, \n' +
                            'Штарк Фридрих и Готлиб Георговы'
                    }, {
                        name: 'д. Кутюке нем. (Мельничное). Члены сельского общ-ва в 1915 г.',
                        data: 'Вилемс Гергард Гергардович, Винс Якуб Францович, Вольгемут, Гамша \n' +
                            'Устиния Карловна, Кетлер Иоган Иоганов, Энс Класс Гергардович'
                    }, {
                        name: 'д. Кутюке тат. (Златополь)',
                        data: []
                    }, {
                        name: 'хут. Мамут-Чегер-Декчи (Полтавское)',
                        data: []
                    }, {
                        name: 'д. Онгар-Найман-Каланчак (Трактовое)',
                        data: []
                    }, {
                        name: 'д. Онгар-Найман-Чалбас (Майорское)',
                        data: []
                    }, {
                        name: 'хут. Орман Аджи (Калинино)',
                        data: []
                    }, {
                        name: 'экон. Сафроновка',
                        data: []
                    }, {
                        name: 'д. Токульчак (нем., Гришино). Члены сельского общ-ва в 1915 г.',
                        data: 'Гардер Абрагам Абрагамович, Дик, Дирксен Корнелиус Генрихович, Изак \n' +
                            'Генрих Генрихович, Никель Иоган Якубов, Унру Абрагам Веньяминович, \n' +
                            'Фитерер Фридрих Генрихович, Шперлинг, Эзау Генрих Генрихович, Эпп'
                    }, {
                        name: 'д. Учевли-Орка (нем., Пшеничное). Члены сельского общ-ва в 1915 г.',
                        data: 'Байдингер Людвиг Иосифович, Биркле, Гааб Рудольф Егорович, Гарвард, Илле, \n' +
                            'Кек Иоган Классов, Кин Адольф Иоганов, Лучер, Майер Иоган Иоганович, Сейман \n' +
                            'Андриан Готлибов, Шицле Теодор Христианович, Штробель Симон Иоганович'
                    }, {
                        name: 'д. Чалбаш Джурчи',
                        data: []
                    }, {
                        name: 'с. Шигим (Матвеевка)',
                        data: []
                    }, {
                        name: 'хут. Якшибай (Хорошево)',
                        data: []
                    }
                ]
            },
            {
                name: 'Тотанайская волость',
                data: [
                    {
                        name: 'д. Адаргин (нем. Шенбрун, Мускатное). Члены сельского общ-ва в 1915 г.',
                        data: 'Ауингер Иоган Иосифов, Бейерле Конрат Яковлев, Блюм, Брейтмейер \n' +
                            'Адольф Эдуардов, Броммер, Готман Фридрих Иосифов, Каник Самуил Яковлев, \n' +
                            'Кнаутер Яков Яковлев, Майер, Мейстер Эдуард Готлибов, Принц Аврам \n' +
                            'Матвеев, Риккеры Давид и Отто Генрихов, Фель Яков Яковлев, Фальк Иоган Иоганов'
                    }, {
                        name: 'д. Аксюру-Конрат (нем., Кондратьево). Члены товарищества в 1915 г.',
                        data: 'Брейтюнбехер, Вейгум Карл Даниил, Губер Луиза, Пфейфер Фридрих и Петр \n' +
                            'Вильгельмовичи, Приб Адольф и Алесандр Иоганновичи, Шварцман Яков Яковлевич, Штоль'
                    }, {
                        name: 'д. Башлыча (Трудовое)',
                        data: []
                    }, {
                        name: 'д. Бекказы (нем. Гебрун, Рубиновка). Члены товарищества в 1915 г.',
                        data: 'Валькер Александр и Готлиб Готлибовы, Гауфлер Готлиб Яковлев, Горлебаус \n' +
                            'Андреас Иоганесов, Готман, Гофман Адам Петров, Рау Ядам Адамов, Швамм \n' +
                            'Готфрид Яковлев'
                    }, {
                        name: 'д. Бек-Болатчи (Акимовка)',
                        data: []
                    }, {
                        name: 'д. Борлак (Краснодольное)',
                        data: []
                    }, {
                        name: 'д. Вакуф Кара Тотанай (Полевое)',
                        data: []
                    }, {
                        name: 'д. Владиславка',
                        data: []
                    }, {
                        name: 'хут. Джав-Борю (Тихомировка)',
                        data: []
                    }, {
                        name: 'хут. Джага-Баши (Лисички)',
                        data: []
                    }, {
                        name: 'хут. Джаркуй (Серноводское)',
                        data: []
                    }, {
                        name: 'д. Карамин (нем., Михайловка). Члены сельского общ-ва в 1915 г.',
                        data: 'Бош Иосиф, Гаук Венделин и Иосиф, Деккер Михаил, Дик, Мозер Фридрих, \n' +
                            'Нейгум, Фаут, Фитерер Матеас, Шефер Иосиф, Энес, Янгула Франц'
                    }, {
                        name: 'д. Карангут (Арбузовка)',
                        data: []
                    }, {
                        name: 'п-к Каранкурт (ж/д ст. Отрадная)',
                        data: []
                    }, {
                        name: 'д. Коджангул (Чергеева, Ковали)',
                        data: []
                    }, {
                        name: 'д. Коктеин (нем. Берлин, Плодородное). Члены товарищества в 1915 г.',
                        data: 'Гаар Иоанн и Яков Годфридов, Горне Иоганнес Иосифович, Гурлебаус \n' +
                            'Фридрих Иоганнович, Гюнтнер, Дубс Христиан Фридрихович, Мюллер, Нусс \n' +
                            'Александр Иоганнесович, Фраш Иосиф Иоганнесович, Эйзенбраун'
                    }, {
                        name: 'д. Кульоба (нем., Невское). Члены сельского общ-ва в 1915 г. ',
                        data: 'Гаар Филипп и Вильгельм Готфридовы, Горне, Гюнтнер, Дубс Вильгельм \n' +
                            'Фридрихов, Лорер, Мюллер, Нусс, Фраш, Эйзенбраун'
                    }, {
                        name: 'д. Маре (Марьяновка)',
                        data: []
                    }, {
                        name: 'д. Месит (нем., Защитное). Члены товарищества в 1915 г.',
                        data: 'Бер, Брайденбихер Андреас Карлов, Гауфлер Давид Готлибов, Дубс'
                    }, {
                        name: 'д. Мешень (Советское)',
                        data: []
                    }, {
                        name: 'д. Мурзаллар-Кемельчи (Щербаково). Члены товарищества в 1915 г.',
                        data: 'Глеклер Иоган Фридрихов, Наводный Франц, Приб'
                    }, {
                        name: 'д. Муссабий-Адаргин (Студеное)',
                        data: []
                    }, {
                        name: 'д. Найман (нем. Гохгейм, Советское). Члены товарищества в 1915 г.',
                        data: 'Бромер, Гауфлер Конрад Готлибов, Майстер Готлиб Готлибов, Мельман \n' +
                            'Эдуард Генрихов, Фалькенштейн Вильгельм, Фот Иван Андреев'
                    }, {
                        name: 'д. Немецкий Джанкой (Карлсруэ, Ближнегородское)',
                        data: []
                    }, {
                        name: 'с. Ново-Покровка (Баяут)',
                        data: []
                    }, {
                        name: 'пос. Оттар-Петровка',
                        data: []
                    }, {
                        name: 'д. Тотанай (нем., Уютное). Члены сельского общества в 1915 г.',
                        data: 'Боос Яков, Гацке Готлиб и Фридрих, Губер Генрих, Дубс, Лизе, Нефф, \n' +
                            'Шенер Фридрих и Генрих'
                    }, {
                        name: 'д. Узун-Сакал-Джанкой (Озерное)',
                        data: []
                    }, {
                        name: 'д. Чолбасы (нем.)',
                        data: []
                    }
                ]
            }]},
            {
                name: "Симферопольский уезд",
                data: [
                    {
                        name: 'г. Симферополь',
                        data: []
            },
            {
                name: 'Булганакская волость',
                data: [
                    {
                        name: 'д. Агач-Эли (Лекарственное)',
                        data: []
                    }, {
                        name: 'д. Береговое (Замрук)',
                        data: []
                    }, {
                        name: 'д. Булганак (Кроненталь, Кольчугино)',
                        data: []
                    }, {
                        name: 'д. Дорт Куль (Раздолье)',
                        data: []
                    }, {
                        name: 'д. Контуган (Тепловка)',
                        data: []
                    }, {
                        name: 'д. Николаевка',
                        data: []
                    }, {
                        name: 'д. Сейменларкой (Юрьевка)',
                        data: []
                    }, {
                        name: 'д. Тархан-Учкуй (Колодезное)',
                        data: []
                    }
                ]
            },
            {
                name: 'Дуванкойская волость',
                data: [
                    {
                        name: 'д. Аджи-Булат (Угловое)',
                        data: []
                    }, {
                        name: 'д. Актачи (Фурмановка)',
                        data: []
                    }, {
                        name: 'д. Акшеих (Красная Заря)',
                        data: []
                    }, {
                        name: 'д. Альма-Тамак (Песчаное)',
                        data: []
                    }, {
                        name: 'д. Альма-Тархан',
                        data: []
                    }, {
                        name: 'д. Аранчи (Суворово)',
                        data: []
                    }, {
                        name: 'д. Бельбек (Фруктовое)',
                        data: []
                    }, {
                        name: 'д. Биюк-Отаркой (Фронтовое)',
                        data: []
                    }, {
                        name: 'д. Бурлюк (Вилино)',
                        data: []
                    }, {
                        name: 'д. Голумбей (Некрасовка)',
                        data: []
                    }, {
                        name: 'д. Дуванкой (Верхнесадовое)',
                        data: []
                    }, {
                        name: 'д. Калымтай (Тенистое)',
                        data: []
                    }, {
                        name: 'д. Орта-Кисек-Отаркой (в сост. Фронтового)',
                        data: []
                    }, {
                        name: 'д. Ханышкой (Отрадное)',
                        data: []
                    }, {
                        name: 'д. Чоткара (Малодворное)',
                        data: []
                    }
                ]
            },
            {
                name: 'Зуйская волость',
                data: [
                    {
                        name: 'д. Александровка (Отар-Кой)',
                        data: []
                    }, {
                        name: 'д. Аргин (нем., Балки). Поселяне-собственники за 1915 г.',
                        data: 'Антони, Бауэр, Бейрле Карл Иоганович, Безер Михаил, Бош Яков, Гаар, \n' +
                            'Гекенлейбе Георг Якубович, Гернер, Дик, Кельт Г., Кельш Иосиф и Антон, \n' +
                            'Крес Иоган, Круг, Ланг Михаил, Мох, Остер, Пфейфер Август Фридрихович, \n' +
                            'Рейнбольд, Рейнгольц, Риз, Рукгабер Филипп, Саутнер, Фауст, Фикс Венделин, \n' +
                            'Шмидт, Шнейдер, Эйзенбраун Иоганн и Петр'
                    }, {
                        name: 'д. Ашага-Баксан (Межгорье)',
                        data: []
                    }, {
                        name: 'д. Ашага-Баши (Головановка)',
                        data: []
                    }, {
                        name: 'д. Ашага-Тайган (Южноозерное)',
                        data: []
                    }, {
                        name: 'д. Балановка',
                        data: []
                    }, {
                        name: 'д. Барабановка',
                        data: []
                    }, {
                        name: 'с. Зуя',
                        data: []
                    }, {
                        name: 'д. Казанлы ()',
                        data: []
                    }, {
                        name: 'д. Казы-Эли (Яковлевка)',
                        data: []
                    }, {
                        name: 'д. Кайнаут (Овражки)',
                        data: []
                    }, {
                        name: 'д. Камышлык (Перелесье)',
                        data: []
                    }, {
                        name: 'д. Канлык',
                        data: []
                    }, {
                        name: 'с. Кантакузы (Фриденталь, Курортное)',
                        data: []
                    }, {
                        name: 'д. Корда-Эли',
                        data: []
                    }, {
                        name: 'д. Конрад (Пасечное)',
                        data: []
                    }, {
                        name: 'д. Куртулук (Пчелиное)',
                        data: []
                    }, {
                        name: 'с. Мазанка',
                        data: []
                    }, {
                        name: 'д. Ново-Алексеевка',
                        data: []
                    }, {
                        name: 'д. Ново-Александровка (Красновка)',
                        data: []
                    }, {
                        name: 'д. Ново-Зуевка',
                        data: []
                    }, {
                        name: 'д. Петрово',
                        data: []
                    }, {
                        name: 'д. Сары Су (Новиково)',
                        data: []
                    }, {
                        name: 'д. Тав-Бараган (Охотничье)',
                        data: []
                    }, {
                        name: 'д. Тав-Даир (Лесноселье)',
                        data: []
                    }, {
                        name: 'д. Тав-Кипчак (Лесное)',
                        data: []
                    }, {
                        name: 'д. Тюбень-Эли',
                        data: []
                    }, {
                        name: 'хут. Фундуклы',
                        data: []
                    }, {
                        name: 'д. Чердак',
                        data: []
                    }, {
                        name: 'д. Чукурча (Нейзац, Красногорское)',
                        data: []
                    }, {
                        name: 'с. Шабан-Уба (Розенталь, Ароматное)',
                        data: []
                    }, {
                        name: 'д. Эски Сарай',
                        data: []
                    }, {
                        name: 'д. Эфендикой (Червонное, в сост. Зеленогорского)',
                        data: []
                    }, {
                        name: 'д. Юхары-Баши (Головановка)',
                        data: []
                    }, {
                        name: 'с. Юхары-Баксан (Межгорье)',
                        data: []
                    }, {
                        name: 'д. Юхары-Тайган',
                        data: []
                    }, {
                        name: 'д. Яни Сарай (Благодатное)',
                        data: []
                    }
                ]
            },
            {
                name: 'Каралезская волость',
                data: [
                    {
                        name: 'д. Адым Чокрак (Истоки)',
                        data: []
                    }, {
                        name: 'д. Албат (Куйбышево)',
                        data: []
                    }, {
                        name: 'д. Ай-Тодор (Гористое)',
                        data: []
                    }, {
                        name: 'д. Биюк Каралез (Красный Мак)',
                        data: []
                    }, {
                        name: 'д. Биюк Сюрень (Танковое)',
                        data: []
                    }, {
                        name: 'д. Заланкой (Холмовка)',
                        data: []
                    }, {
                        name: 'д. Кучки',
                        data: []
                    }, {
                        name: 'д. Кючюк Сюрень (Таш-Баксан, Малое Садовое)',
                        data: []
                    }, {
                        name: 'д. Пычки (Баштановка)',
                        data: []
                    }, {
                        name: 'д. Сююрташ (Белокаменное)',
                        data: []
                    }, {
                        name: 'д. Теберти (Тургеневка)',
                        data: []
                    }, {
                        name: 'д. Толе (Дачное)',
                        data: []
                    }, {
                        name: 'д. Узен Бащик (Хворостянка)',
                        data: []
                    }, {
                        name: 'д. Уппа (Родное)',
                        data: []
                    }, {
                        name: 'д. Ходжа-Сала',
                        data: []
                    }, {
                        name: 'д. Черкес Кермен (Крепкое)',
                        data: []
                    }, {
                        name: 'д. Чоргунь (Черноречье)',
                        data: []
                    }, {
                        name: 'д. Шули (Терновка)',
                        data: []
                    }, {
                        name: 'д. Юхары Каралез (Залесное)',
                        data: []
                    }
                ]
            },
            {
                name: 'Подгородне-Петровская волость',
                data: [
                    {
                        name: 'д. Абдал Русский (Белое)',
                        data: []
                    }, {
                        name: 'д. Абдал Татарский (Загороднее)',
                        data: []
                    }, {
                        name: 'д. Актакчи Кият (Белоглинка)',
                        data: []
                    }, {
                        name: 'д. Александровка',
                        data: []
                    }, {
                        name: 'д. Алексеевка',
                        data: []
                    }, {
                        name: 'д. Ана-Эли (Загорское)',
                        data: []
                    }, {
                        name: 'д. Аратук (Клиновка)',
                        data: []
                    }, {
                        name: 'д. Атман (Веселое)',
                        data: []
                    }, {
                        name: 'с. Аян',
                        data: []
                    }, {
                        name: 'д. Барак-Эли (Бараки)',
                        data: []
                    }, {
                        name: 'д. Бахчи-Эли',
                        data: []
                    }, {
                        name: 'д. Беки-Эли (Живописное)д. Битак (Пригородное)',
                        data: []
                    }, {
                        name: 'д. Битак (Пригородное)',
                        data: []
                    }, {
                        name: 'д. Биюк Янкой (Мраморное)',
                        data: []
                    }, {
                        name: 'с. Богурчи (Ново-Мазанка, Каменка)',
                        data: []
                    }, {
                        name: 'д. Больше-Токмакская',
                        data: []
                    }, {
                        name: 'д. Бор-Чокрак (Заводское)',
                        data: []
                    }, {
                        name: 'д. Бурнаш',
                        data: []
                    }, {
                        name: 'д. Вейрат (Новоивановка)',
                        data: []
                    }, {
                        name: 'д. Джалман (Пионерское)',
                        data: []
                    }, {
                        name: 'д. Джефер-Берды (Дружное)',
                        data: []
                    }, {
                        name: 'д. Джанатай (Ивановка)',
                        data: []
                    }, {
                        name: 'д. Ени-Сала (Баранова, Чайковское)',
                        data: []
                    }, {
                        name: 'д. Кара Кият (Грушевое)',
                        data: []
                    }, {
                        name: 'д. Кизил Коба (Краснопещерное)',
                        data: []
                    }, {
                        name: 'д. Киль-Бурун (Горки)',
                        data: []
                    }, {
                        name: 'д. Кульчук (Родниково)',
                        data: []
                    }, {
                        name: 'д. Курцы (Украинка)',
                        data: []
                    }, {
                        name: 'д. Мамак (Строгановка)',
                        data: []
                    }, {
                        name: 'д. Мамут Султан (Доброе)',
                        data: []
                    }, {
                        name: 'д. Марьяновка (Долгорукаго)',
                        data: []
                    }, {
                        name: 'д. Мусса-Аджи-Эли (Свердлово)',
                        data: []
                    }, {
                        name: 'д. Ново-Сергеевка',
                        data: []
                    }, {
                        name: 'с. Подгородне-Петровское',
                        data: []
                    }, {
                        name: 'д. Сарабуз русск. (Соловьевка)',
                        data: []
                    }, {
                        name: 'д. Сарабуз болг. (Укромное)',
                        data: []
                    }, {
                        name: 'д. Сарайлы-Кият (Каховское)',
                        data: []
                    }, {
                        name: 'д. Сарчи-Кият (Богдановка)',
                        data: []
                    }, {
                        name: 'д. Спат (Гвардейское)',
                        data: []
                    }, {
                        name: 'д. Суин-Аджи (Денисовка)',
                        data: []
                    }, {
                        name: 'д. Тавель (Краснолесье)',
                        data: []
                    }, {
                        name: 'д. Татар Чокрак (Ключевое)',
                        data: []
                    }, {
                        name: 'д. Темир-Аратук (Майское)',
                        data: []
                    }, {
                        name: 'д. Тереклы-Эли (Трехпрудное)',
                        data: []
                    }, {
                        name: 'д. Теренаир (Глубокое)',
                        data: []
                    }, {
                        name: 'д. Терескунда (Полярник)',
                        data: []
                    }, {
                        name: 'д. Тобе-Чокрак (Ставки)',
                        data: []
                    }, {
                        name: 'д. Тотаткой (Ферсманово)',
                        data: []
                    }, {
                        name: 'д. Тохта Джами (Андрусово)',
                        data: []
                    }, {
                        name: 'д. Чавке (Сорокино)',
                        data: []
                    }, {
                        name: 'д. Чокурча (Луговое)',
                        data: []
                    }, {
                        name: 'д. Чумакары (Обрыв)',
                        data: []
                    }, {
                        name: 'д. Чуюнча (Урожайное)',
                        data: []
                    }, {
                        name: 'д. Шумхай (Заречное)',
                        data: []
                    }, {
                        name: 'д. Эски Орда (Лозовое)',
                        data: []
                    }, {
                        name: 'д. Эски Сарай (Монетное)',
                        data: []
                    }, {
                        name: 'д. Ягмурча (Фонтаны)',
                        data: []
                    }
                ]
            },
            {
                name: 'Табулдинская волость',
                data: [
                    {
                        name: 'д. Аджи Кечь (нем., Харитоновка) Поселяне-собственники за 1915 г.',
                        data: 'Безлер, Люц Амалия Матвеевна, Гекендейбле Вильгельм Яковлевич, \n' +
                            'Кильман Филипп Филиппович (наследники), Рапп Готфрид Давидович'
                    }, {
                        name: 'д. Аджи-Эли-Кипчак (Лермонтовка) Поселяне-собственники за 1915 г.',
                        data: 'Винс Марфа Яковлевна, Янцен Иоган, Яков и Абрам Яковлевичи'
                    }, {
                        name: 'хут. Азов (нем.) Поселяне-собственники за 1915 г.',
                        data: 'Вейгум Адам Данилович, Реймера Петра Петровича наследники, Тьярт \n' +
                            'Иоган Якубович, Шеленберг Гергард Абрамович, Штоль Генрих Филиппович'
                    }, {
                        name: 'д. Айтуган татар. (Жуковское)',
                        data: []
                    }, {
                        name: 'д. Айтуган нем. (Пологи). Поселяне-собственники за 1915 г.',
                        data: 'Гольденбан Иоган Вильгельмович, Гоосен Иван Яковлевич, Рамхен Генриха \n' +
                            'Генриховича, Сабель Генрих Иоганович, Фолленвейдер Яков и Филипп Людвигович'
                    }, {
                        name: 'д. Аккая (Белая Скала)',
                        data: []
                    }, {
                        name: 'д. Алатай (нем., Золотое). Поселяне-собственники за 1915 г.',
                        data: 'Бош Антон и Александр, Гек Иоганн, Гернер, Дик Иоган, Кельш Иоганн \n' +
                            'и Мария, Мох Антон и Александр, Круг Иоганн, Эли Антона наследники'
                    }, {
                        name: 'д. Алексеевка (Куничи, Владимировка)',
                        data: []
                    }, {
                        name: 'д. Анакай-Эли (список поселян-собственников за 1915 г.)',
                        data: 'Бек Иоган Иоганович, Бер Яков-Фридрих Яковлевич и Филипп Генрихович, \n' +
                            'Валл Корнелиус Корнелиусович, Ваний Челеби и Сеит Кенджали, Вибе Филипп \n' +
                            'Яковлевич, Зеель Генрих Генрихович, Килиус Леопольд Юльевич, Тьярт Иван \n' +
                            'Яковлевич, Фаст Генрих Генрихович'
                    }, {
                        name: 'д. Анновка',
                        data: []
                    }, {
                        name: 'д. Аргинчик (Димитриевка)',
                        data: []
                    }, {
                        name: 'д. Бараган (нем., Вавилово). Поселяне-собственники за 1915 г.',
                        data: 'Гоосен Иван Яковлевич, Рапп Андреас Тобиасович, Сутер Яков Петрович'
                    }, {
                        name: 'д. Баяут (Проточное)',
                        data: []
                    }, {
                        name: 'д. Бешаран (Ивановка, Пятихлебное)',
                        data: []
                    }, {
                        name: 'д. Бешаран-Отар (Новожиловка)',
                        data: []
                    }, {
                        name: 'д. Борасхан (Меловое)',
                        data: []
                    }, {
                        name: 'д. Болгарские-Коясты',
                        data: []
                    }, {
                        name: 'хут. Бочала (Ударное)',
                        data: []
                    }, {
                        name: 'д. Бурульча (Долиновка). Поселяне-собственники за 1915 г.',
                        data: 'Бауэр Генрих Андреасович, Вайнер Иоган, Вебер Мартын, Вейзенбарн \n' +
                            'Рейнгольд, Гаар Фридрих, Ганн Готлиб, Гюбнер Яков, Андреас и Александр \n' +
                            'Венделиновичи, Дик Давид Яковлевич, Дубс Яков и Генрих, Марковардт Яков \n' +
                            'Готфридов, Линд Теодор Иоганович, Отт Якуб, Шефер Фридрих, Шпрингер \n' +
                            'Александр, Фрей Даниил, Штифлен Фридрих, Эдуард и Иоганес'
                    }, {
                        name: 'д. Бустерчи (поселяне-собственники в 1915 г.)',
                        data: 'Симани Иоганес, Пархоменко Павел и Александр, Шерибле Иоган Александрович'
                    }, {
                        name: 'д. Георгиевское Т-во',
                        data: []
                    }, {
                        name: 'д. Давыдовка (Секизек, Степное). Поселяне-собственники за 1915 г.',
                        data: 'Гекк Иосиф и Венделин Иогановичи, Гернер Семен Венделинов, Дик, Круп \n' +
                            'Иоганес Георгиевич, Мантель Вильгельм Мартынович, болгары Петр Найденов, \n' +
                            'Чебышев'
                    }, {
                        name: 'д. Джага-Шейх-Эли (Холмовое)',
                        data: []
                    }, {
                        name: 'д. Джавлуш',
                        data: []
                    }, {
                        name: 'д. Кадыкой (Сухоречье)',
                        data: []
                    }, {
                        name: 'д. Калму-Кара (нем., Дмитрово). Поселяне-собственники за 1915 г.',
                        data: 'Земан Филипп, Миллеры Генрих-Фридрих, Иоганес и Фридрих, \n' +
                            'русск. Параскева Дмитриевна Урденко'
                    }, {
                        name: 'д. Кангил (Луговое)',
                        data: []
                    }, {
                        name: 'д. Карабай (Мироновка)',
                        data: []
                    }, {
                        name: 'д. Карасан (Ровное)',
                        data: []
                    }, {
                        name: 'д. Карловка',
                        data: []
                    }, {
                        name: 'д. Кемельчи',
                        data: []
                    }, {
                        name: 'д. Кентугай (Литвиненково)',
                        data: []
                    }, {
                        name: 'д. Кернеус (Донское)',
                        data: []
                    }, {
                        name: 'д. Кирк Лечь (нем., Кертлеч). Поселяне-собственники в 1915 г.',
                        data: 'Грейлих Адам, Гуменик Иосиф, Цибарт Евгения Генриховна, Шлейхер Яков \n' +
                            'и Георг Иогановичи'
                    }, {
                        name: 'д. Кирмачи',
                        data: []
                    }, {
                        name: 'д. Кой-Аран',
                        data: []
                    }, {
                        name: 'хут. Костельчик (Искра)',
                        data: []
                    }, {
                        name: 'д. Коясты (Подгорное)',
                        data: []
                    }, {
                        name: 'хут. Маттис (Дрофино)',
                        data: []
                    }, {
                        name: 'д. Минджаба (Минино)',
                        data: []
                    }, {
                        name: 'д. Мулла-Эли',
                        data: []
                    }, {
                        name: 'д. Ново-Баяут (Проточное)',
                        data: []
                    }, {
                        name: 'д. Ново-Георгиевка',
                        data: []
                    }, {
                        name: 'с. Ново-Николаевка',
                        data: []
                    }, {
                        name: 'д. Новоселье (Новодолинка)',
                        data: []
                    }, {
                        name: 'д. Ново-Царицыно (Садовое)',
                        data: []
                    }, {
                        name: 'д. Ново-Чембай (Коренное)',
                        data: []
                    }, {
                        name: 'д. Новые Теленчи (Низовое)',
                        data: []
                    }, {
                        name: 'д. Осма Верхняя и Нижняя (Верхнекурганное и Нижнекурганное)',
                        data: []
                    }, {
                        name: 'д. Сабах-Эли (Зорька)',
                        data: []
                    }, {
                        name: 'хут. Салгирка',
                        data: []
                    }, {
                        name: 'хут. Салгир-Кият (нем., Речное). Поселяне-собственники в 1915 г.',
                        data: 'Валл Корнелиус Корнелиусович, Фаст Иоган Николаевич, Эзау Яков Николаевич'
                    }, {
                        name: 'д. Старый Баяут (Мироновка)',
                        data: []
                    }, {
                        name: 'д. Табулды (нем., Найденовка). Поселяне-собственники в 1915 г.',
                        data: 'Бауэр Генрих, Байхте Вильгельм, Бер Генрих и Филипп, Мантель Вильгельм, \n' +
                            'Людвиг, Антон и Генрих, Маркс Георг, Генрих и Якуб'
                    }, {
                        name: 'д. Тайган',
                        data: []
                    }, {
                        name: 'д. Таймаз тат. (Кукурузное)',
                        data: []
                    }, {
                        name: 'д. Таймаз нем. (Аксаково). Поселяне-собственники в 1915 г.',
                        data: 'Рапп Христиан и Андреас, Рейнбольд Филипп, Штоль Яков'
                    }, {
                        name: 'д. Тереклы-Шейх-Эли (нем., Мельничное). Поселяне-собственники в 1915 г.',
                        data: 'Гаар Вильгельм Готлибович, Гюбнер Петр Венделинович, Шнейдер Яков \n' +
                            'и Иоган Антоновичи, Людвиг Антон и Иоган Яковлевичи'
                    }, {
                        name: 'д. Терменчи (Спокойное)',
                        data: 'Безлер Теодор Иванович, Рапп Эмануил Тобиасович',
                    }, {
                        name: 'д. Товмай (Заречное)',
                        data: []
                    }, {
                        name: 'д. Тубенкой (Украинка)',
                        data: []
                    }, {
                        name: 'экон. Чоты (Жемчужина)',
                        data: []
                    }, {
                        name: 'д. Шеих-Кой (Давыдово)',
                        data: []
                    }, {
                        name: 'д. Яман-Йол-Шейх-Эли (список поселян-собственников в 1915 г.)',
                        data: 'Зейферт Вильгельм Эдуардов, Нефф Андреас Антонович, Прицкау Эмануил Иванов'
                    }
                ]
            },
            {
                name: 'Тав-Бардакская волость',
                data: [
                    {
                        name: 'д. Азек (Плодовое)',
                        data: []
                    }, {
                        name: 'д. Алма Кермен (Заветное)',
                        data: []
                    }, {
                        name: 'с. Балта-Чокрак (Алешино)',
                        data: []
                    }, {
                        name: 'с. Бешуй (Дровянка)',
                        data: []
                    }, {
                        name: 'с. Бияз Сала (Верхоречье)',
                        data: []
                    }, {
                        name: 'д. Биюк Яшлав (Репино)',
                        data: []
                    }, {
                        name: 'с. Бодрак (Трудолюбовка)',
                        data: []
                    }, {
                        name: 'д. Кабаза (Мироновка)',
                        data: []
                    }, {
                        name: 'д. Карач (Трудолюбово)',
                        data: []
                    }, {
                        name: 'с. Кочкар-Эль (Брянское)',
                        data: []
                    }, {
                        name: 'д. Коджук-Эль (Шевченково)',
                        data: []
                    }, {
                        name: 'с. Мангуш (Прохладное)',
                        data: []
                    }, {
                        name: 'д. Ново-Васильевка',
                        data: []
                    }, {
                        name: 'д. Ново-Збурьевка',
                        data: []
                    }, {
                        name: 'д. Ново-Павловка (Гунали)',
                        data: []
                    }, {
                        name: 'д. Ойсунки (Растущее)',
                        data: []
                    }, {
                        name: 'д. Омашель (Отеш-Эли)',
                        data: []
                    }, {
                        name: 'с. Саблы (Партизанское)',
                        data: []
                    }, {
                        name: 'д. Сакав (Заячье)',
                        data: []
                    }, {
                        name: 'д. Севастьяновка',
                        data: []
                    }, {
                        name: 'д. Тав-Бардак (Скалистое)',
                        data: []
                    }, {
                        name: 'д. Улаклы (Глубокий Яр)',
                        data: []
                    }, {
                        name: 'д. Черкез Эль (Балки)',
                        data: []
                    }, {
                        name: 'д. Шакул (Самохвалово)',
                        data: []
                    }, {
                        name: 'д. Шуры (Кудрино)',
                        data: []
                    }, {
                        name: 'д. Эдишель (Нагорное, Маловидное)',
                        data: []
                    }
                ]
            }]},
            {
                name: "Феодосийский уезд",
                data: [
                    {
                        name: 'г. Феодосия',
                        data: []
                    },
                    {
                        name: 'Андреевская волость',
                        data: []
                    },
                    {
                        name: 'Владиславская волость',
                        data: []
                    },
                    {
                        name: 'Кишлавская волость',
                        data: []
                    },
                    {
                        name: 'Петровская волость',
                        data: []
                    },
                    {
                        name: 'Салынская волость',
                        data: []
                    },
                    {
                        name: 'Сарайминская волость',
                        data: []
                    },
                    {
                        name: 'Таракташская волость',
                        data: []
                    },
                    {
                        name: 'Цюрихтальская волость',
                        data: []
                    }
                ]
            },
            {
                name: "Ялтинский уезд",
                data: [
                    {
                        name: 'г. Ялта',
                        data: []
            },
            {
                name: 'Алуштинская волость',
                data: []
            },
            {
                name: 'Байдарская волость',
                data: []
            },
            {
                name: 'Богатырская волость',
                data: []
            },
            {
                name: 'Дерекойская волость',
                data: []
            },
            {
                name: 'Кучук-Узенская волость',
                data: []
            },
            {
                name: "Керчь-Еникалийское градоначальство",
                data: []
            },
            {
                name: "Севастопольское градоначальство",
                data: []
            }]}]},
            {
                name: "Харьковская губерния",
                data: [
                    {
                        name: "Ахтырский уезд",
                        data: [
                            {
                                name: 'г. Ахтырка',
                                data: []
                    },
                    {
                        name: 'д. Алексаева',
                        data: []
            },
            {
                name: 'д. Александровка',
                data: []
            },
            {
                name: 'сл. Бакировка (список фамилий за 1858 г.)',
                data: [{
                    name: 'Борщ, Верба, Винниченко, Григоренко, Данилич, Деркачева, Дубина, \n' +
                        'Дяденко, Ефименко, Зиненко, Канцедал, Касяненко, Козоброд, Козодав, \n' +
                        'Кононенко, Костенко, Крючкова, Левченко, Лимаренко, Лукьяненко, Онопко, \n' +
                        'Опрешко, Пащенко, Перебора, Перегуба, Пухкало, Рябой, Семченко, Слепуха, \n' +
                        'Слепушенко, Сова, Соседский, Сулименко, Тищенко, Топчий, Троценко, \n' +
                        'Филипенко, Фоменко, Харитоненко, Шаповал, Щучка, Явтушенко, Якименко, \n' +
                        'Яценко'
                }]
            },
            {
                name: 'сл. Белка',
                data: []
            },
            {
                name: 'д. Березовка (Николаевка)',
                data: []
            },
            {
                name: 'д. Боголюбова',
                data: []
            },
            {
                name: 'сл. Боромля',
                data: []
            },
            {
                name: 'с. Бранцовка',
                data: []
            },
            {
                name: 'д. Бугимировка',
                data: []
            },
            {
                name: 'д. Буды',
                data: []
            },
            {
                name: 'д. Верхолюджа',
                data: []
            },
            {
                name: 'д. Верхопожня',
                data: []
            },
            {
                name: 'д. Веселая',
                data: []
            },
            {
                name: 'с. Видневка',
                data: []
            },
            {
                name: 'хут. Гапоновский (Запоновка)',
                data: []
            },
            {
                name: 'хут. Гребельки',
                data: []
            },
            {
                name: 'д. Грязная',
                data: []
            },
            {
                name: 'д. Демяновка (Ильинское, Вошоколуповка)',
                data: []
            },
            {
                name: 'с. Деревки',
                data: []
            },
            {
                name: 'д. Дерновая (Поповка)',
                data: []
            },
            {
                name: 'с. Дерновое',
                data: []
            },
            {
                name: 'д. Доброславовка',
                data: []
            },
            {
                name: 'сл. Жигайловка',
                data: []
            },
            {
                name: 'с. Журавное',
                data: []
            },
            {
                name: 'д. Закобылье',
                data: []
            },
            {
                name: 'д. Зарудка (Кардашевка)',
                data: []
            },
            {
                name: 'хут. Ивановский',
                data: []
            },
            {
                name: 'с. Каменецкое',
                data: []
            },
            {
                name: 'с. Каменка',
                data: []
            },
            {
                name: 'хут. Карасивщина',
                data: []
            },
            {
                name: 'сл. Кириковка',
                data: []
            },
            {
                name: 'д. Костевка',
                data: []
            },
            {
                name: 'сл. Котельна',
                data: []
            },
            {
                name: 'сл. Краснополье',
                data: []
            },
            {
                name: 'д. Краснянка',
                data: []
            },
            {
                name: 'с. Криничное',
                data: []
            },
            {
                name: 'д. Литовка',
                data: []
            },
            {
                name: 'с. Лутище',
                data: []
            },
            {
                name: 'с. Люджа',
                data: []
            },
            {
                name: 'хут. Марьинский',
                data: []
            },
            {
                name: 'д. Машкова',
                data: []
            },
            {
                name: 'хут. Карасивщина',
                data: []
            },
            {
                name: 'сл. Кириковка',
                data: []
            },
            {
                name: 'д. Костевка',
                data: [
            {
                name: 'сл. Котельна',
                data: []
            },
            {
                name: 'сл. Краснополье (список фамилий за 1858 г.)',
                data: 'Авраменко, Бабак, Базалий, Банак, Бакаенко, Басараб, Батюх, Бездверный, \n' +
                    'Безкоровайный, Бледунов, Блоха, Бованченко, Богданов, Бутко, Быченко, \n' +
                    'Важничий, Вакуленко, Вангородский, Васютенко, Гаврилов, Гетьман, \n' +
                    'Гладушка, Гнедаш, Голик, Голота, Горбунов, Горбут, Гриненко, Грицаенко, \n' +
                    'Гришко, Гузенко, Дейнека, Деревянченко, Дзюбань, Диденко, Дорошенко, \n' +
                    'Дробот, Дубченко, Жаботинский, Жидченко, Журавель, Завгородний, Заярный, \n' +
                    'Захарченко, Зеленский, Иваненко, Калюжный, Катилька, Катинос, Кириченко, \n' +
                    'Кладченко, Клюшник, Козеренко, Козлов, Коколевский, Колесник, Колодка, \n' +
                    'Колодченко, Коломийченко, Кононенко, Корменко, Корниенко, Королев, Корх, \n' +
                    'Котляров, Кревенко, Кулиниц, Купец, Кучир, Кучиренко, Лазня, Лебединский, \n' +
                    'Лебидь, Ливченко, Лисенко, Лисюк, Литвин, Лупка, Мага, Мартиненко, Милька, \n' +
                    'Мироненко, Морозенко, Мостовый, Найденко, Найдовский, Новак, Ноженко, \n' +
                    'Оберемко, Оверко, Онищенко, Осычный, Отченашев, Панченко, Петров, Пилипец, \n' +
                    'Плескач, Подгорный, Подопригора, Подрийко, Радченко, Роевский, Рудченко, \n' +
                    'Рыбалка, Савостьян, Савченко, Саненко, Сахно, Серенко, Сиви(-е)рин, \n' +
                    'Сирдюков, Слюновский, Смарненко, Соловьев,Сорока, Стрижак, Ступак, Сумец, \n' +
                    'Супрунов, Сырида, Таран, Тарасенко, Терещенко, Тихоненко, Ткаченко, \n' +
                    'Харченко, Хмелевский, Холоденко, Хорошун, Храпко, Хухрянский, Чичикало, \n' +
                    'Шапошник, Шевченко, Шеподько, Шпак, Шпиря, Щадько, Ядрец, Якименко, \n' +
                    'Якущенко, Янков'
            }]},
            {
                name: 'д. Краснянка',
                data: []
            },
            {
                name: 'с. Криничное',
                data: []
            },
            {
                name: 'д. Литовка',
                data: []
            },
            {
                name: 'с. Лутище',
                data: []
            },
            {
                name: 'с. Люджа',
                data: []
            },
            {
                name: 'хут. Марьинский',
                data: []
            },
            {
                name: 'д. Машкова',
                data: []
            },
            {
                name: 'с. Мезеновка',
                data: []
            },
            {
                name: 'д. Мещанка',
                data: []
            },
            {
                name: 'д. Михайловка (Сотницкое)',
                data: []
            },
            {
                name: 'д. Михайловка (при р. Хухре)',
                data: []
            },
            {
                name: 'с. Млинки',
                data: []
            },
            {
                name: 'д. Мошенка',
                data: []
            },
            {
                name: 'хут. Нижневеселовский',
                data: []
            },
            {
                name: 'с. Никитовка',
                data: []
            },
            {
                name: 'д. Ницаха',
                data: []
            },
            {
                name: 'д. Новоселовка',
                data: []
            },
            {
                name: 'хут. Палоги',
                data: []
            },
            {
                name: 'д. Печины',
                data: []
            },
            {
                name: 'д. Пилевка',
                data: []
            },
            {
                name: 'хут. По речке Мошенке',
                data: []
            },
            {
                name: 'хут. Подкраснопольский (Чернетчина)',
                data: []
            },
            {
                name: 'с. Пожин',
                data: []
            },
            {
                name: 'сл. Покровская (список фамилий за 1858 г. вместе со сл. Пушкарной)',
                data: [{
                    name: 'Багно, Басараб, Белоковаленко, Бидиленко, Болоцкий, Бородянко, Бреус, \n' +
                        'Бречка, Владика, Власенко, Волевач, Воливасенко, Воличенко, Волос(?), \n' +
                        'Волощенко, Выщенко, Гаврик, Гамаль, Ганноченко, Гончаренко, Горбенко, \n' +
                        'Грищенко, Евтушенко, Запривальный, Здатченко, Карписев, Кириченко, \n' +
                        'Кислюк, Кобзарь, Коваленко, Коваль, Косицина, Коросько, Корощенко, \n' +
                        'Котенко, Коцарь, Кукулевский, Кулик, Куцеренко, Кучменко, Лисенко, \n' +
                        'Литовченко, Максименко, Мильченко, Матюшенко, Овчар, Офота, Панченко, \n' +
                        'Перепилица, Прохоренко, Радченко, Рошко, Рудь, Рыбалка, Садовой, \n' +
                        'Скляров, Скрипник, Спеваков, Сущенко, Таран, Телетка, Тихонский, \n' +
                        'Уманский, Ушкало, Фесенко, Харченко, Хухрянский, Ципка, Цюцюра, \n' +
                        'Черненький, Чуприна, Шевченко, Шматок, Якубынский',
                    data: []
                }],
            },
            {
                name: 'с. Поляное',
                data: []
            },
            {
                name: 'д. Поповка (Семеновка)',
                data: []
            },
            {
                name: 'хут. Поповский',
                data: []
            },
            {
                name: 'д. Порозок',
                data: []
            },
            {
                name: 'с. Преображенское (Гричаниковка, Грачановское)',
                data: []
            },
            {
                name: 'хут. Пристань',
                data: []
            },
            {
                name: 'сл. Пушкарная (список фамилий за 1858 г. вместе со сл. Покровской)',
                data: [{
                    name: 'Багно, Басараб, Белоковаленко, Бидиленко, Болоцкий, Бородянко, Бреус, \n' +
                            'Бречка, Владика, Власенко, Волевач, Воливасенко, Воличенко, Волос(?), \n' +
                        'Волощенко, Выщенко, Гаврик, Гамаль, Ганноченко, Гончаренко, Горбенко, \n' +
                        'Грищенко, Евтушенко, Запривальный, Здатченко, Карписев, Кириченко, \n' +
                        'Кислюк, Кобзарь, Коваленко, Коваль, Косицина, Коросько, Корощенко, \n' +
                        'Котенко, Коцарь, Кукулевский, Кулик, Куцеренко, Кучменко, Лисенко, \n' +
                        'Литовченко, Максименко, Мильченко, Матюшенко, Овчар, Офота, Панченко, \n' +
                        'Перепилица, Прохоренко, Радченко, Рошко, Рудь, Рыбалка, Садовой, \n' +
                        'Скляров, Скрипник, Спеваков, Сущенко, Таран, Телетка, Тихонский, \n' +
                        'Уманский, Ушкало, Фесенко, Харченко, Хухрянский, Ципка, Цюцюра, \n' +
                        'Черненький, Чуприна, Шевченко, Шматок, Якубынский',
                    data: []
                }],
            },
            {
                name: 'с. Радомля',
                data: []
            },
            {
                name: 'д. Рыботина',
                data: []
            },
            {
                name: 'д. Рябовка',
                data: []
            },
            {
                name: 'с. Рясное',
                data: []
            },
            {
                name: 'сл. Самотоевка (список фамилий за 1858 г.)',
                data: [{
                    name: 'Алексеенко, Бабич, Барсуков, Бронос, Бут, Вовк, Воронцов, Голихов, \n' +
                        'Голубов, Гончаров, Горбач, Григоренко, Давиденко, Дзюбань, Десятниченко, \n' +
                        'Дробот, Иващенко, Игнатуша, Кириченко, Коломиец, Кононенко, Костенко, \n' +
                        'Кравченко, Крыштопа, Кудрычый, Кучерявый, Левченко, Лизогуб, Литвин, \n' +
                        'Лопандя, Макмицкий, Мартищенко, Мерошниченко, Надъярный, Нечитайло, \n' +
                        'Никалей, Осадчий, Перерва, Петренко, Подгорелый, Пономарев, Поповский, \n' +
                        'Рева, Роевский, Росохацкий, Руденко, Рыбалка, Сай, Сахно, Сережка, \n' +
                        'Скакодуб, Слюсаренко, Слюсарь, Смаленко, Солотенко, Тельный, Терещенко, \n' +
                        'Токарь, Фоменко, Худоконь, Цибулька, Шевченко, Шведунов',
                    data: [],
                }],
            },
            {
                name: 'с. Семереньки',
                data: []
            },
            {
                name: 'с. Славгород',
                data: []
            },
            {
                name: 'д. Смородина',
                data: []
            },
            {
                name: 'д. Сосонка',
                data: []
            },
            {
                name: 'д. Становая',
                data: []
            },
            {
                name: 'с. Староивановка',
                data: []
            },
            {
                name: 'с. Тростенец',
                data: []
            },
            {
                name: 'с. Турья',
                data: []
            },
            {
                name: 'д. Тучна',
                data: []
            },
            {
                name: 'с. Угройды',
                data: []
            },
            {
                name: 'с. Успенское (Ефремовка)',
                data: []
            },
            {
                name: 'д. Фощевая',
                data: []
            },
            {
                name: 'сл. Хухра',
                data: [
            {
                name: 'д. Чернетчина (список фамилий за 1858 г.)',
                data: 'Горбенко, Еменко, Кравченко, Малоух, Острога, Рудыка, Рупенко, \n' +
                    'Степаненко, Сусенко, Федоренко, Черномаз, Якущенко'
            }]},
            {
                name: 'с. Чернетчина',
                data: []
            },
            {
                name: 'с. Янков Рог (Янковка)',
                data: []
            },
            {
                name: 'с. Ясинок',
                data: []
            }]},
            {
                name: "Богодуховский уезд",
                data: [
                    {
                        name: 'хут. Александровка (Клиновое, Новоселовка)',
                        data: []
            },
            {
                name: 'д. Бабовка',
                data: []
            },
            {
                name: 'д. Бардаковая',
                data: []
            },
            {
                name: 'хут. Бедратая Балка',
                data: []
            },
            {
                name: 'д. Березовка',
                data: []
            },
            {
                name: 'д. Благодатная',
                data: []
            },
            {
                name: 'г. Богодухов',
                data: []
            },
            {
                name: 'д. Братеница 2-я',
                data: []
            },
            {
                name: 'с. Бригадировка',
                data: []
            },
            {
                name: 'с. Варваровка',
                data: []
            },
            {
                name: 'хут. Воеводский',
                data: []
            },
            {
                name: 'с. Вольное',
                data: []
            },
            {
                name: 'с-цо Воскресенское',
                data: []
            },
            {
                name: 'хут. Глобовка',
                data: []
            },
            {
                name: 'хут. Гнилосировский (фамилии жителей хутора в 1858 г.)',
                data: 'Вовченко, Дяденко, Золотаренко, Правда, Чумак'
            },
            {
                name: 'хут. Голубничий',
                data: []
            },
            {
                name: 'д. Горбаневка',
                data: []
            },
            {
                name: 'д. Горловка',
                data: [
            {
                name: 'сл. Городное (список фамилий за 1858 г.)',
                data: 'Бандура, Белоус, Березный, Бобрицкий, Вергун, Вертецкая, Винниченко, \n' +
                    'Гавриш, Гарбуз, Гевлич, Дудник, Дяченко, Зиненко, Кваша, Коваленко, \n' +
                    'Колесниченко, Коломиец, Котов, Леницкий, Лисенко, Нагорный, Рыбалка, \n' +
                    'Саловаренко, Соломенко, Спиридонов, Стороженко, Терещенко, Ткаченко, \n' +
                    'Трофименко, Федоренко, Фоменко, Чаговец, Черкасов, Шевченко'
            }]},
            {
                name: 'д. Григорьевская',
                data: [
            {
                name: 'сл. Губаровка (список фамилий за 1858 г.)',
                data: 'Белоус, Бережный, Благодырь, Булима, Бутенко, Вишневецкий, Гавриленко, \n' +
                    'Гирка, Глущенко, Головань, Гончаренко, Горобец, Гутянский, Демьяненко, \n' +
                    'Кисель, Ковалевский, Колесник, Колмык, Коломиец, Костенко, Криницкий, \n' +
                    'Лещенко, Лунько, Масляненко, Михайлюк, Мищенко, Мокроменко, Нестеренко, \n' +
                    'Нечугуенко, Носенко, Паламаренко, Партола, Петрашенко, Пипка,  Плахотник, \n' +
                    'Прокопенко, Ткаченко, Тризна, Усько, Ходня, Череванекий, Шило'
            }]},
            {
                name: 'д. Гутеновка',
                data: []
            },
            {
                name: 'с. Гуты',
                data: []
            },
            {
                name: 'с. Декрешево',
                data: []
            },
            {
                name: 'сл. Демьяновка',
                data: []
            },
            {
                name: 'д. Дмитриевка',
                data: []
            },
            {
                name: 'слоб. Добренское (Гниловка)',
                data: []
            },
            {
                name: 'хут. Долина (Морозовая)',
                data: []
            },
            {
                name: 'с-цо Егоровка',
                data: []
            },
            {
                name: 'д. Ездоцкое',
                data: []
            },
            {
                name: 'д. Екатериновка',
                data: []
            },
            {
                name: 'хут. Залужок',
                data: []
            },
            {
                name: 'сл. Зубовка',
                data: []
            },
            {
                name: 'с-цо Ивановское',
                data: []
            },
            {
                name: 'д. Капитановка',
                data: []
            },
            {
                name: 'с. Каплуновка',
                data: []
            },
            {
                name: 'хут. Кирьяхова',
                data: []
            },
            {
                name: 'хут. Кияны',
                data: []
            },
            {
                name: 'д. Клиновое',
                data: []
            },
            {
                name: 'д. Кобелевка',
                data: []
            },
            {
                name: 'сл. Козеевка',
                data: []
            },
            {
                name: 'хут. Корай (Козыль)',
                data: [
            {
                name: 'сл. Колонтаева (список фамилий за 1858 г.)',
                data: 'Австчин, Андрусенко, Андрущенко, Безрук, Бондаренко, Бондур, \n' +
                    'Борисенко, Боровик, Бублик, Варва, Васильченко, Ващенко, Веньик, \n' +
                    'Веретельник, Вечеря, Власенко, Вчерашний, Высочинский, Гавриленко, \n' +
                    'Герасименко, Герус, Голубичий, Гольченко, Гончаренко, Горячуха, \n' +
                    'Гречка, Григораш, Григоренко, Гриненко, Гришко, Гузенко, Гунка, \n' +
                    'Даценко, Дикун, Дубина, Дьяченко, Дяденко, Жадан, Жорник, Журавка, \n' +
                    'Зарудний, Затишко, Зинченко, Иващенко, Игнатенко, Исипенко, Кальченко, \n' +
                    'Квитка, Клочан, Ковалевский, Коваль, Комар, Корниенко, Костюченко, \n' +
                    'Кот, Кравченко, Крамаренко, Кришталян, Кушнеренко,  Лаврик, Левченко, \n' +
                    'Лейба, Лежняк, Лисенко, Лукаш, Любинский, Малиш, Мандзюк, Мартиненко, \n' +
                    'Маслий, Мирошниченко, Могилка, Нагнибида, Науменко, Неделька, Ничипоренко, \n' +
                    'Ноженко, Оберемок, Оберянский, Олейник, Омельяненко, Павличенко, Павлюк, \n' +
                    'Пасько, Пахучей, Петренко, Пех, Подгорний, Поплавский, Постельник, Пурей, \n' +
                    'Пушкарь, Рагик, Резниченко, Рубан, Рудас, Рыпало, Рябоконь, Савченко, \n' +
                    'Сайко, Салодовниченко, Свердло, Скряга, Сливка, Семененко, Середа, Сидько, \n' +
                    'Скрипниченко, Собко, Солоный, Стеценко, Страховецкий, Сусла, Твердохлеб, \n' +
                    'Тенянский, Ткаченко, Труш, Тютюнник, Шийка, Шило, Щербина, Финько, Фурсов, \n' +
                    'Ценька(?), Юрченко'
            }]},
            {
                name: 'сл. Комаровка',
                data: []
            },
            {
                name: 'с. Константиновка (Высшая Грузская)',
                data: []
            },
            {
                name: 'хут. Кочаловский',
                data: []
            },
            {
                name: 'д. Крамчанка',
                data: []
            },
            {
                name: 'г. Краснокутск',
                data: []
            },
            {
                name: 'хут. Крысин Яр',
                data: []
            },
            {
                name: 'с. Кручик',
                data: []
            },
            {
                name: 'с. Купьеваха',
                data: []
            },
            {
                name: 'сл. Лесковка',
                data: []
            },
            {
                name: 'сл. Лихачевка',
                data: []
            },
            {
                name: 'сл. Лобовка',
                data: []
            },
            {
                name: 'с. Лозовая',
                data: []
            },
            {
                name: 'д. Луговка',
                data: [
            {
                name: 'сл. Любовка (список фамилий за 1858 г.)',
                data: 'Бандура, Баран, Бондаревский, Буряк, Ващенко, Вирева, Власенко, \n' +
                    'Воробьев, Гавриленко, Гаремаш, Голубичий, Гончаренко, Горденко, Гурин, \n' +
                    'Даченко, Дубина, Жадан, Задорожный, Зиненко, Зорька, Зюбак, Кальченко, \n' +
                    'Каплеух, Карайкоза, Квитка, Киктенко, Кирилов, Ковалевский, Козка, \n' +
                    'Колесниченко, Комар, Коноплев, Кравченко, Крамаренко, Кукса, Кухлей, \n' +
                    'Лободенко, Мокрый, Наргинский, Недилька, Олейник, Павлюк, Панченко, \n' +
                    'Пахучий, Перепелица, Петренко, Петриченко, Петрушенко, Помазан, \n' +
                    'Пономаренко, Пидорченко, Питриченко, Пугачев, Пузырь, Пушкарь, Радченко, \n' +
                    'Резниченко, Романенко, Рудас, Рыбалка, Рыч, Рябоконь, Савченко, \n' +
                    'Сагайдачный, Свитайло, Семененко, Сидоренко, Сидько, Скочко, Собко, \n' +
                    'Страховецкий, Страхолис, Стрелецкий, Строй, Сургай, Сусла, Ткаченко, \n' +
                    'Чередник, Черномаз, Шивченко, Щербинка, Юхименко'
            }]},
            {
                name: 'с. Лясковка',
                data: []
            },
            {
                name: 'д. Максимовка',
                data: []
            },
            {
                name: 'сл. Малыжино',
                data: []
            },
            {
                name: 'д. Марьино (Дружелюбовка)',
                data: []
            },
            {
                name: 'с. Матвеевка',
                data: []
            },
            {
                name: 'хут. Мирное',
                data: []
            },
            {
                name: 'хут. Миролюбовка',
                data: []
            },
            {
                name: 'д. Михайловка',
                data: []
            },
            {
                name: 'сл. Мурафа',
                data: []
            },
            {
                name: 'д. Надеждина (Лемещина)',
                data: []
            },
            {
                name: 'сл. Низшая Грузская',
                data: []
            },
            {
                name: 'сл. Никитовка',
                data: []
            },
            {
                name: 'сл. Николаевская',
                data: []
            },
            {
                name: 'д. Никоноровка',
                data: []
            },
            {
                name: 'хут. Ново-Ивановка',
                data: []
            },
            {
                name: 'хут. Новокирилловский',
                data: []
            },
            {
                name: 'д. Новоселье',
                data: []
            },
            {
                name: 'с-цо Новософиевка',
                data: []
            },
            {
                name: 'д. Основенцы',
                data: []
            },
            {
                name: 'д. Отрада',
                data: []
            },
            {
                name: 'сл. Павловка',
                data: []
            },
            {
                name: 'с. Пархомовка',
                data: []
            },
            {
                name: 'д. Петровская',
                data: [
            {
                name: 'сл. Писаревка Большая (список фамилий за 1868 г.)',
                data: 'Балов, Безусенко, Богословцев, Бречкин, Вербенко, Винниченко, \n' +
                    'Гапоненко, Глущенко, Гончаренко, Гриб, Грибов, Губенко, Дыкий, Еременко, \n' +
                    'Забыйворота, Зинченко, Ищенко, Кавчан, Кадничанский, Капустянко, \n' +
                    'Картенков, Киктенко, Кириченко, Кислый, Кобылянский, Коваленко, Коваль, \n' +
                    'Колесников, Коноз, Корниенко, Кравченко, Кривонос, Курочка, Кутовой, \n' +
                    'Кушнарев, Лесничий, Манойленко, Мирошниченко, Мокиенко, Молчан, Мороз, \n' +
                    'Надточий, Нечволод, Обидец, Пасюга, Пецецкий, Пивоваров, Попов, Савицкий, \n' +
                    'Саятный, Семеренский, Середа, Середин, Синянский, Скляренко, Сыроватский, \n' +
                    'Тараненко, Тищенко, Ткаченко, Третьяк, Тютюнник, Усик, Хижняк, Чуприна, \n' +
                    'Шевченко, Шматов'
            }]},
            {
                name: 'с. Писаревка Малая (Монастырь Синянский)',
                data: []
            },
            {
                name: 'д. Подолянка',
                data: []
            },
            {
                name: 'сл. Поличковка',
                data: []
            },
            {
                name: 'сл. Поповка (при монастыре)',
                data: []
            },
            {
                name: 'хут. Приют',
                data: []
            },
            {
                name: 'д. Пушкарка',
                data: []
            },
            {
                name: 'сл. Пушкарная',
                data: []
            },
            {
                name: 'сл. Рябина Новая и Старая',
                data: []
            },
            {
                name: 'д. Редьковка',
                data: []
            },
            {
                name: 'сл. Рублевка',
                data: []
            },
            {
                name: 'с. Рясное',
                data: []
            },
            {
                name: 'д. Семен-Яр (Щегловка)',
                data: []
            },
            {
                name: 'с. Сенное',
                data: []
            },
            {
                name: 'хут. Соколов Байрак',
                data: []
            },
            {
                name: 'с. Солдатское',
                data: []
            },
            {
                name: 'с. Станичное',
                data: []
            },
            {
                name: 'д. Степановка',
                data: []
            },
            {
                name: 'сл. Стрелецкое',
                data: []
            },
            {
                name: 'сл. Сухая Каменка',
                data: []
            },
            {
                name: 'с. Сухины',
                data: []
            },
            {
                name: 'с. Сухой Мерчик',
                data: []
            },
            {
                name: 'с. Тарасовка',
                data: []
            },
            {
                name: 'д. Трудовка',
                data: []
            },
            {
                name: 'д. Трудолюбовка',
                data: []
            },
            {
                name: 'сл. Хрущовая Никитовка',
                data: []
            },
            {
                name: 'сл. Чернетчина',
                data: []
            },
            {
                name: 'хут. Чернетчина',
                data: []
            },
            {
                name: 'с. Шаровка',
                data: []
            },
            {
                name: 'д. Шелчина',
                data: []
            },
            {
                name: 'сл. Штепы (Штепино)',
                data: []
            },
            {
                name: 'д. Щеголевка',
                data: []
            },
            {
                name: 'с. Яблочное',
                data: []
            },
            {
                name: 'сл. Ямная',
                data: []
            }]},
            {
                name: "Валковский уезд",
                data: []
            },
            {
                name: "Волчанский уезд",
                data: [
                    {
                        name: 'г. Волчанск',
                        data: []
                    },
                    {
                        name: 'хут. Амбарный',
                        data: [
            {
                name: 'д. Андреевка (список фамилий за 1858 г.)',
                data: 'Гапецо(у)н, Канивец, Крывошей, Кучеренко, Малько, Новиков, Певень, \n' +
                    'Пушкаренко, Стрибка, Стрильченко, Тарасенко, Темный, Урденко, Харченко, \n' +
                    'Хорунжий, Чепеленко, Чуприна, Швыдкий, Шевченко'
            }]},
            {
                name: 'д. Анненский (Запольный)',
                data: []
            },
            {
                name: 'хут. Анненский',
                data: []
            },
            {
                name: 'с-цо Аннополь',
                data: []
            },
            {
                name: 'д. Араповка',
                data: []
            },
            {
                name: 'хут. Артельный',
                data: []
            },
            {
                name: 'с. Артемьевское',
                data: []
            },
            {
                name: 'с. Большая Бабка',
                data: []
            },
            {
                name: 'слоб. Базалеевка',
                data: []
            },
            {
                name: 'слоб. Белый Колодезь',
                data: []
            },
            {
                name: 'хут. Богдановский (фамилии жителей хутора в 1835 г.)',
                data: 'Величко, Медведенко, Тарасов, Чувал'
            },
            {
                name: 'д. Боровенька (Анновка)',
                data: []
            },
            {
                name: 'д. Борщевая',
                data: [
            {
                name: 'слоб. Бочкова (список фамилий за 1915 г.)',
                data: 'Безменов, Ваулин, Выродов, Голубов, Дегтярев, Демин, Дергоусов, Дударев, \n' +
                    'Дударев, Желебовский, Золотухин, Колесников, Корапутин, Купин, Маслов, \n' +
                    'Махонин, Митрохин, Негуторов, Неронов, Плехов, Садовский, Сидельников, \n' +
                    'Сокольников, Тиняев, Ткаченко, Уваров, Черниченко, Шевченко'
            }]},
            {
                name: 'д. Бударная',
                data: [
            {
                name: 'хут. Бузов (список фамилий за 1835 г.)',
                data: 'Бондаренко, Братинников, Гайдашев, Данников, Камышников, Мирошниченко, \n' +
                    'Пиченко, Порохов, Сергеенко, Солодченко, Сухомлинов, Фоменко, Цуканов, \n' +
                    'Черняков, Шевченко, Шелестенко'
            }]},
            {
                name: 'слоб. Бурлук Нижний',
                data: []
            },
            {
                name: 'слоб. Бурлук Средний (Картавый Бурлук)',
                data: []
            },
            {
                name: 'д. Бурлацкое (Бурлучек)',
                data: [
                    {
                name: 'хут. Валуйский (фамилии жителей хутора в 1835 г.)',
                data: 'Ефимченко, Кротенко, Мироненко, Серещенко'
            }]},
            {
                name: 'д. Варваровка',
                data: []
            },
            {
                name: 'с. Василенково',
                data: []
            },
            {
                name: 'слоб. Васильевка',
                data: []
            },
            {
                name: 'с. Великий Бурлук',
                data: []
            },
            {
                name: 'с. Великое',
                data: [
            {
                name: 'хут. Верин (список фамилий за 1835 г.)',
                data: 'Билинский, Бондаренко, Елисеев, Козуб, Крикун, Кущев, Мирошниченко, \n' +
                    'Процун, Симоненко, Федоров'
            }]},
            {
                name: 'д. Викторовка',
                data: []
            },
            {
                name: 'д. Владимировка (список фамилий за 1912 г.)',
                data: 'Ахтырский, Кипаренко, Колесник, Кудин, Овчаренко, Оковитенко, Резник, \n' +
                    'Рябченко, Симонцов, Троценко, Туник, Фесенко, Чуприна, Широкий, Щербак, \n' +
                    'Щербаков, Яковенко'
            },
            {
                name: 'слоб. Волоховка',
                data: []
            },
            {
                name: 'слоб. Волчанские Хутора',
                data: []
            },
            {
                name: 'хут. Волчий',
                data: []
            },
            {
                name: 'хут. Галушкин (фамилии жителей хутора в 1861 г.)',
                data: 'Бебешкин, Гриненко, Гринко, Колесников'
            },
            {
                name: 'с. Гатище',
                data: []
            },
            {
                name: 'д. Георгиевка',
                data: []
            },
            {
                name: 'слоб. Гнилица',
                data: []
            },
            {
                name: 'хут. Гнилушкин (список фамилий за 1915 г.)',
                data: 'Арестов, Безбородов, Гапоненко, Марков, Махонин, Пеньков, Передеренко, \n' +
                    'Репка, Трухачев, Шатохин'
            },
            {
                name: 'слоб. Графское (Андреевка)',
                data: [
            {
                name: 'с. Грачевка (списки фамилий в 1910-х гг.)',
                data: 'Агуреев, Аксененко, Акулов, Алексеев, Алтухов, Анищенкова, Барыбин, \n' +
                    'Барыкин, Башмакова, Беда, Безуглов, Близнюк, Богданова, \n' +
                    'Богданский-Домбровский, Бодянский, Бондаренко, Борисов, Бражников, \n' +
                    'Бурдюкова, Васильева, Вегеренко, Вегеря, Вернигоров, Верченко, Видченко, \n' +
                    'Витченко, Гаврилов, Гагова(Гогова), Гамов, Гогин, Головчанский, Горохов, \n' +
                    'Гребенникова, Гринько, Гриньков, Гузиев, Гусев, Гусева, Декуцкая, \n' +
                    'Домбровского, Евстафиева, Евтушенко, Елисеев, Ермоленко, Ерохин, Животов, \n' +
                    'Жидков, Жилин, Зарубина, Заседская, Земляков, Зозуля, Иванова, Иващенко, \n' +
                    'Иноземцева, Ищенкова, Калашникова, Камышник, Катасонов, Катко, Квиткин, \n' +
                    'Киндяков(Киньдяков), Клименко, Ковалев, Колесников, Коломиец, Коломийцев, \n' +
                    'Корелкин, Корякин, Костоглодов, Костылев, Кошелев, Кузнецов, Кузьменко, \n' +
                    'Кулеш, Купин, Куранов, Курапов, Куценко, Лапин, Лапкин, Лашин, Лебедев, \n' +
                    'Лепенышов, Лесничий, Лобанов, Лобас, Логвинов, Лошакова, Лымарь, Ляхов, \n' +
                    'Макаренко, Макарова, Малышов, Мальцев, Мезенцов, Мезин, Метла, Мехеенко, \n' +
                    'Мирошниченко, Михеенко, Мотижина, Наволоков, Надъярный, Насонов, Невара, \n' +
                    'Неминущий, Неровная, Нефидов, Нижник, Новиков, Овсянников, Овчаров, \n' +
                    'Огурцов, Опришко, Орлов, Панин, Панченко, Перевозенко, Перегуда, Перей, \n' +
                    'Перий, Петренкова, Петухов, Пешкова, Пирей, Писанный, Платонов, Плужник, \n' +
                    'Погремлякова, Поздняков, Полтиннина, Помогаев, Попов, Посохов, Поспелов, \n' +
                    'Потележкин, Потоцкий, Починкин, Прасолова, Прологаев, Рубан, Рыков, \n' +
                    'Рябикин, Рябоконь, Сабельникова, Санин, Сбитнев, Селютин, Семеренько, \n' +
                    'Сивовол, Сидоренко, Сирота, Ситников, Скрылев, Сорока, Сорокин, Сосна, \n' +
                    'Сосновый, Спиридонов, Списивцев, Стефановский, Стрижак, Стрижаков, Сухачев, \n' +
                    'Сухомлинов, Сыдков, Тарасова, Тележка, Тельный, Ткаченко, Товкайло, Удод, \n' +
                    'Уткин, Фендриков. Филенко, Филиппов, Фролов, Хисивич, Хозин, Хрустовский, \n' +
                    'Чаплыгин, Ченцев(Ченцов), Черный, Черсюнов, Чинцов, Чипурной, Чмутов, \n' +
                    'Шабанов, Шевелева, Шевцов, Шевченко, Ширяева, Шопин, Шопинский, Штрикун, \n' +
                    'Шуев, Щербачев, Юрков, Яковлев'
            }]},
            {
                name: 'д. Григорьевка',
                data: []
            },
            {
                name: 'д. Дмитровка (Гонтаровка)',
                data: [
            {
                name: 'слоб. Ефремовка (список фамилий за 1858 г.)',
                data: 'Бирюков, Боченко, Бубнов, Бурменко, Воровенко, Гвозденко, Гетьманенко, \n' +
                    'Грибниченко, Дедешенко, Дрозденко, Жебубенко, Зорин, Калиненко, Калюжник, \n' +
                    'Коваленко, Коваль, Комиристый, Комышанченко, Конишанченко, Кривенко, \n' +
                    'Кряженко, Кулаченко, Курносенко, Куряченко, Кушнаренко, Лапдаренко, \n' +
                    'Лебеденко, Легущенко, Логвиненко, Невмываченко, Нижниченко, Никитенко, \n' +
                    'Переволоченко, Поляков, Потапенко, Романенко, Руденко, Рула, Рябченко, \n' +
                    'Саленко, Середенко, Сквазализый, Скрипниченко, Стрельченко, Сыченко, \n' +
                    'Титаренко, Ткаченко, Удовиченко, Чайченко, Чепиженко, Чернеченко, \n' +
                    'Чумаченко, Шаруненко, Швец, Шевченко, Шелковенко, Шилов'
            }]},
            {
                name: 'хут. Жихарев',
                data: [
            {
                name: 'слоб. Захарьевка (списки фамилии за 1858 и 1915 гг.)',
                data: 'Ананьев, Апанасенко, Артющенко, Архипенко, Асыченко, Багнюков, \n' +
                    'Барылко, Белоус, Богачев, Боговесов, Бондаренко, Бубнов, Бурсов, \n' +
                    'Васильев, Волосожар, Воронин, Гайдабрус, Галушкин, Гарбузов, Герасимов, \n' +
                    'Головнин, Гончаров, Гордиенко, Горошанский, Гречишный, Грушка (Грушкин), \n' +
                    'Демиденко, Демидов, Дроздов, Дулькин, Евтюфеев, Евфременко, Еремин, \n' +
                    'Завгородний, Зубченко, Зыбин, Иванов, Илларионов, Калинько, Кириченко, \n' +
                    'Кициев, Колесников, Колесниченко, Колтунов, Конопельцев, Короткий, \n' +
                    'Костоглодов, Костюков, Кошиленок, Крылов, Кугутов, Кулаков, Курдупенко, \n' +
                    'Курупатенко, Ларионов,	Лебедев, Лободин, Логвин, Луговиков, Любченко, \n' +
                    'Мирошниченков, Михайлов, Мишаев, Могильный, Моргунов, Назаренко, \n' +
                    'Нейваненко, Нефидов, Никитенко, Павленко, Плоткин, Полтавченко, \n' +
                    'Пономарев, Попов, Пристромин, Рябоштан, Савостьянов, Семеренский, \n' +
                    'Сергиенко, Скаралупов, Скрынников, Сузый, Сулименко, Тельной, Титаренко, \n' +
                    'Ткаченко, Торбин, Уколов, Ушкалов, Худяков, Черняченко, Чугуев, \n' +
                    'Шевченко, Шилобритов, Шимченко, Шуликов, Щербинин'
            }]},
            {
                name: 'д. Землянки',
                data: []
            },
            {
                name: 'д. Зыбина (Ивановка)',
                data: []
            },
            {
                name: 'д. Ивановка Старая (Симоновка) Список фамилий за 1912 г.',
                data: 'Балагура, Бондаренко, Галушка, Добробаба, Евфимец, Жилин, Колбаса, \n' +
                    'Литвиненко, Лялюк, Манило, Мильченко, Погорелый, Пудов, Саенко, Скубак, \n' +
                    'Сорока, Супрун, Сыроватский, Чудак, Швайка, Юрченко'
            },
            {
                name: 'слоб. Ивановка (список фамилий за 1858 г.)',
                data: 'Ананьев, Беколаев, Брынцов, Васильев, Герасимов, Голофеев, Гончаров, \n' +
                    'Григорьев, Конопельцов, Короткой, Ларионов, Лашков, Маликов, Мельников, \n' +
                    'Михайлов, Никифоров, Пирогов, Симеонов, Скоролупов, Тел(ь)нов, Трифонов, \n' +
                    'Чекардин'
            },
            {
                name: 'д. Ильмень',
                data: []
            },
            {
                name: 'слоб. Козинка (Юшина). Список фамилий за 1858 г.',
                data: 'Агурцов, Адинцов, Алтухов, Апаренко, Баранов, Барыбин, Биленский, \n' +
                    'Бисетский, Борщов, Бунчиков, Бутиков, Быков, Валасатый, Гладкий, Губан, \n' +
                    'Губин, Гусев, Далинский, Елисеев, Епринцов, Ерофеенко, Ерохин, Есипов, \n' +
                    'Жилин, Занин, Зивякин, Злобин, Зыбин, Каверник, Камаюнов, Камышаев, \n' +
                    'Карякин, Катасонов, Купившенко, Линов, Лобанов, Лунин, Лыков, Морозов, \n' +
                    'Наволикин, Овсянников, Орлов, Печулин, Пивцов, Попов, Посохов, Рубинский, \n' +
                    'Саламатин, Самароков, Санин, Свищов, Сиврюков, Стороженко, Титов, Тютчев, \n' +
                    'Федоров, Ходячий, Черников, Чернятченко, Чирвин, Чумаков, Шаповал, Шаров, \n' +
                    'Широкий, Шопин, Щеглов, Яковлев'
            },
            {
                name: 'хут. Кораичный (фамилии жителей хутора в 1915 г.)',
                data: 'Ваулин, Выродов, Купин, Уваров'
            },
            {
                name: 'пост. двор Корщевый',
                data: []
            },
            {
                name: 'слоб. Котовка',
                data: []
            },
            {
                name: 'с. Кочеток',
                data: []
            },
            {
                name: 'д. Красное',
                data: []
            },
            {
                name: 'д. Крейдянка',
                data: []
            },
            {
                name: 'д. Лиманное',
                data: []
            },
            {
                name: 'д. Лосевка',
                data: []
            },
            {
                name: 'слоб. Малая Волчья',
                data: []
            },
            {
                name: 'слоб. Мартовая',
                data: []
            },
            {
                name: 'хут. Марьевский (список фамилий за 1915 г.)',
                data: 'Андрейченко, Борисенко, Гапоненко, Демешко, Диденко, Зубашенко, \n' +
                    'Ивельга, Ивельженко, Коваленко, Колбаса, Логвиненко, Лысенко, \n' +
                    'Майборода, Макогон, Мандрик, Погорелов, Поливода, Полковниченко, \n' +
                    'Сугоконь, Хирный, Черношеенко, Шулика'
            },
            {
                name: 'д. Марьино Поле',
                data: []
            },
            {
                name: 'д. Марьяновка',
                data: []
            },
            {
                name: 'с. Молодовое (список жителей села за 1809 г.)',
                data: 'Авксентий Ермолаев Муравлев, Андрей Федотов Лобозев, Иван Григориев \n' +
                    'Толстой, Лукьян Афанасиев Долганин, Егор Есаев Русанов, Илья Ильин Тимофеев, \n' +
                    'Николай Андреев Тимофеев, Григорий Терентиев Стрельников, Митрофан Никитин \n' +
                    'Русанов, Иван Прохоров Толстой, Поликарп Семионов Толстой, Федор Павлов \n' +
                    'Лобозев, Ефим Александров Муравлев, Иван Петров Барыбин, Стефан Васильев \n' +
                    'Толстой, Мартин Васильев Стрельников, Андрей Евдокимов Черкашин, Александр \n' +
                    'Никитин Русанов, Иван Иванов Дергоусов, Автомон Епифанов Зорин, Роман \n' +
                    'Федоров Сотников, Филипп Федоров Тимофеев, Прохор Александров Муравлев, \n' +
                    'Аким Алексеев Мальнов, Прокофий Денисов Костромичев, Андрей Стефанов Русанов, \n' +
                    'Данил Герасимов Дергоусов, Петр Никитин Русанов, Василий Кириллов Лобозев, \n' +
                    'Никита Федоров Дергоусов, Моисей Афанасиев Толстой, Яков Елисеев Муравлев, \n' +
                    'Сергей Павлов Толстой, Ларион Акимов Толстой, Федор Марков Правоторов, \n' +
                    'Прохор Яковлев Александров, Герасим Прохоров Толстой, Тимофей Иванов \n' +
                    'Черкашин, Иван Захаров Тимофеев, Никифор Ильин Гаврилов отставной солдат, \n' +
                    'Фрол Филатов Губин отставной улан, Стефан Евстафиев Комарев, Иван \n' +
                    'Терентиев Ватулин, Андрей Митрофанов Лебедев'
            },
            {
                name: 'с-цо Нетайловка (Васильевка)',
                data: []
            },
            {
                name: 'слоб. Николаевка (Николаевка Третья, Вадбольское, Раззореная)',
                data: []
            },
            {
                name: 'слоб. Николаевка Трубецкая (Варваровка)',
                data: []
            },
            {
                name: 'д. Никольская (Екатерино-Никольское)',
                data: []
            },
            {
                name: 'д. Ново-Александровка (Балаклеевка). Список фамилий за 1915 г.',
                data: 'Балабаев, Бельченко, Бондаренко, Брехунченко, Букивец, Бурменко, Галагат, \n' +
                    'Галагура, Галат, Горбаченко, Данильченко, Дзюба, Довбыш, Довбышев, Дриль, \n' +
                    'Дьяченко, Евфименко, Жук, Жуков, Здор, Зинченко, Капустянов, Коленько, \n' +
                    'Колесников, Коробейник, Крикун, Крикунов, Кузуб, Курнос, Куценко, Куцугуб, \n' +
                    'Кучеренко, Кущов, Левченко, Любченко, Лящев, Лящь, Маницкий, Мирошниченко, \n' +
                    'Нелепа, Николенко, Пацакула, Перепелица, Потапенко, Приходченко, Рыбалка, \n' +
                    'Рыльский, Свикольников, Сиденко, Симоненко, Сирота, Скосарь, Смык, \n' +
                    'Счастливый, Терещенко, Ткаченко, Тренев, Тютюнник, Тютюнник, Чегринов, \n' +
                    'Шевченко, Шейко'
            },
            {
                name: 'слоб. Ново-Белгород (Печенеги)',
                data: []
            },
            {
                name: 'слоб. Ново-Бурлуцкое',
                data: []
            },
            {
                name: 'д. Новодоновка',
                data: []
            },
            {
                name: 'д. Ново-Ивановка',
                data: []
            },
            {
                name: 'слоб. Новоспасское (Пасековка)',
                data: []
            },
            {
                name: 'слоб. Огибная',
                data: []
            },
            {
                name: 'слоб. Ольховатка (список фамилий за 1835 г.)',
                data: 'Авдеев, Агареев, Агуреев, Агурцов, Акулов, Алипов, Алтухов, Алферов, \n' +
                    'Антонов, Артебякин, Асеев, Байдиков, Барыбин, Богданов, Бочаров, \n' +
                    'Брагин, Войлоков, Волков, Воробьев, Гамов, Горбашев, Гребенников, \n' +
                    'Гулевский, Гусев, Гущин, Дедков, Димченков, Евдокимов, Елисеев, Ерохин, \n' +
                    'Есипов, Железцов, Животов, Жилин, Зарубин, Заседской, Збитнев, Зиборав, \n' +
                    'Кандабаров, Карякин, Катасонов, Киндяков, Клюшников, Козменко, \n' +
                    'Коломенской, Корочи(а)нский, Крюков, Кулаков, Купин, Курапов, Лашин, \n' +
                    'Леденев, Листопадов, Лобанов, Логвинов, Ляхов, Мальцов, Малюкин, \n' +
                    'Мезенцов, Митрохин, Мишнев, Мулюкин, Мумакин, Наволоков, Насонов, \n' +
                    'Нефидов, Нехорошей, Новиков, Овсяников, Олипов, Орлов, Панин, Певцов, \n' +
                    'Петухов, Пристинов, Пишков, Помагаев, Пономарев, Попков, Попов, \n' +
                    'Порываев, Посохов, Починков, Пролагаев, Пышков, Ребинин, Резанцев, \n' +
                    'Руднев, Рыков, Самороков, Санин, Сафонов, Свищенко, Сенников, \n' +
                    'Сердюков, Серебряков, Снегирев, Сорокин, Спесивцев, Стороженко, \n' +
                    'Тарасов, Тоболенко, Трусов, Уткин, Фендриков, Филатов, Ходячий, \n' +
                    'Хорошилов, Хрускин, Хрустовский, Цыркунов, Чаплыгин, Ченцов, Черкасов, \n' +
                    'Черной, Черняков, Чирвин, Чмутов, Чурсинов, Шабанов, Шаров, Шахов, \n' +
                    'Шведов, Шевелев, Шевяков, Юрков, Яковлев'
            },
            {
                name: 'слоб. Отрадное (Ковалька)',
                data: []
            },
            {
                name: 'слоб. Петропавловка (список фамилий за 1912 г.)',
                data: 'Бондаренко, Борщов, Буриков, Галушка, Голуб, Горазій, Данильченко, \n' +
                    'Карпенко, Кислый, Колбаса, Колесник, Корниенко, Краснокутский, Куропатенко, \n' +
                    'Лесовой, Лимарев, Лубенко, Лысенко, Любченко, Ля(е)люк, Мартовицкий, Мацока, \n' +
                    'Машуенко, Мирошниченко, Мысливцев, Немченко, Нижегольский, Овчаренко, \n' +
                    'Олейник, Осеенко, Павченко, Пасынок, Пелипец, Перепелица, Полозюк, Попов, \n' +
                    'Прасолов, Ребрун, Свинарь, Середа, Синельников, Скубак, Сокирка, Сорока, \n' +
                    'Тютюнник, Чмалев, Широкорад, Шпольной, Юрченко, Ягнюк'
            },
            {
                name: 'слоб. Писаревка',
                data: []
            },
            {
                name: 'слоб. Писаревка Верхняя (Покровское)',
                data: []
            },
            {

                name: 'слоб. Плотвянск (Благодатное). Списки фамилий в 1910-х гг.',
                data: 'Акулов, Александров, Алипов, Андреев, Анищенко, Антид…в, Апрышко, \n' +
                    'Артеменкова, Артемов, Бабкин, Багнюков, Балабаев, Батанова, Башмаков, \n' +
                    'Бешенко, Бобрусь, Богачев, Боговесов, Боженко, Бондаренко, Бондарцов, \n' +
                    'Борисенко, Бородавкин(Бородовкин), Борыльченко, Братишкин, Буглова, \n' +
                    'Булавинов, Бурцев, Буханькова, Верченко, Ветров, Ветрова, Висожаров, \n' +
                    'Волков, Волкова, Волобуев(Валабуев), Гайворонский, Гайдамаков, Гайдатова, \n' +
                    'Гайдашев, Гайдашева(Гайдашова), Галушкин, Гандатова, Гарбузов, \n' +
                    'Герасименко, Германов, Глотов, Головкин, Голшенко, Гонтарев, Гончаров, \n' +
                    'Горохов, Горошанский, Гостьев, Грайворонский, Гречишный, Григорьев, \n' +
                    'Грушкин, Гузиев, Гура, Гусаков, Гусьев, Данченко, Демидов, Дехтярев, \n' +
                    'Донской, Дулька, Дулькин, Дыркачева, Евтифиев, Елисеев, Епишов, Еремин. \n' +
                    'Ерохин, Жеглов, Жидков, Задорожний, Заковоротний, Засидский, Зинченко, \n' +
                    'Зубченко, Иващенко, Игнатиев, Ильяшенко, Казаченкова, Калиниченко, \n' +
                    'Каменьков, Камышников, Каплуненко, Каплунов, Катасонов, Катков, \n' +
                    'Кашенькова, Киндяков, Киреева, Кириченко, Климова, Ковалев, Когутов, \n' +
                    'Когутов, Козаченко, Козжупов, Колесников, Колосовский, Колтунов, \n' +
                    'Комышников, Кондратьев, Конопельцев, Копылов, Короб, Корочанский \n' +
                    'Корякин, Косолапов, Костоглодов, Котелев, Кошелев, Кривошеенко, Корочанский, \n' +
                    'Крикун, Кудыльченко, Куземка, Кулаченко, Кулыгин, Кундупова, Курапов, \n' +
                    'Курганский, Курдупов, Курильченко, Курупатенко, Курыльченко, Кухаренко, \n' +
                    'Куценко, Кущов, Лебедев, Лепенышев, Лисовенко, Лободин, Логвинов, \n' +
                    'Лубенская, Лысаков, Ляшев(Ляшов), Максаков, Максименко, Мантулин, \n' +
                    'Мельникова, Михаилов, Моргунов, Мордовенко, Морозов, Мотузков, Мулюкин, \n' +
                    'Негодяев, Нефидов, Нехорошев, Никитенко, Никитенкова, Николаенко, \n' +
                    'Николка, Овсянников, Овчаров, Онищенко, Павлюков, Панин, Панихидин, \n' +
                    'Перевертайленко, Перепелица, Петренко, Петротельный, Петухов, Пикин, \n' +
                    'Питюков, Пиченко, Подавайленко, Полтавченко, Полузюков, Полупан, Попов, \n' +
                    'Посохов, Потапенко, Потележка, Потелижкин, Правда, Прокопенко, Просула, \n' +
                    'Пузиков, Радченко, Ревков, Рубан, Рыбалкина, Рыбальченко, Рябоштан, \n' +
                    'Садков, Санин, Свикольников, Свиридов, Селюкова, Семененко, Семенников, \n' +
                    'Семиненко, Семиренский, Семоков, Сергиенко, Сизов, Сикачев, Ситников, \n' +
                    'Скоков, Слола, Слонов, Слюков(Селюков), Слюсаренко, Сматров, Смола, \n' +
                    'Смык, Сорокин, Стратенко, Сузов, Сухомлин, Сухомлинов, Таратушка, \n' +
                    'Тельной, Терещенко, Титаренко, Толкунов, Трембач, Трясоруков, \n' +
                    'Фальченко, Фирсов, Фоменко, Хамайко, Харченко, Ходячий, Хорошев, \n' +
                    'Хрустовский, Худаков, Цуканов, Чеботарев, Чекардин, Ченгур(Ченчур), \n' +
                    'Ченцов, Черкасов, Черняков, Чугуев, Чумаченко, Шабанов, Шевченко, \n' +
                    'Шелест, Шепеленко, Шилов, Шкаралупов, Шопенский(Щопинский), \n' +
                    'Шрамченко(Шромченко), Шуев, Шуляков, Щербаченко, Юрченко, Яковлев, \n' +
                    'Ясаев, Ясенко, Ясенков, Ясенок, Яциценко'
            },
            {
                name: 'хут. Плотвянский (Турчанов). Список фамилий за 1858 г.',
                data: 'Бишенко, Ворона, Голубенко, Иванов, Лащеный, Максименко, Мантулин, \n' +
                    'Перевейтайленко, Питюков, Погребняк, Потапенко, Правда, Ревнов, \n' +
                    'Свекольников, Улещенко, Фирсов, Фирсов'
            },
            {
                name: 'хут. Погорелый (список фамилий за 1912 г.)',
                data: 'Андрейченко, Баран(н)ик, Бережный, Билька, Бражник, Бусюк, \n' +
                    'Гончаров, Дмитренко, Евдошенко, Ищенко, Калитник, Капинос, Коваленко, \n' +
                    'Козачек, Коломиец, Курочка, Лимарь, Липчанский, Мирошниченко, Опарий, \n' +
                    'Печенежский, Пожулись, Полуянов, Портянка, Роздайбеда, Светличный, \n' +
                    'Солодовник(-ов), Татарко, Терещенко, Шаполвалов, Шевченко, Шеремет'
            },
            {
                name: 'д. Польная',
                data: []
            },
            {
                name: 'хут. Приколотый (фамилии жителей хутора в 1835 г.)',
                data: 'Багнюков, Костенко, Майборода, Мартишко, Пирогов, Приванов, Сафонов'
            },
            {
                name: 'слоб. Просянка (Просяная)',
                data: []
            },
            {
                name: 'с. Пятницкое',
                data: []
            },
            {
                name: 'д. Рассоховка',
                data: []
            },
            {
                name: 'д. Рогозянка',
                data: []
            },
            {
                name: 'хут. Романов (Бакшеевка). Список фамилий за 1912 г.',
                data: 'Борщев, Брехунченко, Гарбунов, Гатицкий, Жеглов, Капленко, \n' +
                    'Колесников, Лихотерез, Марадуда, Могилка, Мороз, Пацакул, Поляков, \n' +
                    'Радченко, Тренев, Фоменко, Хижняк, Четвериков, Шевченко'
            },
            {
                name: 'д. Романовка',
                data: []
            },
            {
                name: 'с. Рубежное',
                data: []
            },
            {
                name: 'с. Рубленое (список фамилий за 1861 г.)',
                data: 'Агурцов, Алексеев, Бавыкин, Барыбин, Бондарев, Борзый, Булгаков, \n' +
                    'Бурдюков, Гусев, Ерохин, Жельцов, Жидков, Злобин, Карякин, Касенков, \n' +
                    'Катасонов, Киндяков, Колошин, Кузнецов, Кулаков, Купин, Курапов, \n' +
                    'Лашин, Лобанов, Мальцов, Мезенцев, Мозгирев, Наволоков, Нефидов, \n' +
                    'Новиков, Нозгарев, Панин, Поганкин, Позняков, Попов, Посохов, Поспелов, \n' +
                    'Пролагаев, Резанцов, Рыков, Самохин, Санин, Сафонов, Серебряков, \n' +
                    'Ситников, Сорокин, Умашев, Фендриков, Черкелов, Юрков, Яковлев'
            },
            {
                name: 'слоб. Салтов Старый (Нижний)',
                data: []
            },
            {
                name: 'слоб. Салтов Верхний',
                data: []
            },
            {
                name: 'хут. Сиротин (фамилии жителей хутора в 1835 г.)',
                data: 'Ветер, Ветренко, Колинько, Курочка, Николенко, Череповской'
            },
            {
                name: 'хут. Слезнев (список жителей хутора за 1858 г.)',
                data: 'Войченко Калистрат, Ерохин Федор, Загородный Федор, Иванова Марина, \n' +
                    'Кулишова Аксинья, Лесовой Ларион, Мирошниченко Терентий, незаконнорожд. \n' +
                    'Селиверст по крестному отцу Трофимов Чемевцов, Несмачный Иван, \n' +
                    'Пономаренко Константин, Скибинский (?) Федот, Череванев Филипп, \n' +
                    'Шерепетлева Прасковья, Шулик Авксентий, Щербак Данило'
            },
            {
                name: 'д. Софиевка (список фамилий за 1912 г.)',
                data: 'Ахтырский, Бондарь, Волошенко, Голуб, Гринев, Дудник, Капустян, \n' +
                    'Колбаса, Колесников, Корх, Корхов, Коршун, Костенко, Котляров, Лихоман, \n' +
                    'Майборода, Мартовицкий, Осиковский, Пелипец, Попов, Прасол, Решетников, \n' +
                    'Сальницкий, Сергиенко, Синельников, Сокирка, Стыценко, Суплюнов, \n' +
                    'Титаренко, Федоренко, Шевченко, Юрченко'
            },
            {
                name: 'слоб. Терновая',
                data: []
            },
            {
                name: 'хут. Тихий Берег (жители хутора в 1858 г.)',
                data: 'Стефан Артемьев Попов, Лукьян Федоров Солоненченко, Федор \n' +
                    'по крестному отцу Шинкаренко (мать Марфа Михайлова Дропотунова), \n' +
                    'девка Анна Андреева Акименкова, Никита Артемов Попов, Павел Макаров \n' +
                    'Снедало, Федор Артемов Попов, Дмитрий Леонтьев Солоненченко, Никита \n' +
                    'Иванов Масальский, вдова Ефимия Емельянова Завгородняя'
            },
            {
                name: 'слоб. Троицкое (Чернецкое)',
                data: []
            },
            {
                name: 'слоб. Удобная (Ивановка)',
                data: []
            },
            {
                name: 'д. Федоровка (Малый Бурлук). Список фамилий за 1890 г.',
                data: 'Абраменко, Блоха, Бондар, Брославский, Герман (Гирман), Гроза, \n' +
                    'Добролежа, Дудка, Заец, Коробка, Кощеев, Лещенко, Лихолеп, Лузан, \n' +
                    'Мирошник, Моргун, Нестернека, Потапенко, Рубежанский, Салогуб, Сахно, \n' +
                    'Свитлычка, Струк, Тыряник, Харченко, Хлыстун, Холод'
            },
            {
                name: 'слоб. Хатняя',
                data: []
            },
            {
                name: 'слоб. Хотомля',
                data: []
            },
            {
                name: 'д. Чайковка (списки фамилий в нач. XX в.)',
                data: 'Бурменко, Гайворонский, Галушка, Гнутов, Голубов, Грайворонский, \n' +
                    'Гребенник, Гребенников, Дедещенко, Комышанченко, Кривенко, Ландаренко, \n' +
                    'Лебеденко, Лыков, Ляшенко, Мирошниченко, Муренченко, Недохлебов, \n' +
                    'Никитенко, Павыченко, Пластунов, Потапенко, Рыбалка, Рыбалченко, \n' +
                    'Сепетенко, Сердюков, Стрельченко, Сыченко, Чайкин, Черняченко, \n' +
                    'Чидков(?), Шовкунов'
            },
            {
                name: 'хут. Черный (список состоящих на действительной службе, 1915 г.)',
                data: 'Кирилл Иванов Петухов - 21, Савва Павлов Петухов - 27, Петр Иванов Петухов \n' +
                    '- 4-, Мефодий Терентиев Петухов - 34, Григорий Терентиев Петухов - 32, \n' +
                    'Евстафий Терентиев Петухов - 21, Михаил Ефремов Петухов - 39, Евтихий \n' +
                    'Демьянов Петухов - 30, Кирилл Даниилов Петухов - 36, Петр Иванов Петухов - 20, \n' +
                    'Емельян Андреев Петухов - 29, Семен Андреев Петухов - 40, Иван Евстафиев \n' +
                    'Петухов - 39, Михаил Исаев Петухов - 28, Митрофан Федоров Петухов - 26, \n' +
                    'Емельян Семенов Петухов - 24, Василий Семенов Петухов - 23, Василий Евстафиев \n' +
                    'Петухов - 33, Зиновий Дмитриев Петухов - 30, Петр Дмитриев Петухов - 28, \n' +
                    'Исай Максимов Петухов - 27, Гавриил Герасимов Петухов - 27, Евфим Павлов Петухов - 21'
            },
            {
                name: 'слоб. Шеповатое (Шиповатый)',
                data: []
            },
            {
                name: 'с. Юрченково',
                data: []
            }]},
            {
                name: "Змиевской уезд",
                data: [
                    {
                        name: 'г. Змиев',
                        data: []
                    },
                    {
                        name: 'д. Александровка (дворовые люди Соколовских и крестьяне, 1858 г.)',
                        data: 'Беличенко, Круглой, Науменко, Самарский'
                    },
                    {
                        name: 'с. Алексеевское (список фамилий за 1858 г.)',
                        data: 'Абакумов, Агурцов, Азаров, Амелин, Аносов, Аносова, Афанасьев, \n' +
                            'Балаклейский, Барков, Барыбин, Башеев, Бобров, Богданчиков, Бондаренко, \n' +
                            'Бочаров, Брыксин, Булгаков, Бутырин, Быков, Волобуев, Воробьев, \n' +
                            'Воронов, Воротынцов, Выскребцов, Выслогузов, Гаврютенко, Гвоздев, \n' +
                            'Глущенко, Грищенко, Гнукин, Горбатовский, Горелков, Горохов, \n' +
                            'Горькавцов, Гриняев, Гробенко, Гуров, Демидов, Денисов, Дмитренко, \n' +
                            'Драчов, Дурнев, Дурнева, Дутов, Дьяконов, Дюмин, Евсюков, Ерофеев, \n' +
                            'Есипов, Ефремов, Жагулин, Жилин, Зайцов, Захарьев, Збитнев, Звегинцов, \n' +
                            'Звеков, Зеленин, Золотухин, Зорин, Иваникова, Иванов, Изотова, Казлов, \n' +
                            'Калыхалов, Калыков, Калычов, Капустин, Катунин, Караченцов, Карницкий, \n' +
                            'Клисак, Кекин, Клесов, Колоков, Конев, Кориков, Коринев, Коринев, \n' +
                            'Косенко, Крамской, Красников, Кудрявцов, Курьянов, Лагутин, Ледовской, \n' +
                            'Леонов, Лобов, Лыков, Малахов, Малеев, Маслов, Мачихин, Мезенцов, \n' +
                            'Меренков, Мишин, Мизенов, Минаенков, Митрофанов, Мищенко, Мищеряков, \n' +
                            'Муратов, Мячин, Наземцов, Неботов, Непочатов, Никитин, Новыков, \n' +
                            'Ноздрачов, Обеленцов, Озиров, Орехов, Парамонов, Первушин, Перцов, \n' +
                            'Пещанин, Плетнев, Погожий, Подставкин, Полукаров, Попов, Поспелов, \n' +
                            'Поташев, Путятин, Романенко, Романов, Русанов, Рыжов, Савенков, \n' +
                            'Саврасов, Садовский, Святцов, Селиверстов, Серебров, Сироткин, \n' +
                            'Скорняков, Скоробагатов, Соболев, Стародубцов, Степанов, Судоплатов, \n' +
                            'Сухленко, Сячин, Таньшин, Тарасов, Татаринцов, Тиняев, Тиняков, \n' +
                            'Титов, Тихонов, Толстов, Трубчанинов, Трубыцин, Удовенко, Уласьев, \n' +
                            'Ульяников, Ушаков, Хаврашков, Хрипков, Чеботаев, Чернятин, Четвериков, \n' +
                            'Чикеев, Чубаров, Шабанов, Шаповалов, Шатохин, Шахов, Шевляков, \n' +
                            'Шевченко, Шеховской, Шумской, Щиголев, Юдин, Юшков, Якименко, Яклычев, \n' +
                            'Яковлев, Якшин'
                    },
                    {
                        name: 'д. Апполоновка (дворовые люди помещика Рейхеля и крестьяне, 1858 г.) ',
                        data: 'Бондарь, Дубинин, Куринный, Лысенко, Монастиренко, Нистиренко, \n' +
                            'Пустовит, Типличенко, Скляренко, Шаповал'
            },
            {
                name: 'д. Артюховка',
                data: []
            },
            {
                name: 'сл. Асеевка',
                data: []
            },
            {
                name: 'д. Африкановка',
                data: []
            },
            {
                name: 'д. Бабиновка (Шелиговка)',
                data: []
            },
            {
                name: 'хут. Бакаевка',
                data: []
            },
            {
                name: 'с. Балацеловка',
                data: []
            },
            {
                name: 'д. Безпаловка',
                data: []
            },
            {
                name: 'с. Берека (список фамилий за 1858 г.)',
                data: 'Абалмасов, Авдеев, Аверин, Автамонов, Автамонов, Азаров, Аксенов, \n' +
                    'Алексеев, Алтухов, Андреев, Астахов, Аушев, Афанасьев, Бабин, \n' +
                    'Багринцов, Багров, Баев, Барбинов, Барзенков, Барисов, Барков, \n' +
                    'Бачаров, Башкирев, Башмачкин, Безлебкин, Бекетов, Беленьков, Белов, \n' +
                    'Беляев, Берескин, Бикетов, Биляев, Блинов, Блудов, Богданов, Бредихин, \n' +
                    'Брежнев, Брудков, Брусенцов, Брутков, Булгаков, Быканов, Важов, \n' +
                    'Варабьев, Варавин, Волков, Волобоев, Валобуев, Володин, Вошев, \n' +
                    'Гарелков, Гарелов, Глебов, Гнетнев, Голомаздин, Голубой, Гончаров, \n' +
                    'Горелов, Горлов, Горшков, Гранкин, Гранкин, Грибеников, Григоров, \n' +
                    'Грязев, Гулевский, Гуров, Гуторов, Даев, Даманов, Демяненков, Дмитриев, \n' +
                    'Дремов, Дураков, Дурнев, Еглевский, Еремин, Ефремов, Жаботинский, \n' +
                    'Жидкой, Житков, Жук, Заикин, Залатухин, Заночкин, Захарьин, Звегинцов, \n' +
                    'Зеленин, Зеновьев, Зиборов, Зиновьев, Зубков, Зубов, Изотов, Ильин, \n' +
                    'Инкин, Исаков, Кабилев, Казлов, Калинин, Калугин, Калыванов, Камарев, \n' +
                    'Кананыхин, Канарев, Кануников, Капустин, Картамышев, Касинов, Касьянов, \n' +
                    'Катинев, Кладов, Клачков, Климентьев, Коваленко, Колийко, Комов, \n' +
                    'Константинов, Коринев, Коршунов, Крамской, Красников, Кричевский, \n' +
                    'Крыгин, Кузнецов, Кураедов, Куренев, Лактин, Лактионов, Летичев, \n' +
                    'Ливанидов, Лукинов, Лукьянов, Лукьянчиков, Лунев, Лученцов, Макров, \n' +
                    'Малахов, Мартынов, Марьинков, Матвеев, Мертимянов, Мершалов, Микулин, \n' +
                    'Мяхкой, Набока, Надеин, Наздрачев, Непочатой, Никифоров, Никулин, \n' +
                    'Нинашев, Обернихин, Овсяников, Орлов, Оспищев, Панов, Пахомов, Пенезев, \n' +
                    'Пеньков, Переверзев, Пикалов, Пирашков, Плотников, Подкидуш, Подоприголов, \n' +
                    'Пойменов, Покушалов, Половинкин, Полозинцов, Польской, Полянский, Попов, \n' +
                    'Праскурин, Прокопенко, Пыжов, Резанцов, Романов, Руднев, Рылин, Рышков, \n' +
                    'Рядной, Савченков, Салавьев, Салтиков, Самойлов, Сановицкий, Саприкин, \n' +
                    'Сапрыкин, Сафонов, Свищов, Селихов, Семендеев, Сергеев, Сидоров, \n' +
                    'Сниговой, Спесивцов, Стиркаленко, Стельников, Страхов, Суворов, Суслов, \n' +
                    'Сухаруков, Талакнеев, Таманов, Танкой, Татаренков, Татаринков, Тилешов, \n' +
                    'Умрихин, Филипов, Фомяков, Харьяков, Хахлов, Цырульников, Чавикин, \n' +
                    'Чавыкин, Ченцов, Черипов, Черкасов, Черкашин, Черников, Черной, Чмутов, \n' +
                    'Чуйков, Чунихин, Чурилов, Чухранов, Шаламов, Шаповалов, Шевелев, \n' +
                    'Шивелев, Шипилов, Ширяев, Шишкин, Щербак, Щипов, Щитов, Юдин, Юшков, \n' +
                    'Якимов, Яковлев, Якунин'
            },
            {
                name: 'д. Богодаровка (при р. Попельной)',
                data: []
            },
            {
                name: 'с-цо Богодаровка (при р. Балаклейке)',
                data: []
            },
            {
                name: 'с. Богородицкое (Масловка)',
                data: []
            },
            {
                name: 'с. Борки',
                data: []
            },
            {
                name: 'с. Боровое',
                data: []
            },
            {
                name: 'с. Борщевое',
                data: []
            },
            {
                name: 'с. Бригадировка',
                data: []
            },
            {
                name: 'сл. Булацеловка (список фамилий за 1858 г.)',
                data: 'Андрющенко, Вевва, Водяницкий, Кошелев, Лесовой, Литвин, Мартынов, \n' +
                    'Мирошниченко, Приходько, Регун, Тимофеев, Федоренко, Шумихин'
            },
            {
                name: 'д. Бунаковка (дворовые люди Рядновых и крестьяне, 1858 г.)',
                data: 'Бабаков, Балабан, Бондаренко, Будько, Воловик, Волошин, Гребенников, \n' +
                    'Калина, Ляшенко, Михайличенко, Онищенко, Пойда, Руденко, Совенко, \n' +
                    'Таранов, Черненко, Шетко(?), Шкуратов'
            },
            {
                name: 'с. Введенское',
                data: []
            },
            {
                name: 'с. Вербовка',
                data: []
            },
            {
                name: 'с. Верхний Бишкин (список фамилий за 1858 г.)',
                data: 'Аверин, Авчинников, Азаров, Алисов, Алфимов, Анисимов, Арехов, Артемов, \n' +
                    'Астахов, Ачкасов, Бабичев, Баздырев, Барабанов, Барзенков, Басов, Бачаров, \n' +
                    'Безбородов, Белоусов, Бирев, Блудов, Богданов, Бойченко, Бондарев, Бруев, \n' +
                    'Брусенцов, Будник, Быканов, Важов, Веревкин, Волков, Волобуев, Воронков, \n' +
                    'Воротынцов, Вразов, Выродов, Гавшин, Гарбунов, Головин, Голодников, \n' +
                    'Голомаздин, Горелков, Горелой, Горенков, Грабов, Грамыхин, Гранкин, \n' +
                    'Григоров, Гридин, Гуринов, Гуров, Данилов, Денисов, Дмитриев, Долоненко, \n' +
                    'Дюмин, Ерин, Ершов, Есков, Ефремов, Жердев, Заикин, Зайцов, Затолокин, \n' +
                    'Золатарев, Золотухин, Зорин, Капырин, Каратаев, Караченцов, Картавцов, \n' +
                    'Касинов, Кизлитин, Киндеев, Кичигин, Климов, Кобызев, Комов, Кононов, \n' +
                    'Константинов, Корелой, Коровин, Костарной, Костенко, Костин, Крамской, \n' +
                    'Красников, Кражин, Курьянов, Кучков, Лактионов, Лифенцов, Лихвинцов, \n' +
                    'Лозовский, Лукинов, Ляшенко, Малой, Малыхин, Мальцов, Мамкин, Марков, \n' +
                    'Мартынов, Маслов, Меснянкин, Миронов, Михнев, Муратов, Мухин, Мухортов, \n' +
                    'Мясоедов, Невзоров, Непомнющий, Никитин, Новоселов, Новосельцов, \n' +
                    'Пересыпкин, Петинов, Петров, Пикалов, Пискарев, Пихтин, Плахой, \n' +
                    'Поликарпов, Попов, Потолов, Путятин, Разводов, Репрынцов, Роганин, \n' +
                    'Рогов, Романов, Росляков, Рудаков, Рыжков, Савенков, Салихов, \n' +
                    'Салодовников, Самороков, Сапрыкин, Сбитнев, Селицкий, Семенихин, \n' +
                    'Сенюков, Сериков, Серой, Сидоренко, Сидоров, Смяцкой, Строев, Суворов, \n' +
                    'Суженин, Суханов, Сырой, Талакнеев, Татаринцов, Тицкий, Трубицын, Тутов, \n' +
                    'Федотов, Фидосеенко, Филипов, Филипский, Фролов, Фурсов, Халин, Хардиков, \n' +
                    'Холостой, Хрипков, Чапленко, Чаплыгин, Черкашин, Чеснаков, Чуринов, \n' +
                    'Шабанов, Шелехов, Шеховской, Шилов, Ширяев, Шостак, Щетинин, Щукин, \n' +
                    'Юдин, Юхновский, Юхновский, Яковлев, Ярыгин, Ястребков'
            },
            {
                name: 'д. Владимировка',
                data: []
            },
            {
                name: 'с. Водяное',
                data: []
            },
            {
                name: 'с. Волохов Яр',
                data: []
            },
            {
                name: 'с. Волчий Яр',
                data: []
            },
            {
                name: 'с. Высочинoвка (список фамилий за 1858 г.)',
                data: 'Беличенко, Богомолов, Голубков, Жданов, Кочетков, Кузнеченко, Малерев, \n' +
                    'Солдатенко, Тенко, Хижняков'
            },
            {
                name: 'д. Гавриловка',
                data: []
            },
            {
                name: 'с. Геевка (Бурлей)',
                data: []
            },
            {
                name: 'с. Генеевка',
                data: []
            },
            {
                name: 'д. Гетьмановка (Беляевка)',
                data: []
            },
            {
                name: 'д. Гетьмановка (Капустиновка, Бурлуцкий)',
                data: []
            },
            {
                name: 'слоб. Глазуновка',
                data: []
            },
            {
                name: 'с-цо Глубокое (Марьинское)',
                data: []
            },
            {
                name: 'с. Гнилица (Ивановка)',
                data: []
            },
            {
                name: 'д. Гнилицкий (Ивановский, Жуковка)',
                data: []
            },
            {
                name: 'с. Гомольша',
                data: []
            },
            {
                name: 'д. Горожановка',
                data: []
            },
            {
                name: 'хут. Готендорф (Гуковка)',
                data: []
            },
            {
                name: 'с. Граково (список фамилий за 1858 г.)',
                data: 'Аргунов, Артяков, Ачкасов, Богополов, Балабас, Бугаев, Бедной, Борисов, \n' +
                    'Волинкин, Володин, Васильев, Воробьев, Витчинкин, Волков, Гончаров, \n' +
                    'Губкин, Голянищев, Гаврилов, Ганшин, Гордиенко, Гуслев, Дубосарский, \n' +
                    'Ефимов, Еремин, Есипенко, Жуга, Заховаев, Запорозский, Иващенко, Костин, \n' +
                    'Куприн, Кутепов, Комышан, Канарев, Красильников, Картанов, Кислинский, \n' +
                    'Лесовиков, Латанов, Лахтин, Любутин, Лазухин, Ливинцов, Лебедев, Лизогубов, \n' +
                    'Марочкин, Миндарь, Мирошников, Малявин, Михайлов, Матвеенко, Новицкий, \n' +
                    'Неелов, Переродов, Павленко, Попов, Пивень, Пугач, Пилев, Подьяконов, \n' +
                    'Рыбалка, Раздорский, Ребинин, Слатин, Смирной, Слюнин, Сетененко, Тонкой, \n' +
                    'Трофимов, Трусов, Тельной, Трофименко, Урода, Фурсов, Хмилев, Чиженко, \n' +
                    'Черной, Шехавцов, Шандула, Шаламов, Явников, Ященко'
            },
            {
                name: 'д. Грушина',
                data: []
            },
            {
                name: 'с. Гуляй-Поле (дворовые люди помещика Петровского и крестьяне, 1858 г.)',
                data: 'Белоножко, Белоус, Бирка, Борисенко, Воловод, Гаврилейченко, Гапон, \n' +
                    'Геевский, Горгон, Гринь, Дабарский, Дробот, Жиденко, Загребелька, Заец, \n' +
                    'Каркач, Карнаух, Козаченко, Коровник, Кулик, Куцай, Леусенко(?), Малышко, \n' +
                    'Маренко, Мудрак, Науменко, Нога, Павленко, Педченко, Повелица, Поламарь, \n' +
                    'Пономаренко, Прокопенко, Редька, Резниченко, Седаш, Сенчуков, Серик, Сероштан, \n' +
                    'Синей, Сирик, Сорока, Суббота, Субботовенко, Тарасенко, Тимченко, Федоров, \n' +
                    'Чередник, Шматков'
            },
            {
                name: 'д. Добролюдовка (Павловка, Доброполы)',
                data: []
            },
            {
                name: 'хут. Доброполье',
                data: []
            },
            {
                name: 'с. Дудковка',
                data: []
            },
            {
                name: 'д. Екатериновка (Новоселовка)',
                data: []
            },
            {
                name: 'с. Ефремовка (Тройчатое). Cписок фамилий за 1858 г.',
                data: 'Александров, Апальков, Арлов, Арехов, Бабын (Бабин), Бондарев, \n' +
                    'Воротников, Гнирен, Горохов, Дорошин, Жидков, Ждамиров, Жуков, Зорницкий, \n' +
                    'Калесников, Калыванов, Камышников, Канищев, Касинов, Каратеев, Киньшаков, \n' +
                    'Корбан, Кузякин, Кушныренко, Латышов, Михайлов, Непочатов, Нечаев, \n' +
                    'Овсянников, Озиров, Плотников, Путятин, Рышков, Саприкин, Седов, \n' +
                    'Скамарохов, Соболев, Солдатов, Смерницкий, Страхов, Сумской, Татаренков, \n' +
                    'Терехов, Трубников, Филатов, Фомычов, Хахлов, Хладченко, Хлоповский, \n' +
                    'Чунихин, Шульгин, Юриков'
            },
            {
                name: 'хут. Задонецкий',
                data: []
            },
            {
                name: 'хут. Закутний (список фамилий за 1858 г.)',
                data: 'Агафоненко, Анацкий, Андрущенко, Бабаевский, Бакаенко, Барабаш, \n' +
                    'Батраченко, Безпалой, Безрученко, Богатиренко, Бойник, Бордун, Борисенко, \n' +
                    'Булгаков, Бутник, Вакало, Веприцкий, Вечерко, Ганж(ш)ила, Горбатенко, \n' +
                    'Гричаный, Гуртенко, Гутник, Даниленко, Даценко, Димченко, Евдокименко, \n' +
                    'Евстратьев, Ефименко, Жиденко, Жовнер, Жученко, Забава, Задорожный, \n' +
                    'Запорожченко, Зиньченко, Иващенко, Калашник, Касьяненко, Кашпуренко, \n' +
                    'Клименко, Клищ, Кобзаренко, Кобченко, Ковшенко, Козменко, Колесник, \n' +
                    'Корниенко, Кравченко, Кутья, Лейбенко, Лесняк, Ливченко, Линниченко, \n' +
                    'Лисовын, Лиценко, Лобенко, Локощенко, Луценко, Ляшенко, Макаренко, Малюга, \n' +
                    'Малютенко, Марчинко, Мартиненко, Матюха, Мироненко, Моргун, Москаленко, \n' +
                    'Мудрой, Надион, Нетецкий, Николаенко, Огульчанский, Олейник, Орошко, \n' +
                    'Остапенко, Острой, Остроумко, Пальчик, Пиридерий, Подлесной, Полтораус, \n' +
                    'Початовский, Проценко, Ремаренко, Руденко, Рябокобыла, Савченко, Сальник, \n' +
                    'Сальниченко, Семиняк, Сендецкий, Сизонов, Скиба, Старосвитский, Суржко, \n' +
                    'Тиличенко, Ткаченко, Федоренко, Филь, Чеботченко, Чернега, Чернишенко, \n' +
                    'Чернойван, Чмовон, Чумаченко, Чухлатый, Шапошник, Швец, Шевела, Шивченко, \n' +
                    'Шостак, Щербаков, Яковенко, Ясенко'
            },
            {
                name: 'с. Замостье',
                data: []
            },
            {
                name: 'с. Западенское',
                data: []
            },
            {
                name: 'с. Зарожное',
                data: []
            },
            {
                name: 'д. Зеленая (Зеленищина)',
                data: []
            },
            {
                name: 'д. Зеленый Колодец',
                data: []
            },
            {
                name: 'с. Зидьки',
                data: []
            },
            {
                name: 'хут. Зиновьев (фамилии жителей хутора в 1858 г.)',
                data: 'Довженко, Лушпаненко, Тахтаулов, Чирвенко'
            },
            {
                name: 'с. Ивановка (Буцковка)',
                data: []
            },
            {
                name: 'д. Ивановка',
                data: []
            },
            {
                name: 'хут. Ивашковка',
                data: []
            },
            {
                name: 'с. Каменная Яруга',
                data: []
            },
            {
                name: 'д. Кирпичное',
                data: []
            },
            {
                name: 'с. Константиновка',
                data: []
            },
            {
                name: 'д. Копанская (Копанка)',
                data: []
            },
            {
                name: 'хут. Коробов',
                data: []
            },
            {
                name: 'с. Коробочкино',
                data: []
            },
            {
                name: 'д. Красивая',
                data: []
            },
            {
                name: 'д. Красная Поляна',
                data: []
            },
            {
                name: 'д. Лавровка (дворовые люди помещицы Помазановой и крестьяне, 1858 г.)',
                data: 'Горлов, Колесниченко, Лазаренков, Пантилеев, Пащенко, Сичкарь, \n' +
                    'Степаненко, Чайка, Швидченко, Шивченко'
            },
            {
                name: 'с. Лагери',
                data: []
            },
            {
                name: 'с. Лебяжье',
                data: []
            },
            {
                name: 'д. Левандаровка (Алексеевка)',
                data: []
            },
            {
                name: 'д. Левковка (список фамилий за 1858 г.)',
                data: 'Гудзь, Добромотенко, Ластович, Мироненко, Прокопенко, Рыжий, Шевченко'
            },
            {
                name: 'сл. Ленивка (список фамилий за 1858 г.)',
                data: 'Авчинников, Алехин, Алтухов, Алябьев, Андреев, Анохин, Апальков, \n' +
                    'Бабенков, Бабрышов, Басов, Безлепкин, Белобрагин, Беляев, Богданов, \n' +
                    'Болгов, Бондарев, Бородин, Букреев, Бысов, Волобоев, Волобуев, \n' +
                    'Воротников, Гафонов, Гладков, Головин, Голодников, Голозубов, Горбунов, \n' +
                    'Дементьев, Дементьев, Доброносов, Дурнев, Екимов, Ефимьев, Ждиморов, \n' +
                    'Жыдков, Золотов, Исаев, Кавынев, Казлитин, Каменев, Камышников, \n' +
                    'Канищев, Касьянов, Кирилов, Климов, Кобелев, Коринев, Кочетов, Кочкин, \n' +
                    'Крамской, Крестов, Кривенцов, Криволапов, Круглаликов, Крутов, Крюков, \n' +
                    'Кузякин, Кулешин, Кутепов, Лактионов, Лебедев, Лобов, Лукьянчиков, \n' +
                    'Макаев, Маслов, Мастюгин, Махрин, Мезенцов, Мелехов, Надеин, Негуторов, \n' +
                    'Пенезев, Перемотин, Пожидаев, Полозинцов, Попов, Распопов, Рогачеников, \n' +
                    'Рогожников, Рожков, Рябинин, Сальков, Самойлов, Севрюков, Селезнев, \n' +
                    'Сокольников, Сотников, Сотников, Стахевич, Стеблев, Тараненков, \n' +
                    'Трубчанинов, Уткин, Ушаков, Фарафонов, Цуриков, Черкашин, Черкинm, \n' +
                    'Черный, Честяков, Чмутов, Чунихин, Шаламов, Шамрай, Шепилов, Шомин, Щекин'
            },
            {
                name: 'сл. Лиман',
                data: []
            },
            {
                name: 'с-цо Липинское',
                data: []
            },
            {
                name: 'сл. Лозовенька',
                data: []
            },
            {
                name: 'хут. Локошковка',
                data: []
            },
            {
                name: 'хут. Льговка (Орель Нижняя). Некоторые фамилии жителей хутора в 1858 г.',
                data: 'Аленко, Андрущенко, Антоненко, Ахтырский, Байрачный, Бахтей, Бахтиенко, \n' +
                    'Безпалый, Беленский, Беликов, Белицкий, Белоцерковский, Богомацегора, \n' +
                    'Богушенко, Бондаренко, Буклиенко, Бурименко, Буриченко, Бурнос, Бутко, \n' +
                    'Валковой, Ветренко, Веринко, Винник, Винокур, Водка, Герус, Гаймора, Гагун, \n' +
                    'Герасименко, Гогаленко, Гончаренко, Горабец, Губарь, Гунька, Гутник, \n' +
                    'Замарченко, Зиденко, Зизя, Золотько, Зуб, Ищенко, Калениченко, Кинаш, \n' +
                    'Кипоть, Кириенко, Коваленко, Козиренко, Колесник, Коломиец, Колтун, Комар, \n' +
                    'Кононенко, Косинко, Корженко, Котляренко, Коробойник, Кошовой, Кравец, \n' +
                    'Кравченко, Крапоткин, Кулик, Кутин, Куценко, Лесной, Лесоконь, Ливченко, \n' +
                    'Лисничий, Лисняк, Лисокобылка, Лойко, Малеванный, Марченко, Мирон, Мироненко, \n' +
                    'Мирошник, Мирошниченко, Моргун, Моштан, Мушенко, Набоченко, Нагнибида, \n' +
                    'Надион, Наливайко, Науменко, Нахнюпенко, Никольченко, Нилещенко, Носачев, \n' +
                    'Олейник, Ольховский, Онацкий, Остренко, Орель, Панченко, Пархоменко, \n' +
                    'Патлатый, Петренко, Петрушенко, Пиштенко, Погорелой, Погребняк, Поляцковый, \n' +
                    'Помазан, Пономаренко, Початовский, Прилипка, Приходченко, Проскурня, \n' +
                    'Проценко, Прядка, Пучка, Радионенко, Радченко, Решитняк, Рудиченко, Рущенко, \n' +
                    'Рябиненко, Рябченко, Рябуха, Саенко, Сидоренко, Синченко, Сириченко, \n' +
                    'Ситченко, Скибенко, Скочко, Скрипниченко, Слиденко, Соколенко, Солодовник, \n' +
                    'Спиваченко, Стипаненко, Стишенко, Стороженко, Стриженко, Ступаченко, Сухарь, \n' +
                    'Сухинин, Сущенко, Таран, Тарасенко, Тертишник, Тимченко, Ткаченко, Тюхай, \n' +
                    'Усенко, Фидорченко, Филипский, Фищенко, Харченко, Хлевняченко, Цадка, Цибенко, \n' +
                    'Цибульник, Чалый, Червоный, Чернышенко, Чипиленко, Чубенко, Чуприненко, \n' +
                    'Шамрай, Шапченко, Шатенко, Швидкий, Шинкаренко, Шипилявый, Шиптуха, Шостак, \n' +
                    'Шторхало, Шулженко, Шулжинский, Щербаков, Щибитуненко, Щирбаненко, Яровый'
            },
            {
                name: 'д. Любовка (Любимовка)',
                data: []
            },
            {
                name: 'д. Максимовка (Гороховка)',
                data: []
            },
            {
                name: 'с. Малиново',
                data: []
            },
            {
                name: 'с-цо Мало-Ивановка',
                data: []
            },
            {
                name: 'д. Маргаритовка (дворовые люди помещика капитана Светухина, 1858 г.)',
                data: 'Белоусенко, Головацкий, Каша, Левченко, Овчаренко, Охрименко'
            },
            {
                name: 'д. Марьевка (Каразиновка)',
                data: []
            },
            {
                name: 'хут. Марьинский (фамилии жителей хутора в 1858 г.)',
                data: 'Близниченко, Борзаченко, Бурзаков, Омельченко,Чмутенко'
            },
            {
                name: 'д. Медишевка (Медичиевка)',
                data: []
            },
            {
                name: 'сл. Меловая (список фамилий за 1858 г.)',
                data: 'Аксенов, Албасов, Арепьев, Асанов, Афонасьев, Ашихманов, Бабин, \n' +
                    'Бабичева, Баев, Барышников, Басов, Батюнин, Башевская, Белевцов, \n' +
                    'Бинюков, Блудов, Борбин, Борщов, Бочаров, Брынцов, Бутырин, Виденеев, \n' +
                    'Воробцов, Воробьев, Вышняков, Глазунов, Гнездилов, Голодникова, Голтяев, \n' +
                    'Гончаров, Дементьев, Долженков, Дюкарев, Дюмин, Егорова, Елисеев, \n' +
                    'Емельянов, Еремин, Еськов, Ждамиров, Жеребкин, Жуков, Зайцова, Захаров, \n' +
                    'Звягин, Зеленин, Изотов, Ильинский, Истомина, Катыхин, Кашеверов, Клюев, \n' +
                    'Козьмина, Козявкина, Колинченко, Конорев, Корнеева, Костерной, Крамская, \n' +
                    'Красной, Криволапов, Кубышкин, Кузовлев, Ларионов, Лимарев, Логаденко, \n' +
                    'Лунев, Малахов, Малыхин, Масалитина, Масанов, Маслов, Мачихин, Мисинев, \n' +
                    'Митрофанов, Мотков, Непочатой, Никитин, Никольников, Ноздрачов, Норыков, \n' +
                    'Пахомов, Пашков, Переверзев, Письменной, Погорелов, Попов, Посашков, \n' +
                    'Пряхин, Пыхтин, Рагулин, Разиньков, Ребров, Рогачов, Рощупкин, Руцкой, \n' +
                    'Рыбас, Рябчиков, Рясенский, Селезнева, Семенихин, Серокуров, Синявин, \n' +
                    'Ситькова, Сколозубов, Cоловьева, Солопихин, Сотников, Стародубцов, \n' +
                    'Степанов, Тарасенко, Татьков, Уваров, Угримов, Умрихина, Федоров, \n' +
                    'Филипский, Халин, Ханьков, Хлебенский, Хмелевской, Цуриков, Чавыкин, \n' +
                    'Чебукина, Ченцов, Чепуренко, Черепова, Черная, Черкашин, Чернышова, \n' +
                    'Чурилов, Шаталов, Швецова, Шевелев, Шестириков, Щетинин, Шехавцов, \n' +
                    'Шипилов, Шляхов, Щетинин'
            },
            {
                name: 'хут. Миргородский (Сорока)',
                data: []
            },
            {
                name: 'д. Миролюбовка (Андреевка). Список фамилий за 1858 г.',
                data: 'Андреенко, Волошин, Головко, Голопуз, Демченко, Кравченко, Леонтьев, \n' +
                    'Ливенко, Немировский, Рудь, Сидоренко, Сыровой, Филиппенко'
            },
            {
                name: 'сл. Михайловская (список фамилий за 1858 г.)',
                data: 'Абакумов, Абалмасов, Аксенов, Антипов, Арестархов, Баев, Бажинов, \n' +
                    'Барабанов, Безъязычный, Беленьков, Беликов, Белолипский, Бобров, Боков, \n' +
                    'Бредихин, Булгаков, Бугайченко, Быков, Волокитин, Гагин, Голодников, \n' +
                    'Данилов, Деев, Денисов, Дивин, Дмитриев, Долженков, Дорофеев, Дрокин, \n' +
                    'Емельянов, Еськов, Жарновников, Завырский, Золотарев, Золотухин, Ильинский, \n' +
                    'Ильичов, Калинин, Картавцов, Касьянов, Катунин, Кирьянов, Козьминов, \n' +
                    'Комаревцов, Комов, Красной, Кривцов, Кузнецов, Кузякин, Куклин, Лосев, \n' +
                    'Малахов, Марковников, Матвеев, Меркулов, Мясников, Нагибин, Невзоров, \n' +
                    'Непочатой, Негуляев, Новиков, Ноздрачов, Носов, Орлов, Панов, Переверзев, \n' +
                    'Песцов, Петряев, Плехов, Попов, Прокопов, Пыхтин, Резанов, Рыбин, Севидов, \n' +
                    'Секерин, Серебряков, Соколов, Сокольцов, Сторожев, Теряев, Толмачов, \n' +
                    'Третьяков, Ушаков, Фильков, Фомин, Халин, Хлебенский, Хомутов, Храпунов, \n' +
                    'Хрептов, Чальцов, Черкасов, Черкашин, Черняев, Чечин, Чурилов, Шаповалов, \n' +
                    'Шатохин, Шахов, Шевляков, Шеховцов, Шкуратов, Шоков, Шопин'
            },
            {
                name: 'с-цо Михайловское (при р. Крайней Балаклейке)',
                data: []
            },
            {
                name: 'д. Моспановка',
                data: []
            },
            {
                name: 'с. Моспаново',
                data: []
            },
            {
                name: 'д. Мостовая (Гашиновка)',
                data: []
            },
            {
                name: 'с. Мотузовка',
                data: []
            },
            {
                name: 'с. Мохначево',
                data: []
            },
            {
                name: 'д. Надеждовка (дворовые люди помещика Парадовского, 1858 г.)',
                data: 'Балашов, Потапов, Спица, Таран, Шепаренко'
            },
            {
                name: 'с. Нижнерусский Бишкин (список фамилий за 1858 г.)',
                data: 'Авсянников, Асеев, Баздырев, Балакарев, Бизбородов, Бикетов, \n' +
                    'Биляев, Блудов, Бородавкин, Волобуев, Гагин, Галицкий, Гальцов, \n' +
                    'Гальцов, Демьянов, Долгов, Еськов, Жеребкин, Заможский, Затолокин, \n' +
                    'Звегинцев, Звеков, Золотухин, Казявкин, Калинин, Карастилев, \n' +
                    'Караченцов, Картамышев, Киселев, Клюев, Кобызев, Колобов, Колыванов, \n' +
                    'Кондратов, Константинов, Куринев, Лабынцов, Лукьянов, Малахов, \n' +
                    'Малыхин, Малышев, Маргунов, Мельников, Мяхонов, Невзоров, Невступов, \n' +
                    'Непочатой, Никулин, Овсяников, Панов, Парфенов, Парфенов, Плотников, \n' +
                    'Подкользин, Полянский, Попов, Прудников, Рогов, Рыбин, Рычков, \n' +
                    'Решетников, Салогубов, Солодовников, Самусин, Сасин, Себелев (Сибилев), \n' +
                    'Селезнев, Скляров, Строев, Сурков, Тарасов, Татаринцов, Тутов, Уколов, \n' +
                    'Умрихин, Фарафонов, Фомков, Хардиков, Ходосов, Хорошенков, Хорошенькой, \n' +
                    'Чавыкин, Черкашин, Чернышов, Шабанов, Шатохин, Шевченко, Шенцов, Шехавцов, \n' +
                    'Широкин (Широчкин), Янков'
            },
            {
                name: 'д. Николаевка (Башкировка, при р. Орели)',
                data: []
            },
            {
                name: 'д. Николаевка (при р. Береке). Список фамилий за 1858 г.',
                data: 'Волков, Грузин, Добриков, Дученко, Зарывайка, Кибенко, Ковалев, Козюлин, \n' +
                    'Коноваленко, Плахотников, Попудровка, Рыбалка, Сарай, Солонин, Таранов, \n' +
                    'Удовиченко, Филатов, Шаповалов, Шахов'
            },
            {
                name: 'д. Николаевский (Щидокировка)',
                data: []
            },
            {
                name: 'хут. Николенков',
                data: []
            },
            {
                name: 'д. Никольская',
                data: []
            },
            {
                name: 'д. Ново-Александровка',
                data: []
            },
            {
                name: 'с. Ново-Борисоглебск',
                data: []
            },
            {
                name: 'д. Новогригорьевка (дворовые люди Селиховых и крестьяне, 1858 г.)',
                data: 'Голуб, Егоров, Куракин, Куроедов, Минаев, Назаренко, Павленко, Пожуев, \n' +
                    'Присталенко, Солоненко, Хориенко, Шаповаленко'
            },
            {
                name: 'д. Новоданиловка (Порхаевка)',
                data: []
            },
            {
                name: 'д. Ново-Ивановка (список фамилий за 1858 г.)',
                data: 'Беззубенко, Борисов, Бутко, Гайдук, Галич, Гончаренко, Горкавенко, \n' +
                    'Долженко, Дорошенко, Кайданник, Клунник, Козаченко, Корзюков, Красулин, \n' +
                    'Крыпак, Лапшин, Лобан, Никитин, Пшеничка, Рудниченко, Симонов, Скотаренко, \n' +
                    'Чеботарев, Чернов, Чертов, Якухненков'
            },
            {
                name: 'д. Ново-Марьинская (Петропавловская)',
                data: []
            },
            {
                name: 'д. Ново-Марьинская (Марьинская)',
                data: []
            },
            {
                name: 'д. Ново-Марьинское (Ново-Петровка, Марьевка)',
                data: []
            },
            {
                name: 'с. Ново-Николаевка (Таганка, при р. Северском Донце и Таганке)',
                data: []
            },
            {
                name: 'д. Ново-Николаевка (при р. Береке)',
                data: []
            },
            {
                name: 'с. Ново-Покровское',
                data: []
            },
            {
                name: 'д. Новоселовка (Александровка, при р. Орели)',
                data: []
            },
            {
                name: 'д. Новоселовка (при р. Попельной)',
                data: []
            },
            {
                name: 'д. Новоселовка (между р. Орелкой и Берекой)',
                data: []
            },
            {
                name: 'д. Новоселовка (при р. Береке)',
                data: []
            },
            {
                name: 'с. Ново-Серпухов (Балаклея)',
                data: []
            },
            {
                name: 'д. Ольшанка (Архиереевка)',
                data: []
            },
            {
                name: 'с. Орель Верхняя (список фамилий за 1858 г.)',
                data: 'Андрущенко, Атромин, Бабаевский, Бабенко, Батраченко, Бережный, \n' +
                    'Бовдир, Бойченко, Бондаренко, Войтенко, Голубенко, Гордеенко, Гоц, \n' +
                    'Гулаженко, Давискиба, Дехтяр, Довженко, Дробьязка, Дубенко, Дубина, \n' +
                    'Дуденко, Ефименко, Журавель, Золотарь, Кадук, Кибалка, Киченко, \n' +
                    'Колодяжный, Коломиец, Колтун, Костенко, Котенко, Куколь, Ларионов, \n' +
                    'Липин, Лисенко, Лисовин, Лихобаба, Марчинко, Метех, Миронов, Многолитний, \n' +
                    'Мотяшов, Мудрий, Мураховский, Набока, Надион, Нарыжный, Науменко, \n' +
                    'Никитин, Ольшанский, Осипенко, Павленко, Пиштенко, Романенко, Рябокобыла, \n' +
                    'Синолиций, Скибенко, След, Старосвицкий, Стукало, Супрун, Таганбей, \n' +
                    'Телега, Троян, Туганбей, Тютка, Федоренко, Харченко, Чугуенко, Шаповал, \n' +
                    'Шевченко, Шепеля, Шестенко'
            },
            {
                name: 'д. Орловка',
                data: []
            },
            {
                name: 'хут. Осиновка (Мариенталь)',
                data: []
            },
            {
                name: 'с. Отрада (Отрадное)',
                data: []
            },
            {
                name: 'сл. Охочая (список фамилий за 1858 г.)',
                data: 'Абеленцов, Авдеев, Аверин, Авилов, Авчинников, Азаренков, \n' +
                    'Александров, Бабаев, Бабин, Баев, Басов, Батищев, Безпалов, \n' +
                    'Белевцов, Беленьков, Белицкий, Белов, Биседин, Бледной, Блудов, \n' +
                    'Бородин, Брехов, Булгаков, Важов, Веревкин, Волобоев, Воронин, \n' +
                    'Воронцов, Головин, Голодников, Горбунов, Горлов, Грядунов, Грязев, \n' +
                    'Гулевский, Давыдов, Дашков, Демин, Драняев, Дураков, Дурнев, \n' +
                    'Дюкарев, Ермилов, Жердев, Жмакин, Журенко, Зеновьев, Зубков, Зыков, \n' +
                    'Иванов, Ильин, Исаев, Кабылев, Казлицкий, Картавцов, Катунин, \n' +
                    'Клуглоликов, Кобызев, Колодяжной, Конев, Коренев, Крамарев, \n' +
                    'Крамской, Кузнецов, Кузятинов, Кухтин, Лазарев, Лактин, Лактионов, \n' +
                    'Ларионов, Ларюков, Логачев, Лунев, Лысенков, Мастюгин, Минин, \n' +
                    'Михайлов, Музилевский, Наземцов, Некрасов, Нефедов, Никитин, \n' +
                    'Ноздрачов, Орлов, Панов, Пенезев, Подколзин, Подшивайлов, \n' +
                    'Позняков, Попов, Потолов, Пчелинцов, Роговенко, Росляков, Руднев, \n' +
                    'Русанов, Рыжов, Рыльцов, Рябинин, Садовников, Самойлов, Селезнев, \n' +
                    'Селиверстов, Семенихин, Середин, Сокольников, Стародубцов, \n' +
                    'Суботников, Сухоруков, Тарасенко, Тиняков, Третьяков, Ушаков, \n' +
                    'Фарафонов, Федорищев, Федоров, Федюхин, Филатов, Фомичов, \n' +
                    'Харашилов, Цуриков, Черкасов, Черкашин, Чернный, Чужиков, Чумаков, \n' +
                    'Шалимов, Шаталов, Шатохин, Шлямов, Шульгин, Щербинин, Якшин'
            },
            {
                name: 'д. Павловка (Замятина)',
                data: []
            },
            {
                name: 'с. Пасеки',
                data: []
            },
            {
                name: 'с. Пески',
                data: []
            },
            {
                name: 'с-цо Петровское',
                data: []
            },
            {
                name: 'д. Петрополье',
                data: []
            },
            {
                name: 'хут. Плисовая',
                data: []
            },
            {
                name: 'с. Преображенское (Кибиначье). Список фамилий за 1858 г.',
                data: 'Андрющенко, Антоненко, Бабаевский, Бакай, Барабаш, Беличенко, Белицкий, \n' +
                    'Белобровченко, Белоцерковский, Бережный, Биленкский, Бирка, Бондаренко, \n' +
                    'Бурлаченко, Бутко, Валковый, Варяница, Ветренко, Вовченко, Волошин, \n' +
                    'Выннык, Гайдамака, Гайденко, Ганзий, Гирман, Герасименко, Головко, \n' +
                    'Головченко, Гонтаренко, Гончарев, Гром, Груненко, Гунькин, Гура, Дейко, \n' +
                    'Демяниченко, Денисенко, Дехтяр, Дрищ, Еременко, Журавлев, Кабатченко, \n' +
                    'Кабашный, Кадук, Калантаенко, Караваищенко, Карнаушенко, Карпенко, Кашпур, \n' +
                    'Кипоть, Кобченко, Козюменский, Колибенко, Колодченко, Коломиец, Корецкий, \n' +
                    'Корниенко, Корольков, Короткий, Кошовый, Краевый, Курган(?), Курьшый, \n' +
                    'Лещенко, Лисняк, Литвин, Ляшенко, Макаренко, Малиновский, Миргород, \n' +
                    'Мироненко, Миронов, Мирошниченко, Молчанов, Моргун, Мороз, Московченко, \n' +
                    'Надион, Николаенко, Обиденко, Огульчанский, Олейник, Пальчик, Пелипенко, \n' +
                    'Пелисученко, Петрухнов, Поляков, Помазан, Портненко, Прасоленко, Радов, \n' +
                    'Решитняк, Ризниченко, Рогач, Рубащенко, Садовский, Саенко, Сальник, Свид, \n' +
                    'Семенко, Семихат, Сендецкий, Серка, Сивоконь, Скибенко, Слащов, Солодовник, \n' +
                    'Стукало, Сулима, Тилега, Ткаченко, Третьяк, Усенко, Федорченко, Фисенко, \n' +
                    'Хрустенко, Цихмистро, Черныш, Чуприна, Шаповал, Шатура, Шеремет, Шивченко'
            },
            {
                name: 'с. Пришиб (Васильевка)',
                data: []
            },
            {
                name: 'с-цо Пришиб (Ивановка)',
                data: []
            },
            {
                name: 'хут. Пушкарный (дворовые люди помещика Стремоухова и крестьяне, 1858 г.)',
                data: 'Бебешко, Бурейко, Вакуленко, Васильев, Веревочка, Ганненко, Гащенко, \n' +
                    'Гончаров, Жежериха, Жук, Клищенко, Козачок, Коленко, Коновал, Костяной, \n' +
                    'Кушняр, Литвин, Никитин, Николаевка, Овчинов, Пиренский, Прядка, Половинченко, \n' +
                    'Приходько, Расколодько, Рогозянский, Рыков, Саленко, Сердешный, Слезнев, \n' +
                    'Соболь, Ставич, Ткач, Тонкошкур, Харченко, Харьковский, Черныш, Чижик, \n' +
                    'Шабельник, Шепляк'
            },
            {
                name: 'хут. Раздолье (Раздольное, Солонцы)',
                data: []
            },
            {
                name: 'хут. Райская (Лошкаревка, Равское)',
                data: []
            },
            {
                name: 'д. Ракитная',
                data: []
            },
            {
                name: 'хут. Репьяховка',
                data: []
            },
            {
                name: 'хут. Ржавец',
                data: []
            },
            {
                name: 'д. Родомысль (Гаровка)',
                data: []
            },
            {
                name: 'д. Ртыщевка (Васильевка)',
                data: []
            },
            {
                name: 'д. Сиваш (Лихачевка)',
                data: []
            },
            {
                name: 'с. Скрыпаево',
                data: []
            },
            {
                name: 'д. Смирный (Клугиновка и Гурьевка)',
                data: []
            },
            {
                name: 'с. Соколово',
                data: []
            },
            {
                name: 'с. Сороковка',
                data: []
            },
            {

                name: 'д. Софиевка (Ковалевка)',
                data: []
            },
            {
                name: 'с. Старо-Покровское',
                data: []
            },
            {
                name: 'д. Степановка (Зеленщина)',
                data: []
            },
            {
                name: 'сл. Тарановка',
                data: []
            },
            {
                name: 'хут. Терновка (Терпы, Чегриновка)',
                data: []
            },
            {
                name: 'с. Терновое',
                data: []
            },
            {
                name: 'с. Тетлега',
                data: []
            },
            {
                name: 'хут. Тимченков (Сарапулин)',
                data: []
            },
            {
                name: 'д. Федоровка',
                data: []
            },
            {
                name: 'д. Хлоповка (Николаевка)',
                data: []
            },
            {
                name: 'с. Чемужовка',
                data: []
            },
            {
                name: 'с. Черемушное',
                data: []
            },
            {
                name: 'хут. Черкасский Бишкин',
                data: []
            },
            {
                name: 'с. Чернокаменка (Тимченково, Попельная)',
                data: []
            },
            {
                name: 'сл. Шебелинка (список фамилий за 1858 г.)',
                data: 'Авчинников, Агарков, Адоевцов, Аксенов, Албасов, Алисов, Асеев, \n' +
                    'Астанков, Афанасьев, Багринцов, Бакита, Бакланов, Барышников, Батищев, \n' +
                    'Безпалов, Беленьков, Бинюков, Блудова, Бобров, Борзенков, Бородин, \n' +
                    'Бугайченкова, Буловин, Бушнев, Васищев, Вытоптов, Вышняков, Гагин, \n' +
                    'Герасимов, Голдаев, Головин, Голодников, Гололобов, Голтяев, Горбатовский, \n' +
                    'Горбунов, Горяинов, Готовицкий, Гречин, Гритчин, Гулевский, Гуров, Демин, \n' +
                    'Дехтярев, Дмитров, Долженков, Дорохов, Дрокин, Дурихин, Дюдин, Дюкарев, \n' +
                    'Евдокимов, Евсюков, Енютин, Ерин, Ерохин, Ершов, Ерыгин, Еськов, Затолокин, \n' +
                    'Захарьев, Звягинцев, Зиновкин, Золотарев, Зубов, Зубарев, Изотов, \n' +
                    'Иноземцов, Кавыршин, Каминев, Кандыба, Капустина, Каратеев, Караченцов, \n' +
                    'Кизилов, Кирьянов, Колков, Кононов, Коровин, Костерной, Костин, Крамской, \n' +
                    'Красной, Кретов, Кузнецов, Лактионов, Лебедев, Легеза, Лежибоков, Лещин, \n' +
                    'Ложников, Лукьянов, Лютый, Малыхин, Мартынов, Мелихов, Меркулов, Миндарь, \n' +
                    'Мисинев, Михайлов, Мишин, Морозов, Мохнаткин, Муравлев, Мухин, Нагибин, \n' +
                    'Найденов, Нарыков, Немцов, Непочатой, Нефедов, Никитин, Ноземцов, Павлов, \n' +
                    'Пашнев, Пеньков, Переверзев, Петряева, Подколодной, Полянский, Попов, \n' +
                    'Пуляев, Разиньков, Рогачов, Рощупкин, Рудаков, Руднев, Севидов, Селезнев, \n' +
                    'Сергеев, Сигов, Синявин, Скорняков, Сляднев, Сширов, Сокольцов, Сопин, \n' +
                    'Сотников, Спесивцов, Сторожев, Суханов, Сухочева, Тарасов, Тетерин, Титов, \n' +
                    'Токарев, Топорин, Трофимов, Уваров, Фомин, Халин, Харьков, Хмелев, \n' +
                    'Хмелевской, Худяков, Цурикова, Чаплыгин, Чебукин, Ченцов, Черепов, Черкашин, \n' +
                    'Чернышов, Черной, Шахов, Швецов, Шевелев, Шехавцов, Ширабоков, Шоков, \n' +
                    'Шопин, Шумигин, Щетинин, Явтушенко, Яковлев, Якунин'
            },
            {
                name: 'с. Шелудковка',
                data: []
            },
            {
                name: 'с. Яковенково',
                data: []
            }]},
            {
                name: "Изюмский уезд",
                data: []
            },
            {
                name: "Купянский уезд",
                data: []
            },
            {
                name: "Лебединский уезд",
                data: []
            },
            {
                name: "Старобельский уезд",
                data: [
                    {
                        name: 'хут. Авенировка',
                        data: []
                    },
                    {
                        name: 'сл. Александровка',
                        data: []
            },
            {
                name: 'с. Александровское (Скарговка)',
                data: []
            },
            {
                name: 'хут. Александрополь (Линовка, Майстровка)',
                data: []
            },
            {
                name: 'сл. Алексеевка (при р. Белой)',
                data: []
            },
            {
                name: 'сл. Алексеевка (Разбегайловка, при р. Евсуге)',
                data: []
            },
            {
                name: 'с-цо Алексополь (Лозная)',
                data: []
            },
            {
                name: 'с-цо Анисимово (Масловка)',
                data: []
            },
            {
                name: 'д. Анновка (Сухановка)',
                data: []
            },
            {
                name: 'хут. Анцифоров (Ивановский, Степная слобода)',
                data: []
            },
            {
                name: 'д. Африка (Самойленков, Самойловка)',
                data: []
            },
            {
                name: 'хут. Байдовка',
                data: []
            },
            {
                name: 'д. Балакарев',
                data: []
            },
            {
                name: 'сл. Бараниковка',
                data: []
            },
            {
                name: 'сл. Бахмутовка',
                data: []
            },
            {
                name: 'хут. Бедин',
                data: []
            },
            {
                name: 'хут. Безбожный',
                data: []
            },
            {
                name: 'сл. Безгиновка',
                data: []
            },
            {
                name: 'сл. Беловодск',
                data: []
            },
            {
                name: 'сл. Белокуракина',
                data: []
            },
            {
                name: 'слоб. Белолуцкая',
                data: []
            },
            {
                name: 'слоб. Белый Колодезь',
                data: []
            },
            {
                name: 'сл. Беляевка (Архангельская Беляевка)',
                data: []
            },
            {
                name: 'хут. Беседовка',
                data: []
            },
            {
                name: 'хут. Битраковка',
                data: []
            },
            {
                name: 'слоб. Бобровая (Боровая)',
                data: []
            },
            {
                name: 'сл. Богдановка (Нижния Сотни)',
                data: []
            },
            {
                name: 'с-цо Богородицкое (Раевка)',
                data: []
            },
            {
                name: 'хут. Бондаревка',
                data: []
            },
            {
                name: 'сл. Боровенька',
                data: []
            },
            {
                name: 'сл. Боровская',
                data: []
            },
            {
                name: 'хут. Босый',
                data: []
            },
            {
                name: 'с-цо Боярское (Колокольцовка)',
                data: []
            },
            {
                name: 'сл. Брусовка',
                data: []
            },
            {
                name: 'сл. Булавиновка',
                data: []
            },
            {
                name: 'д. Булгаковка (Старый Анцефоров, Шабельскаго)',
                data: []
            },
            {
                name: 'слоб. Булгаковка 1-я и 2-я',
                data: []
            },
            {
                name: 'хут. Бунчужный',
                data: []
            },
            {
                name: 'сл. Варваровка',
                data: []
            },
            {
                name: 'хут. Васильевка',
                data: []
            },
            {
                name: 'сл. Великоцкая',
                data: []
            },
            {
                name: 'сл. Веселая',
                data: []
            },
            {
                name: 'с. Воеводовка',
                data: []
            },
            {
                name: 'сл. Волкодавова (Журавка)',
                data: []
            },
            {
                name: 'хут. Воронов (Хохлов)',
                data: []
            },
            {
                name: 'хут. Высочинов (Каськовка, Богодарово)',
                data: []
            },
            {
                name: 'сл. Выстряковка',
                data: []
            },
            {
                name: 'хут. Высший',
                data: []
            },
            {
                name: 'хут. Гайдуков',
                data: []
            },
            {
                name: 'хут. Ганусов',
                data: []
            },
            {
                name: 'хут. Гармашев',
                data: []
            },
            {
                name: 'сл. Генераловка',
                data: []
            },
            {
                name: 'хут. Гераськов',
                data: []
            },
            {
                name: 'хут. Гладкий (Шилов)',
                data: []
            },
            {
                name: 'хут. Гнидин',
                data: []
            },
            {
                name: 'хут. Головков Большой',
                data: []
            },
            {
                name: 'хут. Голодаев',
                data: []
            },
            {
                name: 'сл. Голубовка',
                data: []
            },
            {
                name: 'хут. Гончаров',
                data: []
            },
            {
                name: 'хут. Гордеевка',
                data: []
            },
            {
                name: 'сл. Городище',
                data: []
            },
            {
                name: 'хут. Гречишник',
                data: []
            },
            {
                name: 'хут. Грицаев',
                data: []
            },
            {
                name: 'сл. Даниловка',
                data: []
            },
            {
                name: 'сл. Демьяновка',
                data: []
            },
            {
                name: 'сл. Денежников',
                data: []
            },
            {
                name: 'с. Деркульский Государственный конный завод',
                data: []
            },
            {
                name: 'сл. Донцовка',
                data: []
            },
            {
                name: 'хут. Дубововка',
                data: []
            },
            {
                name: 'сл. Евдиловка',
                data: []
            },
            {
                name: 'сл. Евсуг (список фамилий за 1795 г.)',
                data: 'Бабенко, Безкоровайный, Белохатка, Бобер, Богомол, Бондарь, \n' +
                    'Головчанский, Гончар, Гузь, Дубной, Журба, Клещ, Коваль, Калмык, \n' +
                    'Колпак, Коцура, Крилеватый, Кулик, Лавошник, Литвин, Лях, Мацай, \n' +
                    'Москвич, Опучка, Перешивайло, Протопопенко, Пустовар, Пушкарский,\n' +
                    'Репа, Решетняк, Рубленко, Рынковый, Рябой, Цибуля, Чайченко, Шийка, \n' +
                    'Шолуха, Яценко'
            },
            {
                name: 'д. Елизаветовка',
                data: []
            },
            {
                name: 'сл. Епифановка',
                data: []
            },
            {
                name: 'хут. Еремин',
                data: []
            },
            {
                name: 'хут. Заводянский',
                data: []
            },
            {
                name: 'хут. Заикин',
                data: []
            },
            {
                name: 'слоб. Закаменка',
                data: []
            },
            {
                name: 'слоб. Закотная',
                data: []
            },
            {
                name: 'хут. Заярчановка',
                data: []
            },
            {
                name: 'хут. Зеликов',
                data: []
            },
            {
                name: 'сл. Зориковка',
                data: []
            },
            {
                name: 'сл. Ивановка',
                data: []
            },
            {
                name: 'сл. Кабычево (Покровское)',
                data: []
            },
            {
                name: 'хут. Калинова Балка',
                data: []
            },
            {
                name: 'с. Калмыково',
                data: []
            },
            {
                name: 'сл. Каменное',
                data: []
            },
            {
                name: 'д. Капитанова',
                data: []
            },
            {
                name: 'хут. Кисилев',
                data: []
            },
            {
                name: 'хут. Киянов (Оканев)',
                data: []
            },
            {
                name: 'с. Климово',
                data: []
            },
            {
                name: 'хут. Княжев',
                data: []
            },
            {
                name: 'хут. Ковалинка',
                data: []
            },
            {
                name: 'хут. Колпаков',
                data: []
            },
            {
                name: 'слоб. Колядовка',
                data: []
            },
            {
                name: 'сл. Кононовка',
                data: []
            },
            {
                name: 'хут. Коноплянка',
                data: []
            },
            {
                name: 'д. Константиновка (Логвиновка)',
                data: []
            },
            {
                name: 'с. Кочино (Городский)',
                data: []
            },
            {
                name: 'сл. Красная (Тихонова)',
                data: []
            },
            {
                name: 'хут. Кризский (Крепаевка)',
                data: []
            },
            {
                name: 'д. Круглая 1-я и 2-я',
                data: []
            },
            {
                name: 'сл. Кряковка',
                data: []
            },
            {
                name: 'сл. Кудряшовка',
                data: []
            },
            {
                name: 'хут. Курячевка (список фамилий за 1835 г.)',
                data: 'Августов, Астапцов, Безбожный, Бурда, Бурдин, Гребенник, Кириченко, \n' +
                    'Коваль, Кравцов, Мойсеенко, Остапенко, Скляров'
            },
            {
                name: 'хут. Лавров',
                data: []
            },
            {
                name: 'хут. Лапаск',
                data: []
            },
            {
                name: 'сл. Лашиновка (Средния Сотни). Список фамилий за 1835 г.',
                data: 'Алексеев, Архипов, Баев, Белоусов, Брежнев, Гусев, Гульский, Дмитриев, \n' +
                    'Есин, Захаров, Иванов, Клюев, Карлов, Костоваров, Козьмин, Лапухин, Минин, \n' +
                    'Нечаев, Перцов, Радионов, Степанищев, Фостов, Целій, Чернухин, Чурсин, \n' +
                    'Черный, Юрьев, Ясунин'
            },
            {
                name: 'хут. Лизин (Шандровка). Список фамилий за 1835 г.',
                data: 'Биденко, Верченко, Гонтаренко, Гринченко, Дорошенко, Екименко, Журавленко, \n' +
                    'Журбенко, Зубченко, Кобзарь, Колесниченко, Кошеленко, Кравцов, Лавренко, \n' +
                    'Лапта, Лаптенко,Лизенко, Лызенко, Марченко, Мирошниченко, Молчан, Никитенко, \n' +
                    'Овчаренко, Огеенко, Резниченко,  Руденко, Скляренко, Собина, Тараненко, \n' +
                    'Тарасенко, Тесленко, Ткаченко, Товстолуженко,  Хмеленко, Цыганенко, Шут, Шутенко'
            },
            {
                name: 'сл. Лиман',
                data: []
            },
            {
                name: 'с. Лимарево (Лимаревское Гос. Конное Депо)',
                data: []
            },
            {
                name: 'сл. Липовка',
                data: []
            },
            {
                name: 'сл. Литвиновка',
                data: []
            },
            {
                name: 'хут. Лобачев',
                data: []
            },
            {
                name: 'хут. Лозной (Марьино, Буряков)',
                data: []
            },
            {
                name: 'хут. Лубянка',
                data: []
            },
            {
                name: 'хут. Лысенков (Слободка)',
                data: []
            },
            {
                name: 'хут. Лямаровка',
                data: []
            },
            {
                name: 'с. Макортетино',
                data: []
            },
            {
                name: 'д. Малая Венделевка 1-я и 2-я (Генераловка, Венделевка)',
                data: []
            },
            {
                name: 'д. Мариновка (Воробьевка)',
                data: []
            },
            {
                name: 'сл. Марковка',
                data: []
            },
            {
                name: 'с-цо Марьино (Алексополь)',
                data: []
            },
            {
                name: 'хут. Михайликов (Великороссийские Пахринцы)',
                data: []
            },
            {
                name: 'хут. Михайликов (Малороссийский Суходол)',
                data: []
            },
            {
                name: 'с. Михайловка',
                data: []
            },
            {
                name: 'д. Михайло-Полюс (Письменка, Михайловка)',
                data: []
            },
            {
                name: 'хут. Можняково',
                data: []
            },
            {
                name: 'хут. Моисеенков',
                data: []
            },
            {
                name: 'хут. Морозов (Козловка)',
                data: []
            },
            {
                name: 'сл. Морозовка',
                data: []
            },
            {
                name: 'сл. Мостки',
                data: []
            },
            {
                name: 'сл. Муратова',
                data: []
            },
            {
                name: 'с-цо Мыс Доброй Надежды (Лозное)',
                data: []
            },
            {
                name: 'д. Мыс Доброй Надежды (Пугачевка)',
                data: []
            },
            {
                name: 'хут. Нехаев',
                data: []
            },
            {
                name: 'сл. Нещеретова',
                data: []
            },
            {
                name: 'сл. Нижнебаранниковка (Злодеевка)',
                data: []
            },
            {
                name: 'сл. Нижнепокровка',
                data: []
            },
            {
                name: 'хут. Николаев (Безбожной)',
                data: []
            },
            {
                name: 'с-цо Николаевское',
                data: []
            },
            {
                name: 'слоб. Новая',
                data: []
            },
            {
                name: 'с. Ново-Александровка (Левенцово)',
                data: []
            },
            {
                name: 'с. Новоалександровский Государственный конный завод',
                data: []
            },
            {
                name: 'слоб. Ново-Астрахань (Троицкое)',
                data: []
            },
            {
                name: 'сл. Ново-Ахтырская',
                data: []
            },
            {
                name: 'сл. Новобелинькая',
                data: []
            },
            {
                name: 'сл. Ново-Боровая',
                data: []
            },
            {
                name: 'д. Ново-Воскресенская (Кривцовка, Терцовая)',
                data: []
            },
            {
                name: 'д. Ново-Николаевка (Раевка)',
                data: []
            },
            {
                name: 'сл. Ново-Псков (Закаменка)',
                data: []
            },
            {
                name: 'сл. Ново-Россошь (Плотина)',
                data: []
            },
            {
                name: 'сл. Новый Айдар',
                data: []
            },
            {
                name: 'хут. Овчаров (Евтухов)',
                data: []
            },
            {
                name: 'хут. Ольшанский',
                data: []
            },
            {
                name: 'слоб. Осинова (список фамилий за 1816 г.)',
                data: 'Алиферов, Андрущенко, Арепьев, Бабкин, Бабков, Бавыкин, Багненко, \n' +
                    'Багнов, Базалеев, Бакаев, Бакачев, Балянской, Балясной, Басков, Баштовой, \n' +
                    'Бедреев, Белецкий, Беликов, Белоусов, Белянский, Бестрицкий, Бондарев, \n' +
                    'Брюховецкий/Брюховецкой, Бурденко, Бурьянов, Бутков, Бутов, Бухов, Быряков, \n' +
                    'Вагин, Василенко, Васильченко он же Искипенко, Веденко, Вертоловский, \n' +
                    'Верховодов, Веснянцов/Весненцов, Видиш, Видишев, Витковский, Воронин, \n' +
                    'Воропаев, Галушка, Ганзюков, Гапоченко, Гнилобоков, Гнутой, Головашев, \n' +
                    'Гончарев/Гончаров, Горбенко, Грецунов, Гречка, Гречкин, Грицунов, \n' +
                    'Гужвинский, Гузиев, Девицкий/Девицкой, Дзвоников, Добриднев, Добродеев, \n' +
                    'Доканев, Донников, Донцов, Дорофеев, Дохневский, Дубовик/Дубовык, \n' +
                    'Дудниченко, Евсеев, Еманов, Есаков, Жиляев, Жуков, Журавлев, Зайцов, \n' +
                    'Зарудний, Захаржевский, Зеленский, Зинченко, Золотарев, Иванов, Изюмский, \n' +
                    'Ильин, Ильченко он же Маркой, Ищенков, Каплаушенко, Каруненко, Каськов, \n' +
                    'Кириченко, Кисилев, Клиженко, Кобеляцкий, Кобылев, Ковалев, Ковтуненко, \n' +
                    'Ковшов, Козаренко, Козачков, Колено, Колесников, Колесниченко, Колодкин, \n' +
                    'Кольцов, Коновал, Коновалов, Конотопов, Копилов, Коробенко, Корсунов, \n' +
                    'Косолап, Костенко, Костенков, Котов, Красноносов, Крежанский, Кривобоков, \n' +
                    'Кропивцов, Крупин, Кузницов, Куликов, Куценко, Кучерев, Кыйченко (Книченко), \n' +
                    'Лавренцов, Лавренченко, Лиманский, Линников, Лисенко, Лисинко, Литвинов, \n' +
                    'Лихацкий, Логвиненко, Лозовой, Лопатка, Луганский , Любицкий, Мазднин, \n' +
                    'Мазнев, Мамченко, Манчаренко, Матвиенко, Мельников, Миронов, Мирошников, \n' +
                    'Могильников, Молочков, Мордовцов, Недовесов, Недогонов, Несмеянов, Нечитайло, \n' +
                    'Ничаев, Норцов, Носов, Ображцов, Образков, Овдеев, Одарченко, Одинец, Одинцов, \n' +
                    'Ольтухов, Омельченко, Онищенко, Островерхов, Пажитников, Патрушев, Переясловцов, \n' +
                    'Петрашев, Петрушев, Плотников, Погорелченко, Подлесной, Полтавский, Пономарев, \n' +
                    'Потапенко, Похидняков, Похлебетин, Почтарев, Природа, Прокопенко, Пронченко, \n' +
                    'Протасенко, Проценко, Путилин, Пшеничной, Радков/Радьков, Рожков, Розинкин, \n' +
                    'Розмазнин, Романченко, Рощина, Руденко, Свестунов, Свиридов, Семаков, Сенча, \n' +
                    'Сенчин/Сеньчин, Сергиенко, Синчин, Ситник, Скитин, Сковородка, Сковородкин, \n' +
                    'Скориков, Скребцов, Скринников, Слабоспицкий, Слепцов, Слюсарев, Соловьев, \n' +
                    'Солодкий, Сопянов, Старцов, Стегинцов, Степенко, Столатной, Стрельцов, \n' +
                    'Стрижевский, Ступаков, Сухорадин, Сыдоконев, Сытник, Табалин, Таранов, \n' +
                    'Татарченко, Тертичной/Тертишной, Тиличко, Тищенко, Ткачев, Ткачев, Токарев, \n' +
                    'Турнеткин или Турпеткин, Турпетка, Удовиченко, Фадиев, Филимонов, Филов, \n' +
                    'Халапурдын, Харковской, Хлонов или Хлонев, Хоменко, Хорошевской/Хорошевский, \n' +
                    'Худобын, Цымбалов, Чалой, Ченцов, Чернишев, Чернухин, Чернушенко, Чернушин, \n' +
                    'Чогунов, Чумаков, Шамрихин, Шаповалов/Шеповалов, Шевцов, Шестопалов, Шимков, \n' +
                    'Широкий/Широкой, Шкилев, Шкуровский, Шморкачев, Шульгин, Шутенко, Щербина'
            },
            {
                name: 'хут. Очкуров',
                data: []
            },
            {
                name: 'хут. Павленков',
                data: []
            },
            {
                name: 'сл. Павловка',
                data: []
            },
            {
                name: 'сл. Пантюхина',
                data: []
            },
            {
                name: 'хут. Паньковка',
                data: []
            },
            {
                name: 'хут. Певнев',
                data: []
            },
            {
                name: 'сл. Пелагиадовка',
                data: []
            },
            {
                name: 'хут. Пельшанский',
                data: []
            },
            {
                name: 'хут. Передельск',
                data: []
            },
            {
                name: 'с. Песчаное (Пески)',
                data: []
            },
            {
                name: 'хут. Петренков 1-й',
                data: []
            },
            {
                name: 'хут. Петренков 2-й (Королина, Селивкиной)',
                data: []
            },
            {
                name: 'д. Петровенька',
                data: []
            },
            {
                name: 'сл. Петропавловка (Царевка 2-я). Список фамилий за 1816 г.',
                data: 'Бандур, Бардак, Бардаш, Баскачев, Белецкий, Белоус, Белоусов, \n' +
                    'Белоцерковщенко, Бережной, Бережный, Берчанский, Беспалый, Богиня, Божков, \n' +
                    'Бондаренко, Бородаев, Бородай, Босенко, Бубко, Бубличенко, Буймарский, \n' +
                    'Булименко, Бурсук, Бутко, Васильченко, Ветер, Винниченко, Водолазский, \n' +
                    'Войтик, Вразовский, Гаврюшенко, Гайдамака, Гаркушенко, Гетманский, Гиренко, \n' +
                    'Голубцов, Гончаренко, Гордиенко, Гракало, Гречаник, Гречиха, Гречушенко, \n' +
                    'Гриценко, Гусак, Дедченко, Демиденко, Демченко, Диканенко, Дикань, Диконь, \n' +
                    'Довженко, Долженко, Дубина, Дуденко, Дудник, Дудченко, Дяков, Журбенко, \n' +
                    'Заболотный, Загатченко, Зарвовский, Захлипа, Заярный, Заяц, Згоденко, \n' +
                    'Зенченко, Зудченко, Илитовский, Каверцов, Каменюка, Келюх, Келюшенко, \n' +
                    'Киевский, Кирпичев, Кисиминов, Клачко, Кобзарь, Коваленко, Колесниченко, \n' +
                    'Комисаренко, Кондратенко, Кондратов, Конюшенко, Коробейник, Король, Коршак, \n' +
                    'Коршик, Косуля, Кошеленко, Кравченко, Кузубенко, Лавриненко, Латун, Латунь, \n' +
                    'Лебединский, Лебедь, Лисняк, Лоза, Марченко, Мироновский, Миропольский, \n' +
                    'Мирошниченко, Монженко, Мороз, Мостовой, Неделенко, Нелипа, Непран, Несвет, \n' +
                    'Нестеренко, Овчаренко, Омельченко, Осиновский, Осияный или Осичный, Палешник \n' +
                    'Панаренко, Пархоменко, Пасечник, Пасешник, Певень, Перебейнос, Пилипенко, \n' +
                    'Поливяной, Понеленко, Понеренко, Пономаренко, Приходко, Приходченко, \n' +
                    'Проинский (Троинский), Прокопенко, Пугачев, Радченко, Редовниченко, \n' +
                    'Резниченко, Рисненко, Роспасеенко, Роспачий, Руденко, Рыбалченко, Рясненко, \n' +
                    'Ряснянский, Савченко, Сало, Сердюченко, Серенко, Сизенко, Синецкий, Скрынник, \n' +
                    'Сличенко, Слюсаренко, Сосоенко, Старченко, Стеценко, Стрельцов, Сысоенко, \n' +
                    'Танцура, Тацкой, Теплянский, Тименко, Ткаченко, Торба, Тупало, Федоренко, \n' +
                    'Фесенко, Фоменко, Харченко, Хижняк, Хитенко, Христосенко, Худолей, Цыбенко, \n' +
                    'Черепаха, Черепашенко, Черепенко, Черепеня, Черников, Чернышев, Чернышенко, \n' +
                    'Чикиряка, Черный, Шаповаленко, Шевцов, Шелих, Штефаненко, Якуба'
            },
            {
                name: 'хут. Плужный',
                data: []
            },
            {
                name: 'сл. Подгоровка (Придворок)',
                data: []
            },
            {
                name: 'хут. Подрезунов',
                data: []
            },
            {
                name: 'сл. Покровская Верхняя',
                data: []
            },
            {
                name: 'сл. Покровское (Нижняя Покровская)',
                data: []
            },
            {
                name: 'с. Половинкино (Толоковка)',
                data: []
            },
            {
                name: 'хут. Полтавский (Голая Балка)',
                data: []
            },
            {
                name: 'сл. Поповка',
                data: []
            },
            {
                name: 'с. Проезжее',
                data: []
            },
            {
                name: 'хут. Проказин (Бурдовка, Слободка)',
                data: []
            },
            {
                name: 'сл. Просяная',
                data: []
            },
            {
                name: 'хут. Пурдовка (список фамилий за 1835 г.)',
                data: 'Вакуленко, Вакулин, Вернигора, Высочин, Григорьев, Давыденко, Дукачев, \n' +
                    'Запорожец, Кондратенко, Корочинский, Коцаренко, Куринский, Ликаренко, \n' +
                    'Литвин, Лысенко, Мирошников, Носаченко, Прилипка, Прокофьев, Птушка, \n' +
                    'Самойленко, Скрыпник, Солошенко, Филоненко, Чекачев, Шаповалов'
            },
            {
                name: 'хут. Равнина',
                data: []
            },
            {
                name: 'хут. Разсоховатый',
                data: []
            },
            {
                name: 'сл. Райгородка (Ендилова)',
                data: []
            },
            {
                name: 'с. Рогово',
                data: []
            },
            {
                name: 'с. Романенково (Романовка)',
                data: []
            },
            {
                name: 'с. Рудово',
                data: []
            },
            {
                name: 'с. Рыбянцово',
                data: []
            },
            {
                name: 'хут. Савочкин',
                data: []
            },
            {
                name: 'хут. Садки',
                data: []
            },
            {
                name: 'хут. Светликовка (Светличный)',
                data: []
            },
            {
                name: 'сл. Святодмитриевка (Капитанова)',
                data: []
            },
            {
                name: 'хут. Семикозов',
                data: []
            },
            {
                name: 'хут. Сеньков (Плотовка)',
                data: []
            },
            {
                name: 'хут. Синельников (Путнев)',
                data: []
            },
            {
                name: 'сл. Смольянинова',
                data: []
            },
            {
                name: 'сл. Спеваковка (список фамилий за 1762 г.)',
                data: 'Авилов, Агеев, Аденинов, Андреев, Башкатов, Боев, Болдырев, Бондарев, \n' +
                    'Валуйсков, Волков, Глатков, Говоров, Гончаров, Гребенников, Денежников, \n' +
                    'Житкой, Заморенской, Кожаев, Колесин, Малегин, Маслеников, Нагибин, Нежин, \n' +
                    'Новиков, Палов, Полезин, Поляков, Полянский, Попов, Пупков, Пылев, Растегаев, \n' +
                    'Саврасов, Семенов, Сидоров, Симанов, Смирной, Соколов, Такарев, Тарасов, \n' +
                    'Тишин, Трубицин, Хомяков, Храмоной, Хрипунов, Цуканов, Чеботарев, Чижиков, \n' +
                    'Чуприна, Шестопалов, Яйко'
            },
            {
                name: 'г. Старобельск',
                data: []
            },
            {
                name: 'сл. Старый Айдар',
                data: []
            },
            {
                name: 'хут. Стативкин (Пугачевка)',
                data: []
            },
            {
                name: 'д. Степановка (Геевка, Бедряги)',
                data: []
            },
            {
                name: 'хут. Степная Слобода (фамилии жителей хутора в 1835 г.)',
                data: 'Гастенков, Петухов, Смитаннин, Шапаков'
            },
            {
                name: 'сл. Стрельцовка (Стрелецкий, Чечевка)',
                data: []
            },
            {
                name: 'с. Стрелецкий Государственный Конный Завод',
                data: []
            },
            {
                name: 'д. Счастье (Ковалевка)',
                data: []
            },
            {
                name: 'хут. Сычев',
                data: []
            },
            {
                name: 'сл. Танюшевка (Березовка)',
                data: []
            },
            {
                name: 'хут. Татаренково',
                data: []
            },
            {
                name: 'хут. Терновый',
                data: []
            },
            {
                name: 'хут. Тецкий (Нижяя Гремучая)',
                data: []
            },
            {
                name: 'с. Титаренково',
                data: []
            },
            {
                name: 'с. Тишковка',
                data: []
            },
            {
                name: 'хут. Толстое',
                data: []
            },
            {
                name: 'хут. Трембачев',
                data: []
            },
            {
                name: 'хут. Третьяков',
                data: []
            },
            {
                name: 'сл. Трехизбенская',
                data: []
            },
            {
                name: 'хут. Труд Родительский (Трутовка)',
                data: []
            },
            {
                name: 'хут. Тышнов',
                data: []
            },
            {
                name: 'хут. Фоменков (На Белой)',
                data: []
            },
            {
                name: 'хут. Фоменков (На Козинке, Бервинов)',
                data: []
            },
            {
                name: 'хут. Царевский (Прищеповка)',
                data: []
            },
            {
                name: 'хут. Целуйков',
                data: []
            },
            {
                name: 'хут. Чебановка',
                data: []
            },
            {
                name: 'сл. Черниговка (Верхния Сотни). Фамилии раскольников, 1832 г.',
                data: 'Барадин, Будников, Калчев, Касаткин, Колесников, Кручинин, Малеев, \n' +
                    'Никитин, Павлов, Пастухов, Полеской, Салагубов, Скороходов, Хренов, \n' +
                    'Худяков, Чеботарев'
            },
            {
                name: 'хут. Чмыровка',
                data: []
            },
            {
                name: 'хут. Шапорский',
                data: []
            },
            {
                name: 'сл. Шарова',
                data: []
            },
            {
                name: 'хут. Шахов',
                data: []
            },
            {
                name: 'хут. Царевский (Прищеповка)',
                data: []
            },
            {
                name: 'хут. Шевкунов',
                data: []
            },
            {
                name: 'сл. Шелистовая',
                data: []
            },
            {
                name: 'хут. Шпотина (Верхняя Гремучая)',
                data: []
            },
            {
                name: 'сл. Штормова',
                data: []
            },
            {
                name: 'хут. Шуликин',
                data: []
            },
            {
                name: 'сл. Шульгинка (список фамилий за 1825 г.)',
                data: 'Антипенко, Бардак, Бардак, Баталига, Белашенко, Белик, Бережной, Беседа, \n' +
                    'Бондаренко, Борщ, Бурмаченко, Васильев, Вехуленко, Волинец, Волошин, Гайдук, \n' +
                    'Геенко, Герасименко, Гладкой, Гончаров, Грудницкий, Деркач, Димовеев, Димовес, \n' +
                    'Домопятый, Дяченко, Жадин, Жалеев, Жевага, Задько, Заец, Зарязнко, Ивахненко, \n' +
                    'Игнатенко, Калашник, Кирпа, Ключка, Кобыленко, Коваль, Ковтун, Кондус, \n' +
                    'Кониченко, Костенко, Костюк, Кочерга, Кочка, Кривенко, Крикун, Куренный, \n' +
                    'Леженко, Линько, Литвяченко, Литовченко, Лозовой, Луганский, Матяш, Мачуга, \n' +
                    'Мижирацкий, Миирцкий, Мирошниченко, Мостовой, Назаренко, Нехристов, Никитенко, \n' +
                    'Олейник, Осауленко, Осиченко, Пархоменко, Пезник, Перепелица, Петренко, \n' +
                    'Погорелой, Потопа, Поцалуйко, Правенькой, Приходько, Прядка, Пугач, Пушкаренко, \n' +
                    'Радченко, Резниченко, Романов, Ромашко, Рубан, Савченко, Сало, Санжаровский, \n' +
                    'Свистун, Сердюк, Синецкий, Скрипник, Сыровой, Твердохлеб, Терещенко, Ткаченко, \n' +
                    'Трошка, Трощенко, Тымценко, Федоряченко, Чапуль, Чижик, Чуприна, Шаповаленко, \n' +
                    'Шевела, Шевченко, Шелкопляс, Шелкунов, Шенгор, Шкарабейко, Шолкунов, Шрашко, \n' +
                    'Шутенко, Юрченко, Якименко, Ярошенко'
            },
            {
                name: 'с. Ямное (Никольское, Ямны)',
                data: []
            },
            {
                name: 'хут. Ямный',
                data: []
            }]},
            {
                name: "Сумской уезд",
                data: []
            },
            {
                name: "Харьковский уезд",
                data: []
            }]},

            {
                name: "Херсонская губерния",
                data: [
                    {
                        name: "Александрийский уезд",
                        data: [
                            {
                                name: 'г. Александрия',
                                data: []
                    },
                    {
                        name: 'Аджамская волость',
                        data: []
                    },
                    {
                        name: 'Бандуровская волость',
                        data: []
                    },
                    {
                        name: 'Богоявленская волость',
                        data: []
                    },
                    {
                        name: 'Боковская волость',
                        data: []
                    },
                    {
                        name: 'Братолюбовская волость',
                        data: []
                    },
                    {
                        name: 'Верблюжская волость',
                        data: []
                    },
                    {
                        name: 'Глинская волость',
                        data: []
                    },
                    {
                        name: 'Дмитровская волость',
                        data: []
                    },
                    {
                        name: 'Елисаветградковская волость',
                        data: []
                    },
                    {
                        name: 'Звенигородская волость',
                        data: []
                    },
                    {
                        name: 'Иванковецкая волость',
                        data: []
                    },
                    {
                        name: 'Косовская волость',
                        data: []
                    },
                    {
                        name: 'Красно-Камянская волость',
                        data: []
                    },
                    {
                        name: 'Красносельская волость',
                        data: []
                    },
                    {
                        name: 'Машоринская волость',
                        data: []
                    },
                    {
                        name: 'Мироновская волость',
                        data: []
                    },
                    {
                        name: 'Моисеевская волость',
                        data: []
                    },
                    {
                        name: 'Новгородковская волость',
                        data: []
                    },
                    {
                        name: 'Ново-Георгиевская волость',
                        data: []
                    },
                    {
                        name: 'Ново-Прагская волость',
                        data: []
                    },
                    {
                        name: 'Ново-Стародубская волость',
                        data: []
                    },
                    {
                        name: 'Онуфриевская волость',
                        data: []
                    },
                    {
                        name: 'Оситняжская волость',
                        data: []
                    },
                    {
                        name: 'Павлышская волость',
                        data: []
                    },
                    {
                        name: 'Петровская волость',
                        data: []
                    },
                    {
                        name: 'Покровская волость',
                        data: []
                    },
                    {
                        name: 'Светлопольская волость',
                        data: []
                    },
                    {
                        name: 'Стецовская волость',
                        data: []
                    },
                    {
                        name: 'Субботская волость',
                        data: []
                    },
                    {
                        name: 'Федварская волость',
                        data: []
                    },
                    {
                        name: 'Федоровская волость',
                        data: []
                    },
                    {
                        name: 'Цыбулевская волость',
                        data: []
            }]},
            {
                name: "Ананьевский уезд",
                data: [
                    {
                        name: 'г. Ананьев',
                        data: []
            },
            {
                name: 'Александровская волость',
                data: []
            },
            {
                name: 'Бирзуловская волость',
                data: []
            },
            {
                name: 'Валегоцуловская волость',
                data: []
            },
            {
                name: 'Врадиевская волость',
                data: []
            },
            {
                name: 'Гандрабуровская волость',
                data: []
            },
            {
                name: 'Гвоздавская волость',
                data: []
            },
            {
                name: 'Головлевская волость',
                data: []
            },
            {
                name: 'Завадовская волость',
                data: []
            },
            {
                name: 'Исаевская волость',
                data: []
            },
            {
                name: 'Каменно-Мостская волость',
                data: []
            },
            {
                name: 'Кантакузовская волость',
                data: []
            },
            {
                name: 'Кондратовская волость',
                data: []
            },
            {
                name: 'Кохановская волость',
                data: []
            },
            {
                name: 'Любашевская волость',
                data: []
            },
            {
                name: 'Мостовская волость',
                data: []
            },
            {
                name: 'Николаевская 1-я волость',
                data: []
            },
            {
                name: 'Николаевская 2-я волость',
                data: []
            },
            {
                name: 'Ново-Георгиевская волость',
                data: []
            },
            {
                name: 'Ново-Павловская волость',
                data: []
            },
            {
                name: 'Пасицельская волость',
                data: []
            },
            {
                name: 'Петровская волость',
                data: []
            },
            {
                name: 'Покровская волость',
                data: []
            },
            {
                name: 'Раштадская волость',
                data: []
            },
            {
                name: 'Романково-Балковская волость',
                data: []
            },
            {
                name: 'Свято-Троицкая волость',
                data: []
            },
            {
                name: 'Ставровская волость',
                data: []
            },
            {
                name: 'Степановская волость',
                data: []
            }]},
            {
                name: "Елисаветградский уезд",
                data: [
                    {
                        name: 'г. Елисаветград',
                        data: []
                    },
                    {
                        name: 'Акимовская волость',
                        data: []
                    },
                    {
                        name: 'Александровская волость',
                        data: []
                    },
                    {
                        name: 'Алексеевская волость',
                        data: []
                    },
                    {
                        name: 'Аннинская волость',
                        data: []
                    },
                    {
                        name: 'Анновская волость',
                        data: []
                    },
                    {
                        name: 'Антоновская волость',
                        data: []
                    },
                    {
                        name: 'Березовская волость',
                        data: []
                    },
                    {
                        name: 'Благодатновская волость',
                        data: []
                    },
                    {
                        name: 'Большевысковская волость',
                        data: []
                    },
                    {
                        name: 'Братская волость',
                        data: []
                    },
                    {
                        name: 'Викторштадская волость',
                        data: []
                    },
                    {
                        name: 'Витязевская волость',
                        data: []
                    },
                    {
                        name: 'Владимировская волость',
                        data: []
                    },
                    {
                        name: 'Вознесенская волость',
                        data: []
                    },
                    {
                        name: 'Возсиятская волость',
                        data: []
                    },
                    {
                        name: 'Глодозская волость',
                        data: []
                    },
                    {
                        name: 'Грузчанская волость',
                        data: []
                    },
                    {
                        name: 'Добровеличковская волость',
                        data: []
                    },
                    {
                        name: 'Еланецкая волость',
                        data: []
                    },
                    {
                        name: 'Злынская волость',
                        data: []
                    },
                    {
                        name: 'Казанская волость',
                        data: []
                    },
                    {
                        name: 'Кетрисановская волость',
                        data: []
                    },
                    {
                        name: 'Компанеевская волость',
                        data: []
                    },
                    {
                        name: 'Константиновская волость',
                        data: []
                    },
                    {
                        name: 'Липняжская волость',
                        data: []
                    },
                    {
                        name: 'Лозоватская волость',
                        data: []
                    },
                    {
                        name: 'Лысогорская волость',
                        data: []
                    },
                    {
                        name: 'Любомирская волость',
                        data: []
                    },
                    {
                        name: 'Мало-Высковская волость',
                        data: []
                    },
                    {
                        name: 'Мартоношская волость',
                        data: []
                    },
                    {
                        name: 'Надлакская волость',
                        data: []
                    },
                    {
                        name: 'Нечаевская волость',
                        data: []
                    },
                    {
                        name: 'Ново-Архангельская волость',
                        data: []
                    },
                    {
                        name: 'Ново-Миргородская волость',
                        data: []
                    },
                    {
                        name: 'Обозновская волость',
                        data: []
                    },
                    {
                        name: 'Ольгопольская волость',
                        data: []
                    },
                    {
                        name: 'Ольшанская волость',
                        data: []
                    },
                    {
                        name: 'Павловская волость',
                        data: []
                    },
                    {
                        name: 'Панчевская волость',
                        data: []
                    },
                    {
                        name: 'Песчано-Бродская волость',
                        data: []
                    },
                    {
                        name: 'Плетено-Ташлыкская волость',
                        data: []
                    },
                    {
                        name: 'Ровенская волость',
                        data: []
                    },
                    {
                        name: 'Семенастовская волость',
                        data: []
                    },
                    {
                        name: 'Татаровская волость',
                        data: []
                    },
                    {
                        name: 'Тишковская волость',
                        data: []
                    },
                    {
                        name: 'Трикратская волость',
                        data: []
                    },
                    {
                        name: 'Устиновская волость',
                        data: []
                    },
                    {
                        name: 'Хмелевская волость',
                        data: []
                    },
                    {
                        name: 'Щербановская волость',
                        data: []
                    },
                    {
                        name: 'Эрделевская волость',
                        data: []
                    }
                ]
            },
            {
                name: "Одесский уезд",
                data: [
                    {
                        name: 'г. Одесса',
                        data: []
            },
            {
                name: 'Александровская волость',
                data: []
            },
            {
                name: 'Александрофельдская волость',
                data: []
            },
            {
                name: 'Анатольевская волость',
                data: []
            },
            {
                name: 'Антоно-Кудинцевская волость',
                data: []
            },
            {
                name: 'Анчекрак-Ильинская волость',
                data: []
            },
            {
                name: 'Баденская волость',
                data: []
            },
            {
                name: 'Больше-Буялыкская волость',
                data: []
            },
            {
                name: 'Бельчанская волость',
                data: []
            },
            {
                name: 'Беляевская волость',
                data: []
            },
            {
                name: 'Гильдендорфская волость',
                data: []
            },
            {
                name: 'Граденицкая волость',
                data: []
            },
            {
                name: 'Зельцская волость',
                data: []
            },
            {
                name: 'Ильинская волость',
                data: []
            },
            {
                name: 'Калаглейская волость',
                data: []
            },
            {
                name: 'Ковалевская волость',
                data: []
            },
            {
                name: 'Коренихская волость',
                data: []
            },
            {
                name: 'Кубанская волость',
                data: []
            },
            {
                name: 'Курисово-Покровская волость',
                data: []
            },
            {
                name: 'Куртовская волость',
                data: []
            },
            {
                name: 'Ландауская волость',
                data: []
            },
            {
                name: 'Мало-Буялыкская волость',
                data: []
            },
            {
                name: 'Мангеймская волость',
                data: []
            },
            {
                name: 'Мариинская волость',
                data: []
            },
            {
                name: 'Нейзацкая волость',
                data: []
            },
            {
                name: 'Нейфрейдентальская волость',
                data: []
            },
            {
                name: 'Нечаевская волость',
                data: []
            },
            {
                name: 'Николаевская волость',
                data: []
            },
            {
                name: 'Ново-Покровская волость',
                data: []
            },
            {
                name: 'Петровская волость',
                data: []
            },
            {
                name: 'Раснопольская волость',
                data: []
            },
            {
                name: 'Рорбахская волость',
                data: []
            },
            {
                name: 'Севериновская волость',
                data: []
            },
            {
                name: 'Страсбургская волость',
                data: []
            },
            {
                name: 'Тузловская волость',
                data: []
            }]},
            {
                name: "Тираспольский уезд",
                data: [
                    {
                        name: 'г. Тирасполь',
                        data: []
                    },
                    {
                        name: 'Гликстальская волость',
                        data: []
                    },
                    {
                        name: 'Гофиунгстальская волость',
                        data: []
                    },
                    {
                        name: 'Демидовская волость',
                        data: []
                    },
                    {
                        name: 'Дубовская волость',
                        data: []
                    },
                    {
                        name: 'Евгениевская волость',
                        data: []
                    },
                    {
                        name: 'Захарьевская волость',
                        data: []
                    },
                    {
                        name: 'Кассельская волость',
                        data: []
                    },
                    {
                        name: 'Катаржинская волость',
                        data: []
                    },
                    {
                        name: 'Коротнянская волость',
                        data: []
                    },
                    {
                        name: 'Лунговская волость',
                        data: []
                    },
                    {
                        name: 'Малаештская 1-я волость',
                        data: []
                    },
                    {
                        name: 'Малаештская 2-я волость',
                        data: []
                    },
                    {
                        name: 'Малигоновская волость',
                        data: []
                    },
                    {
                        name: 'Ново-Петровская волость',
                        data: []
                    },
                    {
                        name: 'Парканская волость',
                        data: []
                    },
                    {
                        name: 'Петроверовская волость',
                        data: []
                    },
                    {
                        name: 'Плосковская волость',
                        data: []
                    },
                    {
                        name: 'Понятовская волость',
                        data: []
                    },
                    {
                        name: 'Россияновская волость',
                        data: []
                    },
                    {
                        name: 'Слободзейская волость',
                        data: []
                    },
                    {
                        name: 'Ташлыкская волость',
                        data: []
                    }
                ]
            },
            {
                name: "Херсонский уезд",
                data: [
                    {
                        name: 'г. Херсон',
                        data: []
            },
            {
                name: 'Александровская волость',
                data: []
            },
            {
                name: 'Антоновская волость',
                data: []
            },
            {
                name: 'Балацковская волость',
                data: []
            },
            {
                name: 'Белозерская волость',
                data: []
            },
            {
                name: 'Вавиловская волость',
                data: []
            },
            {
                name: 'Владимировская волость',
                data: []
            },
            {
                name: 'Грушевская волость',
                data: []
            },
            {
                name: 'Гурьевская волость',
                data: []
            },
            {
                name: 'Заградовская волость',
                data: []
            },
            {
                name: 'Засельская волость',
                data: []
            },
            {
                name: 'Золотобалковская волость',
                data: []
            },
            {
                name: 'Казацкая волость',
                data: []
            },
            {
                name: 'Калужская волость',
                data: []
            },
            {
                name: 'Камянская волость',
                data: []
            },
            {
                name: 'Качкаровская волость',
                data: []
            },
            {
                name: 'Кисляковская волость',
                data: []
            },
            {
                name: 'Криворогская волость',
                data: []
            },
            {
                name: 'Кронаурская волость',
                data: []
            },
            {
                name: 'Любомирская волость',
                data: []
            },
            {
                name: 'Марьинская волость',
                data: []
            },
            {
                name: 'Михайловская волость',
                data: []
            },
            {
                name: 'Николаевская 1-я волость',
                data: []
            },
            {
                name: 'Николаевская 2-я волость',
                data: []
            },
            {
                name: 'Никольская волость',
                data: []
            },
            {
                name: 'Ново-Бугская волость',
                data: []
            },
            {
                name: 'Ново-Воронцовская волость',
                data: []
            },
            {
                name: 'Ново-Николаевская волость',
                data: []
            },
            {
                name: 'Ново-Одесская волость',
                data: []
            },
            {
                name: 'Орлофская волость',
                data: []
            },
            {
                name: 'Отбедо-Васильевская волость',
                data: []
            },
            {
                name: 'Покровская волость',
                data: []
            },
            {
                name: 'Полтавская волость',
                data: []
            },
            {
                name: 'Привольнянская волость',
                data: []
            },
            {
                name: 'Станиславская волость',
                data: []
            },
            {
                name: 'Старо-Шведская волость',
                data: []
            },
            {
                name: 'Терновская волость',
                data: []
            },
            {
                name: 'Тягинская волость',
                data: []
            },
            {
                name: 'Широковская волость',
                data: []
            },
            {
                name: "Николаевское военное губернаторство"
            }]}]},
            {
                name: "Черниговская губерния",
                data: [
                    {
                        name: "Борзнянский уезд",
                        data: [
                            {
                                name: 'г. Борзна',
                                data: []
                            },
                            {
                                name: 'Борзненская волость',
                                data: []
                            },
                            {
                                name: 'Буромская волость',
                                data: []
                            },
                            {
                                name: 'Велико-Загоровская волость',
                                data: []
                            },
                            {
                                name: 'Ивангородская волость',
                                data: []
                            },
                            {
                                name: 'Иченская волость',
                                data: []
                            },
                            {
                                name: 'Кальчиновская волость',
                                data: []
                            },
                            {
                                name: 'Комаровская волость',
                                data: []
                            },
                            {
                                name: 'Парафиевская волость',
                                data: []
                            },
                            {
                                name: 'Плисковская волость',
                                data: []
                            },
                            {
                                name: 'Стрельницкая волость',
                                data: []
                            },
                            {
                                name: 'Фастовецкая волость',
                                data: []
                            },
                            {
                                name: 'Хороше-Озерская волость',
                                data: []
                            },
                            {
                                name: 'Шаповаловская волость',
                                data: []
                            }
                        ]
                    },
                    {
                        name: "Глуховский уезд",
                        data: [
                            {
                                name: 'г. Глухов',
                                data: []
                    },
                    {
                        name: 'Воронежская волость',
                        data: []
                    },
                    {
                        name: 'Глуховская волость',
                        data: []
                    },
                    {
                        name: 'Есманская волость',
                        data: []
                    },
                    {
                        name: 'Марчихино-Будинская волость',
                        data: []
                    },
                    {
                        name: 'Тулиголовская волость',
                        data: []
                    },
                    {
                        name: 'Улановская волость',
                        data: []
                    },
                    {
                        name: 'Холопковская волость',
                        data: []
                    },
                    {
                        name: 'Ямпольская волость',
                        data: []
                    },
                    {
                        name: 'Ярославецкая волость',
                        data: []
            }]},
            {
                name: "Городнянский уезд",
                data: [
                    {
                        name: 'г. Городня',
                        data: []
            },
            {
                name: 'Велико-Щимельская волость',
                data: []
            },
            {
                name: 'Дроздовицкая волость',
                data: []
            },
            {
                name: 'Любецкая волость',
                data: []
            },
            {
                name: 'Мощенская волость',
                data: []
            },
            {
                name: 'Ново-Боровицкая волость',
                data: []
            },
            {
                name: 'Петрушинская волость',
                data: []
            },
            {
                name: 'Репкинская волость',
                data: []
            },
            {
                name: 'Старо-Руднинская волость',
                data: []
            },
            {
                name: 'Тупичевская волость',
                data: []
            },
            {
                name: 'Ярыловичская волость',
                data: []
            }]},
            {
                name: "Козелецкий уезд",
                data: [
                    {
                        name: 'г. Козелец',
                        data: []
                    },
                    {
                        name: 'Бобровицкая волость',
                        data: []
                    },
                    {
                        name: 'Вороньковская волость',
                        data: []
                    },
                    {
                        name: 'Держановская волость',
                        data: []
                    },
                    {
                        name: 'Кобыжчанская волость',
                        data: []
                    },
                    {
                        name: 'Козелецкая волость',
                        data: []
                    },
                    {
                        name: 'Мостищенская волость',
                        data: []
                    },
                    {
                        name: 'Новобасанская волость',
                        data: []
                    },
                    {
                        name: 'Новобыковская волость',
                        data: []
                    },
                    {
                        name: 'Олишевская волость',
                        data: []
                    },
                    {
                        name: 'Чемерская волость',
                        data: []
                    },
                    {
                        name: 'Щасновская волость',
                        data: []
                    },
                    {
                        name: 'Ядловская волость',
                        data: []
                    },
                    {
                        name: 'Ярославская волость',
                        data: []
                    }
                ]
            },
            {
                name: "Конотопский уезд",
                data: [
                    {
                        name: 'г. Конотоп',
                        data: []
            },
            {
                name: 'Батуринская волость',
                data: []
            },
            {
                name: 'Бахмачская волость',
                data: []
            },
            {
                name: 'Велико-Самборская волость',
                data: []
            },
            {
                name: 'Голенская волость',
                data: []
            },
            {
                name: 'Дмитровская волость',
                data: []
            },
            {
                name: 'Карабутовская волость',
                data: []
            },
            {
                name: 'Конотопская волость',
                data: []
            },
            {
                name: 'Кошарская волость',
                data: []
            },
            {
                name: 'Красноколядинская волость',
                data: []
            },
            {
                name: 'Краснянская волость',
                data: []
            },
            {
                name: 'Семяновская волость',
                data: []
            }]},
            {
                name: "Кролевецкий уезд",
                data: [
                    {
                        name: 'г. Кролевец',
                        data: []
                    },
                    {
                        name: 'Алтыновская волость',
                        data: []
                    },
                    {
                        name: 'Атюшская волость',
                        data: []
                    },
                    {
                        name: 'Клишковская волость',
                        data: []
                    },
                    {
                        name: 'Коропская волость',
                        data: []
                    },
                    {
                        name: 'Кролевецкая волость',
                        data: []
                    },
                    {
                        name: 'Мутинская волость',
                        data: []
                    },
                    {
                        name: 'Оболонская волость',
                        data: []
                    },
                    {
                        name: 'Покошичская волость',
                        data: []
                    },
                    {
                        name: 'Понорницкая волость',
                        data: []
                    },
                    {
                        name: 'Чаплеевская волость',
                        data: []
                    }
                ]
            },
            {
                name: "Мглинский уезд",
                data: [
                    {
                        name: 'г. Мглин',
                        data: []
            },
            {
                name: 'Алексеевская волость',
                data: []
            },
            {
                name: 'Балыкская волость',
                data: []
            },
            {
                name: 'Воробейнская волость',
                data: []
            },
            {
                name: 'Ивайтенская волость',
                data: []
            },
            {
                name: 'Костеничская волость',
                data: []
            },
            {
                name: 'Котляковская волость',
                data: []
            },
            {
                name: 'Краснорогская волость',
                data: []
            },
            {
                name: 'Кульневская волость',
                data: []
            },
            {
                name: 'Мглинская волость',
                data: []
            },
            {
                name: 'Нивнянская волость',
                data: []
            },
            {
                name: 'Павловская волость',
                data: []
            },
            {
                name: 'Почепская волость',
                data: []
            },
            {
                name: 'Пьяногорская волость',
                data: []
            },
            {
                name: 'Романовская волость',
                data: []
            },
            {
                name: 'Старосельская волость',
                data: []
            }]},
            {
                name: "Нежинский уезд",
                data: [
                    {
                        name: 'г. Нежин',
                        data: []
                    },
                    {
                        name: 'Веркиевская волость',
                        data: []
                    },
                    {
                        name: 'Володько-Девицкая волость',
                        data: []
                    },
                    {
                        name: 'Галицкая волость',
                        data: []
                    },
                    {
                        name: 'Дремайловская волость',
                        data: []
                    },
                    {
                        name: 'Дроздовская волость',
                        data: []
                    },
                    {
                        name: 'Лосиновская волость',
                        data: []
                    },
                    {
                        name: 'Макиевская волость',
                        data: []
                    },
                    {
                        name: 'Монастырищенская волость',
                        data: []
                    },
                    {
                        name: 'Мринская волость',
                        data: []
                    },
                    {
                        name: 'Носовская волость',
                        data: []
                    },
                    {
                        name: 'Нежинская волость',
                        data: []
                    },
                    {
                        name: 'Талалаевская волость',
                        data: []
                    }
                ]
            },
            {
                name: "Новгород-Северский уезд",
                data: [
                    {
                        name: 'г. Новгород-Северский',
                        data: []
                    },
                    {
                        name: 'Гремячская волость',
                        data: []
                    },
                    {
                        name: 'Дмитровская волость',
                        data: []
                    },
                    {
                        name: 'Ивотская волость',
                        data: []
                    },
                    {
                        name: 'Костобобровская волость',
                        data: []
                    },
                    {
                        name: 'Мамекинская волость',
                        data: []
                    },
                    {
                        name: 'Орловская волость',
                        data: []
                    },
                    {
                        name: 'Протопоповская волость',
                        data: []
                    },
                    {
                        name: 'Рыковская волость',
                        data: []
                    },
                    {
                        name: 'Старожадовская волость',
                        data: []
                    },
                    {
                        name: 'Фаевская волость',
                        data: []
                    },
                    {
                        name: 'Хильчичанская волость',
                        data: []
                    },
                    {
                        name: 'Чернацкая волость',
                        data: []
                    }
                ]
            },
            {
                name: "Новозыбковский уезд",
                data: [
                    {
                        name: 'г. Новозыбков',
                        data: []
            },
            {
                name: 'Белоколодезская волость',
                data: []
            },
            {
                name: 'Брахловская волость',
                data: []
            },
            {
                name: 'Великотопальская волость',
                data: []
            },
            {
                name: 'Денисковичская волость',
                data: []
            },
            {
                name: 'Куршановичская волость',
                data: []
            },
            {
                name: 'Лакомобудская волость',
                data: []
            },
            {
                name: 'Людковская волость',
                data: []
            },
            {
                name: 'Малощербиничская волость',
                data: []
            },
            {
                name: 'Новобобовичская волость',
                data: []
            },
            {
                name: 'Новоропская волость',
                data: []
            },
            {
                name: 'Семеновская волость',
                data: []
            }]},
            {
                name: "Остерский уезд",
                data: [
                    {
                        name: 'г. Остер',
                        data: []
                    },
                    {
                        name: 'Броварская волость',
                        data: []
                    },
                    {
                        name: 'Волчковская волость',
                        data: []
                    },
                    {
                        name: 'Гоголевская волость',
                        data: []
                    },
                    {
                        name: 'Жукинская волость',
                        data: []
                    },
                    {
                        name: 'Моровская волость',
                        data: []
                    },
                    {
                        name: 'Никольско-Слободская волость',
                        data: []
                    },
                    {
                        name: 'Остерская волость',
                        data: []
                    },
                    {
                        name: 'Семиполковская волость',
                        data: []
                    },
                    {
                        name: 'Сорокошичская волость',
                        data: []
                    }
                ]
            },
            {
                name: "Сосницкий уезд",
                data: [
                    {
                        name: 'г. Сосница',
                        data: []
            },
            {
                name: 'Авдеевская волость',
                data: []
            },
            {
                name: 'Александровская волость',
                data: []
            },
            {
                name: 'Бабская волость',
                data: []
            },
            {
                name: 'Блистовская волость',
                data: []
            },
            {
                name: 'Волосковская волость',
                data: []
            },
            {
                name: 'Менская волость',
                data: []
            },
            {
                name: 'Охрамеевская волость',
                data: []
            },
            {
                name: 'Перелюбская волость',
                data: []
            },
            {
                name: 'Погорельская волость',
                data: []
            },
            {
                name: 'Синявская волость',
                data: []
            },
            {
                name: 'Сосницкая волость',
                data: []
            },
            {
                name: 'Холменская волость',
                data: []
            },
            {
                name: 'Шабалиновская волость',
                data: []
            }]},
            {
                name: "Стародубский уезд",
                data: [
                    {
                        name: 'г. Стародуб',
                        data: []
                    },
                    {
                        name: 'Гарцовская волость',
                        data: []
                    },
                    {
                        name: 'Гриневская волость',
                        data: []
                    },
                    {
                        name: 'Кистерская волость',
                        data: []
                    },
                    {
                        name: 'Куровская волость',
                        data: []
                    },
                    {
                        name: 'Лыщицкая волость',
                        data: []
                    },
                    {
                        name: 'Нижневская волость',
                        data: []
                    },
                    {
                        name: 'Понаровская волость',
                        data: []
                    },
                    {
                        name: 'Соловская волость',
                        data: []
                    },
                    {
                        name: 'Стародубская волость',
                        data: []
                    },
                    {
                        name: 'Чаусовская волость',
                        data: []
                    },
                    {
                        name: 'Юдиновская волость',
                        data: []
                    },
                    {
                        name: 'Яцковская волость',
                        data: []
                    }
                ]
            },
            {
                name: "Суражский уезд",
                data: [
                    {
                        name: 'г. Сураж',
                        data: []
                    },
                    {
                        name: 'Буднянская волость',
                        data: []
                    },
                    {
                        name: 'Верещакская волость',
                        data: []
                    },
                    {
                        name: 'Голубовская волость',
                        data: []
                    },
                    {
                        name: 'Гордеевская волость',
                        data: []
                    },
                    {
                        name: 'Душатинская волость',
                        data: []
                    },
                    {
                        name: 'Заборская волость',
                        data: []
                    },
                    {
                        name: 'Кулагская волость',
                        data: []
                    },
                    {
                        name: 'Лотаковская волость',
                        data: []
                    },
                    {
                        name: 'Ляличская волость',
                        data: []
                    },
                    {
                        name: 'Новодроковская волость',
                        data: []
                    },
                    {
                        name: 'Петровобудская волость',
                        data: []
                    },
                    {
                        name: 'Поповогорская волость',
                        data: []
                    },
                    {
                        name: 'Тулуковская волость',
                        data: []
                    },
                    {
                        name: 'Унушевская волость',
                        data: []
                    },
                    {
                        name: 'Ущерпская волость',
                        data: []
                    }
                ]
            },
            {
                name: "Черниговский уезд",
                data: [
                    {
                        name: 'г. Чернигов',
                        data: []
            },
            {
                name: 'Антоновская волость',
                data: []
            },
            {
                name: 'Березинская волость',
                data: []
            },
            {
                name: 'Горбовская волость',
                data: []
            },
            {
                name: 'Довжицкая волость',
                data: []
            },
            {
                name: 'Козлянская волость',
                data: []
            },
            {
                name: 'Пакульская волость',
                data: []
            },
            {
                name: 'Редьковская волость',
                data: []
            },
            {
                name: 'Салтыково-Девицкая волость',
                data: []
            },
            {
                name: 'Седневская волость',
                data: []
            },
            {
                name: 'Слабинская волость',
                data: []
            },
            {
                name: 'Холявинская волость',
                data: []
            },
            {
                name: 'Яновская волость',
                data: []
            },
             ]
            }]}]


