export const dataua = [
    {
        name: "Воронізька губернія",
        data: [
            {name:"Бирюцький повіт"},
            {name:"Бобровський повіт"},
            {name:"Богучарський повіт"},
            {name:"Валуйський повіт"},
            {name:"Воронізький повіт"},
            {name:"Задонський повіт"},
            {name:"Землянський повіт"},
            {name: "Коротоякський повіт"},
            {name: "Нижньодевіцький повіт"},
            {name: "Новохоперський повіт"},
            {name: "Острогозький повіт"},
            {name:"Павловський повіт"}
        ]
    },
    {
        name: "Катеринославська губернія",
        data:  [
            {name:"Олександрівський повіт"},
            {name:"Бахмутський повіт"},
            {name: "Верхньодніпровський повіт"},
            {name: "Катеринославський повіт"},
            {name: "Маріупольський повіт"},
            {name: "Новомосковський повіт"},
            {name:  "Павлоградський повіт"},
            {name:  "Ростовський повіт"},
            {name:  "Слов’яносербський повіт"}
        ],
    },
    {
        name: "Київська губернія",
        data: [
            {name: "Бердичівський повіт"},
            {name: "Васильківський повіт"},
            {name: "Звенигородський повіт"},
            {name:  "Канівський повіт"},
            {name: "Киівський повіт"},
            {name: "Липовецький повіт"},
            {name: "Радомисльський повіт"},
            {name:  "Сквирський повіт"},
            {name: "Таращанський повіт"},
            {name:  "Уманський повіт"},
            {name: "Черкаський повіт"},
            {name:  "Чигиринський повіт"}
        ]
    },            {
        name: "Курська губернія",
        data: [
            {name: "Білгородський повіт"},
            {name: "Грайворонський повіт"},
            {name:  "Дмитріївський повіт"},
            {name:  "Корочанський повіт"},
            {name:  "Курський повіт"},
            {name:  "Льговський повіт"},
            {name:  "Новооскольський повіт"},
            {name:  "Обоянський повіт"},
            {name:  "Путивльський повіт"},
            {name:  "Рильський повіт"},
            {name:  "Старооскольський повіт"},
            {name:  "Суджанський повіт"},
            {name:  "Тимський повіт"},
            {name:  "Фатежський повіт"},
            {name: "Щигровський повіт"}
        ]
    },
    {
        name: "Полтавська губернія",
        data: [
            {name:"Гадяцький повіт"},
            {name: "Зіньківський повіт"},
            {name:  "Золотоноський повіт"},
            {name:  "Кобеляцький повіт"},
            {name:  "Костянтиноградський повіт"},
            {name:  "Кременчуцький повіт"},
            {name:  "Лохвицький повіт"},
            {name: "Лубенський повіт"},
            {name:  "Миргородський повіт"},
            {name:  "Переяславський повіт"},
            {name:  "Пирятинський повіт"},
            {name:  "Полтавський повіт"},
            {name: "Прилукський повіт"},
            {name:  "Роменський повіт"},
            {name:  "Хорольський повіт"}
        ],
    },
    {
        name: "Таврійська губернія",
        data: [
            {name: "Бердянський повіт"},
            {name: "Дніпровський повіт"},
            {name:  "Євпаторійський повіт"},
            {name: "Мелітопольський повіт"},
            {name:  "Перекопський повіт"},
            {name: "Сімферопольський повіт"},
            {name:   "Феодосійський повіт"},
            {name:   "Ялтинський повіт"},
            {name:  "Керч-Єнікалійське градоначальництво"},
            {name:  "Севастопольське градоначальництво"}
        ],
    }, {
        name: "Харківська губернія",
        data: [
            {name:  "Охтирський повіт"},
            {name:  "Богодухівський повіт"},
            {name:   "Валківський повіт"},
            {name:  "Вовчанський повіт"},
            {name:   "Зміївський повіт"},
            {name:  "Ізюмський повіт"},
            {name:  "Куп’янський повіт"},
            {name:  "Лебединський повіт"},
            {name:  "Старобільський повіт"},
            {name:  "Сумський повіт"},
            {name:  "Харківський повіт"}
        ],
    },{
        name: "Херсонська губернія",
        data: [
            {name: "Олександрійський повіт"},
            {name:  "Ананьївський повіт"},
            {name:  "Єлисаветградський повіт"},
            {name:  "Одеський повіт"},
            {name:  "Тираспольський повіт"},
            {name:  "Херсонський повіт"},
            {name: "Миколаївське військове губернаторство"}
        ],
    },{
        name: "Чернигівська губернія",
        data: [
            {name:  "Борзнянський повіт"},
            {name:  "Глухівський повіт"},
            {name:  "Городнянський повіт"},
            {name:  "Козелецький повіт"},
            {name:  "Конотопський повіт"},
            {name:  "Кролевецький повіт"},
            {name:  "Мглинський повіт"},
            {name:  "Ніжинський повіт"},
            {name:  "Новгород-Сіверський повіт"},
            {name:  "Новозибківський повіт"},
            {name:   "Остерський повіт"},
            {name:   "Сосницький повіт"},
            {name:   "Стародубський повіт"},
            {name:   "Суразький повіт"},
            {name:   "Чернигівський повіт"},
            {name:   "Чернигівський повіт"}
        ]
    }
]