export const data = [
    {
  name: "Воронежская губерния",
  data: [
    "Бирюченский уезд",
    "Бобровский уезд",
    "Богучарский уезд",
    "Валуйский уезд",
    "Воронежский уезд",
    "Задонский уезд",
    "Землянский уезд",
    "Коротоякский уезд",
    "Нижнедевицкий уезд",
    "Новохопёрский уезд",
    "Острогожский уезд",
    "Павловский уезд"
  ]
},
  {
    name: "Екатеринославская губерния",
    data:  [
      "Александровский уезд",
      "Бахмутский уезд",
      "Верхнеднепровский уезд",
      "Екатеринославский уезд",
      "Мариупольский уезд",
      "Новомосковский уезд",
      "Павлоградский уезд",
      "Ростовский уезд",
      "Славяносербский уезд"
    ],
  },
  {
    name: "Киевская губерния",
    data: [
      "Бердичевский уезд",
      "Васильковский уезд",
      "Звенигородский уезд",
      "Каневский уезд",
      "Киевский уезд",
      "Липовецкий уезд",
      "Радомысльский уезд",
      "Свирский уезд",
      "Таращанский уезд",
      "Уманский уезд",
      "Черкасский уезд",
      "Чигиринский уезд"
    ]
  },            {
  name: "Курская губерния",
  data: [
    "Белгородский уезд",
    "Грайворонский уезд",
    "Дмитриевский уезд",
    "Корочанский уезд",
    "Курский уезд",
    "Льговский уезд",
    "Новооскольский уезд",
    "Обоянский уезд",
    " Путивльский уезд",
    "Рыльский уезд",
    "Старооскольский уезд",
    "Суджанский уезд",
    "Тимский уезд",
    "Фатежский уезд",
    "Щигровский уезд"
  ]
},
  {
    name: "Полтавская губерния",
    data: [
      "Гадячский уезд",
      "Зеньковский уезд",
      "Золотоношский уезд",
      "Кобелякский уезд",
      "Константиноградский уезд",
      "Кременчугский уезд",
      "Лохвицкий уезд",
      "Лубенский уезд",
      "Миргородский уезд",
      "Переяславский уезд",
      "Пирятинский уезд",
      "Полтавский уезд",
      "Прилукский уезд",
      "Роменский уезд",
      "Хорольский уезд"
    ],
  },
  {
    name: "Таврическая губерния",
    data: [
      "Бердянский уезд",
      "Днепровский уезд",
      "Евпаторийский уезд",
      "Мелитопольский уезд",
      "Перекопский уезд",
      "Симферопольский уезд",
      "Феодосийский уезд",
      "Ялтинский уезд",
      "Керчь-Еникалийское градоначальство",
      "Севастопольское градоначальство"
    ],
  }, {
  name: "Харьковская губерния",
  data: [
    "Ахтырский уезд",
    "Богодуховский уезд",
    "Валковский уезд",
    "Волчанский уезд",
    "Змиевской уезд",
    "Изюмский уезд",
    "Купянский уезд",
    "Лебединский уезд",
    "Старобельский уезд",
    "Сумской уезд",
    "Харьковский уезд"

  ],
},{
  name: "Херсонская губерния",
  data: [
    "Александрийский уезд",
    "Ананьевский уезд",
    "Елисаветградский уезд",
    "Одесский уезд",
    "Тираспольский уезд",
    "Херсонский уезд",
    "Николаевское военное губернаторство"
  ],
},{
  name: "Черниговская губерния",
  data: [
    "Борзнянский уезд",
    "Глуховский уезд",
    "Городнянский уезд",
    "Козелецкий уезд",
    "Конотопский уезд",
    "Кролевецкий уезд",
    "Мглинский уезд",
    "Нежинский уезд",
    "Новгород-Северский уезд",
    "Новозыбковский уезд",
    "Остерский уезд",
    "Сосницкий уезд",
    "Стародубский уезд",
    "Суражский уезд",
    "Черниговский уезд"
  ]
}
]